{"title": "Espresso Brownies", "description": "Adding espresso powder to these espresso brownies makes them extra rich. I let them sit for a day before cutting into them to let the flavors bloom.", "preparation_time_minutes": 15, "cooking_time_minutes": 35, "steps": ["Preheat the oven to 325 degrees F (165 degrees C). Grease an 11x7-inch baking pan. Sift flour, espresso powder, baking powder, and salt together in a bowl.", "Beat sugar and butter together in a large bowl with an electric mixer until light and fluffy. Beat in eggs until smooth batter forms; beat in chocolate and vanilla extract. Stir flour mixture in just until incorporated; fold in walnuts. Spread batter into prepared pan.", "Bake in the preheated oven until top is dry and edges have started to pull away from the sides of the pan, 35 to 40 minutes. Cool completely before cutting."], "ingredients": [{"name": "flour", "quantity": "1/2 cup"}, {"name": "espresso powder", "quantity": "2 tablespoons"}, {"name": "baking powder", "quantity": "1/8 teaspoon"}, {"name": "Salt", "quantity": "1/8 teaspoon"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "Butter", "quantity": "1/2 cup"}, {"name": "Eggs", "quantity": "2"}, {"name": "Unsweetened baking chocolate", "quantity": "2 ounces"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "Chopped walnuts", "quantity": "1 cup"}], "created": "2024/04/23", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/XKcZuSL4d96HZ49f0swzfbDXGSE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8636011_Espresso-Brownies_Yolanda-Gutierrez_4x3-901dd0f145df40dfb80f87cc2c20b915.jpg"}
{"title": "Pumpkin Cheesecake Cookies", "description": "These pumpkin cheesecake cookies are wonderfully soft and chewy with a delicious cheesecake center. They taste like fall.", "preparation_time_minutes": 30, "cooking_time_minutes": 15, "ingredients": [{"name": "cream cheese", "quantity": "8 ounces"}, {"name": "powdered sugar", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "1 1/2 teaspoons"}, {"name": "canned pumpkin", "quantity": "1/2 cup"}, {"name": "all purpose flour", "quantity": "1 3/4 cups"}, {"name": "pumpkin pie spice", "quantity": "1 tablespoon, divided"}, {"name": "baking soda", "quantity": "1/2 teaspoon"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "butter", "quantity": "3/4 cup, softened"}, {"name": "brown sugar", "quantity": "3/4 cup, packed"}, {"name": "white sugar", "quantity": "1/2 cup, divided"}], "steps": ["Gather all ingredients. Line one tray and one baking sheet with parchment paper.", "Beat cream cheese, powdered sugar, and 1/2 teaspoon vanilla in a medium bowl with an electric mixer on medium-high speed until thoroughly combined.", "Scoop cream cheese using a tablespoon or a well-rounded 2 teaspoon scoop onto the prepared tray. Freeze filling mounds until frozen solid, 1 hour.", "Preheat the oven to 375 degrees F (190 degrees C). Spread canned pumpkin evenly out on a plate into a 4-inch square.", "Press pumpkin with a paper towel to extract excess moisture. Repeat blotting with a new paper towel until very little moisture is being soaked up by the towel, about 6 times. Set aside.", "Stir flour, 2 teaspoons pumpkin pie spice, baking soda, and salt together in a medium mixing bowl; set aside.", "Beat butter with an electric mixer on medium to high speed in a large bowl for 30 seconds.", "Add brown sugar and 1/4 cup white sugar. Beat until combined, scraping sides of bowl occasionally.", "Add pumpkin, and remaining 1 teaspoon vanilla; beat until combined.", "Using a wooden spoon, stir in flour mixture.", "Mix remaining 1/4 cup white sugar and 1 teaspoon pumpkin pie spice together in a small bowl.", "Use a 1 1/2 tablespoon cookie scoop or rounded measuring tablespoon to portion cooking dough into 18 pieces.", "To shape each cookie, pat a portion of the dough into a 2 1/2- to 3-inch circle in the palm of your hand.", "Place a frozen ball of the cream cheese mixture into the middle of the cookie dough, pressing the dough around the filling, then rolling with your hands to form a ball.", "Roll ball in sugar and pumpkin pie spice mixture, then place on prepared baking sheet, about 3 inches apart. Repeat with remaining dough and filling. Bake the first batch in the preheated oven."], "created": "2024/08/21", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/ybYjI44pXPHNGz_e6NpzoEhouDg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7972485-pumpkin-cheesecake-cookies-ddmfs-4x3-1f8fb4be6be04cfca265024e5724181f.jpg"}
{"title": "Apple Pie Egg Rolls", "description": "Delicious apple pie filling wrapped in an egg roll wrapper and fried until golden brown. These apple pie egg rolls have a perfect crunchy exterior with a gooey apple filling.", "preparation_time_minutes": 20, "cooking_time_minutes": 25, "steps": ["Gather all ingredients.", "In a large saucepan, stir together apples, sugar, lemon juice, cinnamon, and salt. Whisk 1/4 cup of water and 1 tablespoon of cornstarch together; add to saucepan and stir.", "Bring apple mixture to a boil over medium-high heat, stirring occasionally. Reduce heat to low, cover, and cook until apples are tender-crisp, about 8 minutes. Uncover and cook until apples are tender, about 8 more minutes.", "Stir 1 1/2 teaspoons water and 1 teaspoon cornstarch in a small bowl. Add to apple mixture and cook, stirring often, until thickened, about 2 minutes.", "Remove from heat and spread mixture on a large plate to cool in the refrigerator, about 15 minutes.", "While apple mixture cools, heat oil in a medium Dutch oven to 350 degrees F (175 degrees C).", "Place one egg roll wrapper on a work surface with a corner facing you. Spoon 3 tablespoons of apple mixture across the lower third of the wrapper. Brush edges with beaten egg. Roll up and fold in sides to create an egg roll shape. Repeat with remaining wrappers.", "Fry egg rolls in hot oil in batches, turning occasionally, until golden brown and crispy, about 4 minutes per batch. Transfer to a paper towel-lined plate to drain.", "Serve immediately and enjoy!"], "ingredients": [{"name": "mixed apples (such as Golden Delicious, Granny Smith, and Honeycrisp)", "quantity": "4 1/2 cups, peeled, cored, and chopped"}, {"name": "granulated sugar", "quantity": "1/4 cup"}, {"name": "fresh lemon juice", "quantity": "1 tablespoon"}, {"name": "ground cinnamon", "quantity": "1 teaspoon"}, {"name": "kosher salt", "quantity": "1/4 teaspoon"}, {"name": "tap water", "quantity": "1/4 cup"}, {"name": "cornstarch", "quantity": "1 tablespoon"}, {"name": "neutral cooking oil (such as canola oil)", "quantity": "for frying"}, {"name": "egg roll wrappers", "quantity": "8"}, {"name": "large egg, beaten", "quantity": "1"}, {"name": "tap water", "quantity": "1 1/2 teaspoons"}, {"name": "cornstarch", "quantity": "1 teaspoon"}], "created": "2024/09/25", "ratings": 3.0, "image_url": "https://www.allrecipes.com/thmb/tNzL8cwvw1Jqd2Y76391IM0frKE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8710442-Apple-Pie-Egg-Rolls-ddmfs-0570-4x3-beauty-db043a2ef6bd4dc0b1bf8eb7acfd0177.jpg"}
{"title": "Apple Butter Cheesecake Bars", "description": "Rich cheesecake bars with a creamy filling swirled with apple butter on a cinnamon graham cracker crust.", "preparation_time_minutes": 25, "cooking_time_minutes": 45, "steps": ["Gather all ingredients.", "Preheat oven to 350 degrees F (175 degrees C) and place rack in lower third. Line a 9x13-inch baking pan with foil, leaving a 2-inch overhang on the sides. Coat pan with cooking spray.", "For the crust, mix graham cracker crumbs, melted butter, sugar, cinnamon, and salt in a large bowl. Press mixture into the bottom of the pan.", "Bake crust until lightly golden, 7-10 minutes. Let cool for 15 minutes. Reduce oven temperature to 300 degrees F (150 degrees C).", "For the filling, beat cream cheese and sour cream in a mixer until fluffy, 3-4 minutes. Add sugar and salt, and mix until combined.", "Add eggs one at a time, mixing on low after each. Add heavy cream and vanilla extract, and mix until combined.", "Pour filling over cooled crust. Dollop apple butter over the filling and use a knife to swirl in a zig-zag pattern.", "Place baking pan in a roasting pan and fill with boiling water halfway up the sides. Bake until cheesecake jiggles slightly but is set around edges, 35-40 minutes.", "Turn off oven and crack door open. Let cheesecake cool in the oven for 30 minutes. Remove from water bath and cool at room temperature for 30 minutes, then chill in the fridge for 4 hours or overnight.", "Use foil to lift cheesecake out of pan. Cut into 12 bars and serve chilled."], "ingredients": [{"name": "cooking spray", "quantity": "for coating pan"}, {"name": "graham cracker crumbs", "quantity": "3 cups"}, {"name": "unsalted butter, melted", "quantity": "3/4 cup"}, {"name": "granulated sugar", "quantity": "1/2 cup"}, {"name": "ground cinnamon", "quantity": "3/4 teaspoon"}, {"name": "kosher salt", "quantity": "1/2 teaspoon"}, {"name": "cream cheese, at room temperature", "quantity": "3 (8-ounce) packages"}, {"name": "sour cream, at room temperature", "quantity": "3/4 cup"}, {"name": "granulated sugar", "quantity": "3/4 cup"}, {"name": "kosher salt", "quantity": "1/4 teaspoon"}, {"name": "large eggs, at room temperature", "quantity": "3"}, {"name": "heavy cream", "quantity": "1/4 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "apple butter", "quantity": "3/4 cup"}], "created": "2024/09/23", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/8y5AlURUbdjdw9nK9CFTjAbWRAA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8707173-Apple-Butter-Cheesecake-Bars-ddmfs-0288-4x3-beauty-c8e8021d20664398ba0179f10f5a27af.jpg"}
{"title": "Banana Pudding", "description": "Classic banana pudding with homemade custard, layered with bananas and vanilla wafers, topped with meringue.", "preparation_time_minutes": 20, "cooking_time_minutes": 20, "steps": ["Stir together sugar, flour, and salt in a large bowl. Whisk in milk, egg yolks, and whole eggs until smooth.", "Melt butter in a saucepan over medium heat. Add milk mixture; reduce heat to medium-low, whisking constantly until thickened, about 20 minutes. Remove from heat, stir in 2 teaspoons vanilla, and let cool to room temperature, about 1 hour.", "Peel and slice bananas. Arrange vanilla wafers in the bottom and sides of two 9x13-inch casserole dishes, then layer banana slices over wafers. Pour cooled custard over bananas and wafers.", "In a clean bowl, beat egg whites, cream of tartar, 1 tablespoon sugar, and 1 teaspoon vanilla at high speed until stiff peaks form. Spoon meringue over custard, covering completely.", "Broil meringues until browned, about 1-2 minutes, keeping a close eye to avoid burning.", "Allow meringue to cool for 15 minutes, then serve or chill covered for up to 4 days."], "ingredients": [{"name": "sugar", "quantity": "1 cup plus 1 tablespoon"}, {"name": "flour", "quantity": "1/2 cup"}, {"name": "salt", "quantity": "1/8 teaspoon"}, {"name": "whole milk", "quantity": "6 cups"}, {"name": "egg yolks", "quantity": "6"}, {"name": "eggs", "quantity": "3"}, {"name": "butter", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "3 teaspoons"}, {"name": "ripe bananas", "quantity": "9"}, {"name": "vanilla wafers", "quantity": "2 (12-ounce) boxes"}, {"name": "egg whites", "quantity": "6"}, {"name": "cream of tartar", "quantity": "1/4 teaspoon"}], "created": "2024/09/17", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/XKubY0z2cSv0c0LTGJISzoJyoZI=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/AR-21398-banana-pudding-ddmfs-4x3-beauty-e33f07af31724ccb9b3912f58eb84ab7.jpg"}
{"title": "Apple Pie Tiramisu", "description": "Apple pie tiramisu has all the flavor of your favorite apple pie piled into a creamy, layered treat. Ladyfingers are soaked in apple cider instead of espresso. Toasted pecans add a nice buttery crunch to each bite.", "preparation_time_minutes": 30, "cooking_time_minutes": 240, "steps": ["Gather all ingredients.", "Prepare the Apple Filling: Stir together apple pie fruit filling, cinnamon, salt, and nutmeg in a bowl until well combined. Reserve 1/4 cup apple slices from the filling in a small bowl; roughly mash remaining apple mixture using a potato masher. Set aside.", "Prepare the Tiramisu: Place mascarpone in a large bowl; set aside. Combine cream, sugar, cinnamon, vanilla, salt, and nutmeg in a second large bowl and beat with an electric mixer on medium-low speed until it starts to thicken, about 30 seconds. Increase speed to medium and beat until soft peaks form, about 2 minutes.", "Gently whisk a third of cream mixture into mascarpone just until combined and slightly loosened; fold in remaining cream mixture, in 2 additions using a whisk, until just combined.", "Pour apple cider in a shallow bowl. Quickly dip and roll ladyfingers in the cider, one by one, just until coated, about 1 second each. Arrange 12 ladyfingers in a single layer on the bottom of an 8-inch square baking dish; trim or break ladyfingers to fit as needed. Crumble and arrange any leftover ladyfinger pieces into the gaps and over the top.", "Spread half of mashed apple filling over ladyfingers. Drizzle evenly with 2 tablespoons of the caramel sauce. Top with half of the mascarpone mixture, spreading into an even layer. Repeat layers once with remaining ladyfingers, cider, apple filling, caramel sauce, and mascarpone mixture, piling top high as needed and swooping into an even layer with the back of a spoon. Discard any remaining cider.", "Loosely cover with plastic wrap and refrigerate with reserved apple slices until set, for at least 4 hours or up to 24 hours.", "When ready to serve, chop reserved apple slices. Uncover and top tiramisu evenly with chopped apples and a drizzle of caramel sauce; garnish with pecans, if using."], "ingredients": [{"name": "Apple pie fruit filling", "quantity": "1 (21-ounce) can"}, {"name": "Ground cinnamon", "quantity": "1/2 teaspoon"}, {"name": "Table salt", "quantity": "1/8 teaspoon"}, {"name": "Ground nutmeg", "quantity": "1/8 teaspoon"}, {"name": "Mascarpone cheese", "quantity": "1 (8-ounce) container"}, {"name": "Heavy whipping cream", "quantity": "2 cups"}, {"name": "Granulated sugar", "quantity": "2/3 cup"}, {"name": "Ground cinnamon", "quantity": "2 teaspoons"}, {"name": "Vanilla extract", "quantity": "1 teaspoon"}, {"name": "Salt", "quantity": "1/4 teaspoon"}, {"name": "Ground nutmeg", "quantity": "1/4 teaspoon"}, {"name": "Apple cider", "quantity": "1 cup"}, {"name": "Ladyfingers cookies", "quantity": "24"}, {"name": "Caramel topping", "quantity": "1/4 cup, divided"}, {"name": "Chopped toasted pecans", "quantity": "for garnish (optional)"}], "created": "2024/09/16", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/y63XdcAXRcU-SnO1bblsgFFfp0E=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8707070-Apple-Pie-Tiramisu-ddmfs-0164-4x3-beauty-380287b017a44863ab2321b6115a874d.jpg"}
{"title": "Lemon Blueberry Pie", "description": "I love blueberry pie, but sometimes it can taste a little monochromatic. Here, lemon zest, lemon juice, and diced preserved lemon add a burst of bright flavor to every bite.", "preparation_time_minutes": 30, "cooking_time_minutes": 85, "steps": ["On a lightly floured work surface, roll out half of the pie dough to fit a 9-inch pie dish. Gently fit it into the pan and trim edge to a 1/2-inch overhang. Cover with plastic wrap and refrigerate for at least 30 minutes.", "Roll out remaining dough into a circle and transfer to a sheet of parchment, baking sheet, or flat surface. Use a pastry wheel to cut into 1/2-inch strips. Cover with plastic wrap and refrigerate while you prepare the filling.", "Rinse and pick over blueberries to remove any stems; set aside. Combine sugar, tapioca starch, and cornstarch in a bowl and mix well. Add lemon juice, lemon zest, and diced preserved lemon. Toss blueberries with the sugar mixture.", "Preheat the oven to 425 degrees F (220 degrees C). Pour blueberry filling into chilled pie crust.", "Lay two strips of pastry over the filled pie in an X shape. Continue adding strips, alternating over-and-under, for the lattice pattern. Trim the lattice strips to a half-inch overhang, tuck them under the bottom crust, and crimp the edge to seal. Place the pie dish on a rimmed baking sheet to catch any drips.", "Bake in the preheated oven for 25 minutes, or until the edges of the crust are golden brown. Reduce the temperature to 350 degrees F (175 degrees C). Loosely cover the pie with foil to prevent over-browning. Continue baking until the juices are bubbling and the crust is a rich golden brown, about an hour more. The internal temperature of the pie should be 200 degrees F (93 degrees C) on an instant-read thermometer.", "Cool pie on a wire rack for 4 hours to allow filling to set fully."], "ingredients": [{"name": "Pastry for a 9-inch double-crust pie", "quantity": "1, chilled"}, {"name": "Flour for dusting", "quantity": "as needed"}, {"name": "Fresh blueberries", "quantity": "6 cups"}, {"name": "Sugar", "quantity": "3/4 cup"}, {"name": "Tapioca starch", "quantity": "2 tablespoons"}, {"name": "Cornstarch", "quantity": "1 tablespoon"}, {"name": "Lemon zest (from an organic lemon)", "quantity": "1 tablespoon"}, {"name": "Fresh lemon juice", "quantity": "2 tablespoons"}, {"name": "Preserved lemon", "quantity": "1/4 cup, rinsed and finely diced"}], "created": "2024/09/03", "ratings": 3.7, "image_url": "https://www.allrecipes.com/thmb/RsqXmlEw_ULVDOOfY91arMYGSzM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/432506-bd46b440bb4d42a8bfa55b27274f20c5.jpg"}
{"title": "Copycat Crumbl Milk Chocolate Chip Cookies", "description": "These copycat Crumbl milk chocolate chip cookies use premium chocolate chips and one interesting technique, but are not hard to bake at home. They taste just like the cookies you love.", "preparation_time_minutes": 15, "cooking_time_minutes": 15, "steps": ["Combine flour, baking soda, baking powder, cornstarch, and kosher salt in a large bowl and whisk until well incorporated; set aside.", "Add butter, brown sugar, and white sugar to the bowl of a stand mixer fitted with a paddle attachment. Mix on medium speed until light and fluffy, about 3 minutes. Add in eggs one at a time, until just combined. Add in vanilla; gradually add in dry ingredients, mixing until just combined. Stir in chocolate chips.", "Using a 1/2 cup measure, scoop balls of dough into hands and form into a loose ball. Place cookie dough balls on a rimmed baking sheet and place in refrigerator for about 1 hour or until ready to bake. Alternatively, place in the freezer for 25 to 30 minutes.", "Preheat the oven to 375 degrees F (190 degrees C). Line baking sheets with parchment. Working in batches of 3 or 4 cookies per baking sheet, carefully tear each dough ball in half and place one half on top of the other with the broken, jagged side up. Gently press the 2 halves together, taking care not to smooth the top. Place cookies on the prepared baking sheet, leaving plenty of space between cookies.", "Bake in the preheated oven until golden around the edges and barely set in the middle, 10 to 12 minutes. Sprinkle with a pinch of flaky salt if desired. Allow to cool completely on the baking sheet."], "ingredients": [{"name": "All-purpose flour", "quantity": "4 1/4 cups"}, {"name": "Baking soda", "quantity": "1 1/2 teaspoons"}, {"name": "Baking powder", "quantity": "1 teaspoon"}, {"name": "Cornstarch", "quantity": "1 tablespoon"}, {"name": "Kosher salt", "quantity": "2 teaspoons"}, {"name": "Salted butter, softened", "quantity": "1 1/2 cups"}, {"name": "Brown sugar", "quantity": "1 1/4 cups"}, {"name": "White sugar", "quantity": "1 cup"}, {"name": "Large eggs, at room temperature", "quantity": "2"}, {"name": "Vanilla extract", "quantity": "4 teaspoons"}, {"name": "Milk chocolate chips", "quantity": "12 ounces"}, {"name": "Flaky sea salt for topping", "quantity": "optional"}], "created": "2024/08/19", "ratings": 3.0, "image_url": "https://www.allrecipes.com/thmb/jaZ3ZoL7xmU7_7MNkYJcNAvweZw=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8695558_Copycat-Crumbl-Milk-Chocolate-Chip-Cookies_Dotdash-Meredith-Food-Studios_4x3-de4f33d745b3437dbbbfa1a0feb02f8e.jpg"}
{"title": "Blackberry Cheesecake Brownies", "description": "For these blackberry cheesecake brownies, a fruity, blackberry-swirled cheesecake layer sits atop a chewy chocolate brownie layer in this gorgeously tasty dessert. Plan ahead, as these need time to chill in the refrigerator.", "preparation_time_minutes": 25, "cooking_time_minutes": 70, "steps": ["For blackberry sauce, combine frozen blackberries, sugar, lemon juice, and lemon zest in a small saucepan set over medium-low heat. Cook, stirring often, until berries fall apart, 8 to 10 minutes. Remove mixture from heat, and pour into a fine mesh sieve set over a bowl. Use the back of a wooden spoon or spatula to press berry mixture through the sieve, extracting as much juice as possible. Discard seeds. Pour sauce back into saucepan and bring to a simmer over low heat.", "Stir cornstarch and water together in a small bowl until thoroughly combined; stir cornstarch slurry into blackberry sauce and continue to cook, stirring constantly, until slightly thickened, 1 to 2 minutes. Remove from heat, and allow blackberry sauce to cool completely, about 20 minutes. The sauce can be refrigerated to speed up cooling.", "Preheat the oven to 350 degrees F (175 degrees C). Line an 8x8-inch square pan with enough parchment paper to have overhang on all sides.", "Prepare brownie layer: whisk melted butter, brown sugar, and salt together in a large bowl until thoroughly combined. Whisk in egg, egg yolk, and vanilla until thoroughly incorporated. Add in cocoa powder, flour, and baking soda and stir until just combined. Batter will be somewhat thick. Spread brownie batter into the prepared pan in a smooth, even layer.", "Prepare cheesecake layer: Beat cream cheese, white sugar, salt, and nutmeg together in a bowl with an electric mixer until smooth and creamy. Add in egg white, lemon juice, and vanilla and mix until thoroughly incorporated. Pour in heavy cream and mix until combined. Pour cheesecake layer over brownie layer and smooth into an even layer.", "Place dollops of the cooled blackberry sauce over the cheesecake layer. Use a knife to swirl only the cheesecake layer and blackberry sauce together; taking care not to go into the brownie layer. Swirl as many or as few times as needed to get the desired marbled effect.", "Bake in the preheated oven until the center of the bars are puffed and mostly set, 55 to 60 minutes. The edges will bake up taller than the center, and will begin to turn golden brown when they are done. Allow bars to cool to room temperature in the pan, then refrigerate for at least 4 hours to overnight. Cut into 16 bars before serving."], "ingredients": [{"name": "Frozen blackberries", "quantity": "1 1/2 cups"}, {"name": "White sugar", "quantity": "1/4 cup, or to taste"}, {"name": "Fresh lemon juice", "quantity": "1 tablespoon"}, {"name": "Freshly grated lemon zest", "quantity": "1/4 teaspoon, or to taste"}, {"name": "Cornstarch", "quantity": "1 teaspoon"}, {"name": "Water", "quantity": "1 tablespoon"}, {"name": "Unsalted butter, melted", "quantity": "1/2 cup"}, {"name": "Light brown sugar", "quantity": "1 cup, firmly packed"}, {"name": "Salt", "quantity": "1/2 teaspoon"}, {"name": "Large egg, at room temperature", "quantity": "1"}, {"name": "Large egg yolk, at room temperature", "quantity": "1"}, {"name": "Vanilla extract", "quantity": "2 teaspoons"}, {"name": "Unsweetened cocoa powder", "quantity": "1/2 cup"}, {"name": "All-purpose flour", "quantity": "1/2 cup"}, {"name": "Baking soda", "quantity": "1/4 teaspoon"}, {"name": "Full fat cream cheese, at room temperature", "quantity": "8 ounces"}, {"name": "White sugar", "quantity": "1/3 cup"}, {"name": "Pinch salt", "quantity": "1"}, {"name": "Pinch ground nutmeg", "quantity": "1"}, {"name": "Large egg white, at room temperature", "quantity": "1"}, {"name": "Fresh lemon juice", "quantity": "2 teaspoons"}, {"name": "Vanilla extract", "quantity": "1 teaspoon"}, {"name": "Heavy whipping cream, at room temperature", "quantity": "3/4 cup"}], "created": "2024/08/17", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/oBRB1BbYFFVt7Hy_-eXWcAEEYHE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8693993_Blackberry-Cheesecake-Brownies_Kim-Shupe_4x3-af22bb15b7b549f191b6d6ba726e96e0.jpg"}
{"title": "Berries-and-Cream Bars", "description": "This summery snacking cake includes a fluffy white cake, marshmallow creme, berry jam, and freeze-dried fruit. Egg whites are whisked for a lighter crumb, then flavored with a smidge of almond extract for a hint of nuttiness. These fluffy snack cakes hold a layer of jam and are coated with a sweet berry cream and freeze-dried fruit.", "preparation_time_minutes": 30, "cooking_time_minutes": 30, "steps": ["Preheat the oven to 350 degrees F (175 degrees C) and position rack in center. Lightly grease bottom of a 9-inch square cake pan. Line bottom with parchment paper. Grease and lightly flour parchment and sides of pan.", "Whisk together flour, baking powder, and salt in a medium bowl.", "In the bowl of a stand mixer fitted with a paddle attachment, mix butter and oil at medium speed until well combined, about 1 minute. Mix in sugar at medium-high speed until light and fluffy, 4 to 5 minutes. Mix in egg whites in 2 or 3 additions at medium speed until well combined, scraping bowl well after each addition. Mix in 1 teaspoon vanilla and the almond extract.", "Mix in about 1/3 of flour mixture at low speed. Mix in 1/3 cup milk; scrape bowl well. Repeat, alternating flour mixture and milk, until fully incorporated and batter is smooth.", "Spread batter in an even layer in prepared pan. Bake until a toothpick inserted into center comes out clean or with a few moist crumbs, about 30 minutes.", "Let cool in pan 10 minutes, then run an offset spatula or a knife around edge of cake and invert onto a wire rack. Remove parchment and let cool completely.", "Using a large serrated knife, halve cake horizontally to make two layers. Transfer one layer, cut side up, to a platter. Top with 1/2 cup jam, spreading evenly. Top with second cake layer, cut side down.", "Meanwhile, for berry cream, puree remaining 2/3 cup jam in a blender or mini food processor until very smooth.", "In the bowl of a stand mixer fitted with a whisk attachment, beat cream at medium speed until it begins to thicken, about 1 minute. Mix in marshmallow creme at medium-high speed until soft peaks form. Mix in pureed jam and remaining 1 teaspoon vanilla at low speed until well combined. (If needed, fold whipped cream by hand to more evenly incorporate jam.) Frost top and sides of cake with berry cream.", "For garnish, crush freeze-dried berries with a mortar and pestle (or your hands) into a mixture of small pieces and powder; sprinkle over cake. Cut cake into 12 pieces. Chill in an airtight container until ready to serve, up to 2 days."], "ingredients": [{"name": "All-purpose flour", "quantity": "2 cups"}, {"name": "Baking powder", "quantity": "1 1/2 teaspoons"}, {"name": "Sea salt", "quantity": "3/4 teaspoon"}, {"name": "Unsalted butter, at room temperature", "quantity": "10 tablespoons"}, {"name": "Vegetable oil", "quantity": "3 tablespoons"}, {"name": "White sugar", "quantity": "1 cup"}, {"name": "Large egg whites", "quantity": "3"}, {"name": "Vanilla extract", "quantity": "2 teaspoons, divided"}, {"name": "Almond extract", "quantity": "1/4 teaspoon"}, {"name": "Whole milk, at room temperature", "quantity": "2/3 cup"}, {"name": "Mixed berry jam or preserves", "quantity": "1/2 cup plus 2/3 cup, divided"}, {"name": "Whipping cream, chilled", "quantity": "1 cup"}, {"name": "Marshmallow creme", "quantity": "1/4 cup"}, {"name": "Freeze-dried strawberries or raspberries, for garnish", "quantity": "1/2 cup"}], "created": "2024/08/19", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/qxKDhcHYhFsjn9qeAbxzozO07Rg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8691436-berries-and-cream-snack-cake-4x3-a5b7cbf4752345acac0f8eb1c67009f2.jpg"}
{"title": "Banoffee Snack Cake", "description": "This take on the classic British pie combines rich banana cake, fudgy caramel frosting, and a thick layer of butter shortbread crumbs.", "preparation_time_minutes": 20, "cooking_time_minutes": 65, "steps": ["Preheat the oven to 350 degrees F (175 degrees C) and position a rack in the center. Coat a 9-inch square baking pan with cooking spray. Line pan with parchment paper, leaving 1 to 2 inches of overhang; coat parchment with cooking spray.", "Whisk together flour, baking soda, and 1/2 teaspoon salt in a medium bowl.", "In a large bowl, mash bananas with a fork until coarsely mashed. Add 6 tablespoons melted butter and the sour cream and mix until well combined. Whisk in 1 cup brown sugar, then the eggs, then 2 teaspoons vanilla until well combined. Stir in flour mixture with a silicone spatula. Fold in caramel bits. Pour batter into the prepared pan and spread in an even layer.", "Bake in the preheated oven until cake springs back lightly when touched in center, 45 to 55 minutes. Transfer pan to a wire rack. Let cool completely.", "While cake cools, make crumb topping. Put cookies in a large zip-top bag, seal bag, and use a rolling pin to crush cookies into coarse crumbs. Transfer crumbs to a small bowl. Stir in remaining 2 tablespoons melted butter and dash of salt.", "For caramel glaze, melt the 1/4 cup butter in a small saucepan over medium heat. Stir in remaining 1/2 cup brown sugar and cook, stirring occasionally, until mixture begins to boil. Add milk and bring to a simmer. Remove from heat and whisk in powdered sugar and remaining 1 teaspoon vanilla and 1/4 teaspoon salt until completely smooth.", "Spread hot glaze in an even layer over cake. Immediately sprinkle with crumb topping. Let cake stand at room temperature until glaze sets, about 15 minutes.", "Run a small offset spatula or a knife around outside of cake and use parchment lining to transfer cake to a cutting board. Cut into 12 triangles. Chill in an airtight container until ready to serve, up to 4 days."], "ingredients": [{"name": "All-purpose flour", "quantity": "2 cups"}, {"name": "Baking soda", "quantity": "1 teaspoon"}, {"name": "Sea salt", "quantity": "3/4 teaspoon plus 1 dash"}, {"name": "Ripe bananas", "quantity": "4"}, {"name": "Unsalted butter", "quantity": "1/2 cup, divided"}, {"name": "Sour cream", "quantity": "1/3 cup"}, {"name": "Light brown sugar", "quantity": "1 1/2 cups, divided"}, {"name": "Large eggs", "quantity": "2"}, {"name": "Vanilla extract", "quantity": "3 teaspoons, divided"}, {"name": "Caramel bits", "quantity": "1 cup, optional"}, {"name": "Shortbread cookies", "quantity": "3 ounces"}, {"name": "Whole milk", "quantity": "1/3 cup"}, {"name": "Confectioner's sugar", "quantity": "2 cups"}], "created": "2024/08/19", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/xdFLBmPuZr8mhgcQrSWJBxBgWBU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8691422-banoffee-snack-cake-4x3-5af058d4f83842d78bc6c1fc613d3adb.jpg"}
{"title": "Cinnamon Roll Blondies", "description": "These cinnamon roll blondies are everything you love about cinnamon rolls, just in an easy-to-make, chewy, cookie bar form.", "preparation_time_minutes": 20, "cooking_time_minutes": 30, "steps": ["Preheat the oven to 350 degrees F (175 degrees C). Line an 8x8-inch square pan with enough parchment paper to have overhang on all sides.", "For filling: in a small bowl, mix brown sugar and cinnamon together until thoroughly combined. Set aside.", "For blondies: Whisk melted butter, white sugar, brown sugar, vanilla, salt, and nutmeg until thoroughly combined. Add in egg and egg yolk and mix until thoroughly combined. Add in flour and baking soda and mix until just incorporated.", "Spread half the batter into an even layer in the prepared pan (it will be a somewhat thin layer). Sprinkle cinnamon-sugar mixture evenly over the batter. Place dollops of remaining batter over the cinnamon-sugar layer, and carefully spread into an even layer to cover cinnamon-sugar completely.", "Bake in the preheated oven until bars begin to pull away from the sides of the pan, are puffed in the middle, and golden brown on top, 25 to 30 minutes. Allow bars to cool completely in the pan.", "For glaze: beat cream cheese, powdered sugar, vanilla and salt together with an electric mixer until completely smooth. Add in heavy cream and beat until smooth. If glaze is too thick, add more heavy cream a small amount at a time; if glaze is too thin, add more powdered sugar until desired consistency is reached.", "Pour glaze onto cooled bars and spread into an even layer. Cut into 16 bars."], "ingredients": [{"name": "Light brown sugar", "quantity": "1/4 cup"}, {"name": "Ground cinnamon", "quantity": "1 tablespoon"}, {"name": "Unsalted butter", "quantity": "1/2 cup, melted and cooled slightly"}, {"name": "White sugar", "quantity": "3/4 cup"}, {"name": "Light brown sugar", "quantity": "1/4 cup"}, {"name": "Vanilla extract", "quantity": "2 teaspoons"}, {"name": "Kosher salt", "quantity": "3/4 teaspoon"}, {"name": "Ground nutmeg", "quantity": "1/4 teaspoon"}, {"name": "Large egg", "quantity": "1, at room temperature"}, {"name": "Large egg yolk", "quantity": "1"}, {"name": "All-purpose flour", "quantity": "1 cup"}, {"name": "Baking soda", "quantity": "1/4 teaspoon"}, {"name": "Full fat cream cheese", "quantity": "1 ounce, at room temperature"}, {"name": "Confectioner's sugar", "quantity": "7 tablespoons, or as needed"}, {"name": "Vanilla extract", "quantity": "1/4 teaspoon"}, {"name": "Salt", "quantity": "1 pinch"}, {"name": "Heavy cream", "quantity": "3 tablespoons, or as needed"}], "created": "2024/08/10", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/pGLNVFI9qDcDloAvr-jeLO4jOJs=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8687135_Cinnamon-Roll-Blondies_Kim-Shupe_4x3-1f1bc4c80a2c4ce2bc4228f76d05b38d.jpg"}
{"title": "Cornmeal Cookies", "description": "These cornmeal cookies have a lovely, chewy texture, and delicious cornmeal flavor.", "preparation_time_minutes": 15, "cooking_time_minutes": 15, "steps": ["Beat butter, brown sugar, and honey together on medium-high speed with an electric mixer for 5 minutes. Add in egg yolk, vanilla, salt, cinnamon, and nutmeg and mix for 1 minute. Add in flour, 3/4 cup cornmeal, baking powder, and baking soda and mix until just combined.", "Mix 2 tablespoons white sugar and 1 tablespoon corn meal together in a small bowl.", "Scoop out 2 tablespoons of the dough and roll into a ball. Roll dough ball into the sugar-corn meal mixture until thoroughly coated. Repeat with remaining cookie dough.", "Chill dough balls in the refrigerator for 15 minutes.", "Preheat the oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.", "Place dough balls 2 inches apart on the prepared baking sheets.", "Bake in the preheated oven, one pan at a time, until cookies are crackled and begin to turn very light golden brown, 14 to 16 minutes. Cool cookies on baking sheets for 10 minutes before removing to a wire rack to cool completely."], "ingredients": [{"name": "Unsalted butter", "quantity": "1/2 cup, softened"}, {"name": "Light brown sugar", "quantity": "3/4 cup, firmly packed"}, {"name": "Honey", "quantity": "2 tablespoons"}, {"name": "Large egg yolk", "quantity": "1"}, {"name": "Vanilla extract", "quantity": "2 teaspoons"}, {"name": "Salt", "quantity": "1 teaspoon"}, {"name": "Ground cinnamon", "quantity": "1/8 teaspoon"}, {"name": "Ground nutmeg", "quantity": "1/8 teaspoon"}, {"name": "All-purpose flour", "quantity": "1 1/4 cups"}, {"name": "Cornmeal", "quantity": "3/4 cup"}, {"name": "Baking powder", "quantity": "1/2 teaspoon"}, {"name": "Baking soda", "quantity": "1/2 teaspoon"}, {"name": "White sugar", "quantity": "2 tablespoons"}, {"name": "Cornmeal", "quantity": "1 tablespoon"}], "created": "2024/08/01", "ratings": 4.3, "image_url": "https://www.allrecipes.com/thmb/m8nIKYwHQc0JFN1f_2-hrNPFL20=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8681391_Cornmeal-Cookies_Kim-Shupe_4x3-544d53f1b534401da541e05350a4ce10.jpg"}
{"title": "Blue Ribbon Sugar Cookies", "description": "A light, crispy but tender sugar cookie loaded with flavor. These cookies are especially requested at Christmas. They're easy and definitely a crowd-pleaser.", "preparation_time_minutes": 30, "cooking_time_minutes": 20, "steps": ["Preheat the oven to 375 degrees F (190 degrees C).", "Sift together the flour, cream of tartar, baking soda, and salt; set aside.", "In a large bowl, cream together the butter, oil, confectioners' sugar, and white sugar until well blended. Stir in the eggs, vanilla, and lemon extracts.", "Gradually mix in the dry ingredients until well blended.", "Roll the dough into walnut-sized balls. Place the cookies 2 inches apart onto the cookie sheet, flatten with a glass dipped in sugar."], "ingredients": [{"name": "Butter", "quantity": "3/4 cup, softened"}, {"name": "Vegetable oil", "quantity": "1 cup"}, {"name": "Confectioners' sugar", "quantity": "1 cup"}, {"name": "White sugar", "quantity": "1 cup"}, {"name": "Eggs", "quantity": "2"}, {"name": "Vanilla extract", "quantity": "1 teaspoon"}, {"name": "Lemon extract", "quantity": "1 1/2 teaspoons"}, {"name": "All-purpose flour", "quantity": "4 cups"}, {"name": "Cream of tartar", "quantity": "1 teaspoon"}, {"name": "Baking soda", "quantity": "1 teaspoon"}, {"name": "Salt", "quantity": "1 teaspoon"}, {"name": "White sugar for decoration", "quantity": "1/2 cup"}], "created": "2023/09/27", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/M2vhTInuDjDN6t2sWaY1o87lCr0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/BlueRibbonSugarCookies4x3withSugarCookieGlaze-7ac8b71f5a6f4b499740b0bae7938f11.jpg"}
{"title": "Cranberry-Orange Shortbread Cookies with Apricots", "description": "A citrus-y cranberry shortbread cookie with dried apricots, adding the perfect backdrop flavor.", "preparation_time_minutes": 20, "cooking_time_minutes": 20, "steps": ["Combine flour, baking powder, salt, and nutmeg in a bowl; mix together.", "Cream butter in a large bowl using an electric blender until fluffy and lightened in color slightly. Add sugar and cream on medium-high speed until light and fluffy, several more minutes. Mix in vanilla and orange zest. Add flour mixture in 3 batches and mix until just combined, kneading the last addition by hand. Knead in cranberries and apricots.", "Divide dough in half and roll out into two 1 1/2x7-inch long logs. Wrap each log in parchment paper and refrigerate until dough is chilled, at least 4 hours.", "Preheat the oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.", "Remove dough from the refrigerator and cut each log into about 16 slices that are 1/3-inch thick. Place slices 1 inch apart on prepared baking sheets. Bake in the preheated oven until cookies just begin to turn slightly golden on bottom, 20 to 25 minutes. Cool on baking sheets for 5 minutes before removing to wire racks to cool completely. Store in an airtight container."], "ingredients": [{"name": "all-purpose flour", "quantity": "1 3/4 cups"}, {"name": "baking powder", "quantity": "1/4 teaspoon"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "ground nutmeg", "quantity": "1/4 teaspoon"}, {"name": "unsalted butter", "quantity": "1 cup, softened"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "oranges", "quantity": "2, zested"}, {"name": "dried cranberries", "quantity": "1 cup, finely chopped"}, {"name": "dried apricots", "quantity": "1/2 cup, finely chopped"}], "created": "2020/06/19", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/MPGKQwvtcJTA-S8Rsn8K8me6FJg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/6058035-53571d561e6d4c53b6aaa8fdcc3ddbc3.jpg"}
{"title": "White Chocolate-Orange-Pistachio Thumbprint Cookies", "description": "Nutty pistachio cookies filled with creamy, citrusy white chocolate are an impressive and tasty little treat!", "preparation_time_minutes": 30, "cooking_time_minutes": 10, "steps": ["Combine butter, sugar, egg yolks, and vanilla extract in a large bowl. Beat using an electric mixer until well mixed. Add flour, salt, and pudding mix; beat well. Chill dough in the refrigerator for 30 minutes.", "Preheat the oven to 325 degrees F (165 degrees C). Line a baking sheet with parchment paper.", "Shape dough into 1-inch balls and place on the prepared baking sheets. Make an indentation in the center of each cookie with your thumb.", "Bake in the preheated oven until lightly golden around the edges, 10 to 12 minutes. Remove from baking sheet and allow to cool on a wire rack, about 30 minutes.", "Combine white chocolate chips, milk, and orange zest in a microwave-safe bowl. Heat in the microwave for 1 1/2 minutes, stirring every 30 seconds, until chocolate is melted and smooth.", "Pour white chocolate mixture into a piping bag and pipe into the thumbprint of the cooled cookies. Sprinkle with chopped pistachios."], "ingredients": [{"name": "butter", "quantity": "1 cup, softened"}, {"name": "white sugar", "quantity": "1/4 cup"}, {"name": "egg yolks", "quantity": "2"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "all-purpose flour", "quantity": "2 1/2 cups"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "instant pistachio pudding mix", "quantity": "1 (3.4 ounce) package"}, {"name": "white chocolate chips", "quantity": "2 cups"}, {"name": "whole milk", "quantity": "1/4 cup"}, {"name": "orange zest", "quantity": "1 tablespoon, grated"}, {"name": "roasted salted pistachios", "quantity": "2 ounces, finely chopped"}], "created": "2020/06/19", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/HCZYuQgsqQUFuSmiJ784PMJij5M=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/6067920-d85794e8c7174c9a859bbd5d8dd9590e.jpg"}
{"title": "Gingerbread Cookies with Orange Buttercream Frosting", "description": "Soft and cakey gingerbread cookies with a tangy orange buttercream icing that ties the flavors together.", "preparation_time_minutes": 20, "cooking_time_minutes": 20, "steps": ["Combine butter and sugar in a large bowl; beat with an electric mixer until smooth and creamy. Mix in molasses and egg until combined.", "Mix buttermilk with 2 teaspoons baking soda in a small bowl, and vinegar with the remaining baking soda in another bowl. Add both mixtures to the molasses-egg mixture along with the spices and salt; mix until well combined.", "Gradually stir in flour, 1 cup at a time, until dough forms a ball. Wrap dough in plastic and refrigerate for 30 minutes.", "Preheat oven to 350 degrees F (175 degrees C). Roll chilled dough on a floured surface to 1/2-inch thickness, cut into shapes, and place on ungreased baking sheets.", "Bake until edges are golden, about 10 minutes. Cool on sheet for 1 minute, then transfer to a wire rack to cool completely.", "For frosting: Combine powdered sugar, softened butter, orange zest, and 1/3 cup orange juice in a bowl. Beat until smooth, adding more powdered sugar if needed to reach a fondant-like consistency. Frost cooled cookies."], "ingredients": [{"name": "butter", "quantity": "1 cup, softened"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "molasses", "quantity": "1 cup"}, {"name": "egg", "quantity": "1"}, {"name": "buttermilk", "quantity": "1 cup"}, {"name": "baking soda", "quantity": "3 teaspoons, divided"}, {"name": "vinegar", "quantity": "1 teaspoon"}, {"name": "ground cinnamon", "quantity": "1 teaspoon"}, {"name": "ground cloves", "quantity": "1 teaspoon"}, {"name": "ground ginger", "quantity": "1 teaspoon"}, {"name": "ground nutmeg", "quantity": "1/2 teaspoon"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "all-purpose flour", "quantity": "4 cups, or more as needed"}, {"name": "powdered sugar", "quantity": "3 cups, or more as needed"}, {"name": "orange zest", "quantity": "zest of 2 oranges"}, {"name": "orange juice", "quantity": "1/3 cup"}], "created": "2020/06/19", "ratings": 3.0, "image_url": "https://www.allrecipes.com/thmb/B6IxTtLhslVCpiHMpmMCn_YBAJU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8726858-7606d26d77a84dd38e57707f6143dfd8.jpg"}
{"title": "Orange-Gingerbread Cheesecake Bars", "description": "A spicy, molasses-y cookie crust and topping with a creamy cheesecake filling, with a hint of orange zest.", "preparation_time_minutes": 40, "cooking_time_minutes": 35, "steps": ["Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch baking pan with parchment paper, leaving overhang on all sides, and lightly grease the parchment.", "For gingerbread: In a large bowl, whisk together flour, ginger, cinnamon, baking soda, cloves, nutmeg, allspice, and salt.", "In a separate bowl, cream brown sugar and butter with an electric mixer until light and fluffy. Add egg and vanilla, beating until combined, then mix in molasses.", "Add flour mixture to the butter mixture in 3 additions, mixing until just combined. Press 2/3 of the dough evenly into the prepared baking pan.", "For cheesecake filling: Beat cream cheese, sugar, and salt until smooth and fluffy. Add eggs one at a time, mixing well after each addition, then add vanilla and orange zest.", "Pour cheesecake filling over gingerbread crust and smooth with a spatula. Crumble remaining gingerbread dough over the filling and gently press down.", "Bake until edges are set and center only slightly jiggles, about 35 to 40 minutes. Cool completely in pan. Lift out using parchment and slice into bars."], "ingredients": [{"name": "all-purpose flour", "quantity": "2 1/4 cups"}, {"name": "ground ginger", "quantity": "2 teaspoons"}, {"name": "ground cinnamon", "quantity": "1 1/2 teaspoons"}, {"name": "baking soda", "quantity": "1 teaspoon"}, {"name": "ground cloves", "quantity": "1/2 teaspoon"}, {"name": "ground nutmeg", "quantity": "1/4 teaspoon"}, {"name": "ground allspice", "quantity": "1/4 teaspoon"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "dark brown sugar", "quantity": "3/4 cup, firmly packed"}, {"name": "unsalted butter", "quantity": "1/2 cup, softened"}, {"name": "egg", "quantity": "1"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "molasses", "quantity": "1/2 cup"}, {"name": "cream cheese", "quantity": "2 (8-ounce) packages, softened"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "salt", "quantity": "1 pinch"}, {"name": "eggs", "quantity": "2"}, {"name": "vanilla extract", "quantity": "1 1/2 teaspoons"}, {"name": "orange zest", "quantity": "1 teaspoon"}], "created": "2022/02/16", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/P8_vO90He4oHWC7F333Btc2MEmE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7169014-23a5df53308442f18735bc467a1dcab3.jpg"}
{"title": "Keto Cranberry Streusel Bars", "description": "Low-carb bars with a balance of sweet and tart flavors, great for breakfast, dessert, or a snack.", "preparation_time_minutes": 15, "cooking_time_minutes": 50, "steps": ["Preheat oven to 350 degrees F (175 degrees C). Spray an 8x8-inch baking pan with cooking spray.", "Mix almond flour, sweetener, melted butter, and almond extract in a bowl for the crust. Set aside 1/3 of the mixture for the streusel topping. Press the remaining 2/3 of the mixture into the prepared pan.", "Bake until partially golden, about 5 minutes, then set aside.", "In a saucepan, combine cranberries, sweetener, orange juice, orange zest, and arrowroot powder. Bring to a boil over medium heat, then reduce to medium-low and simmer until cranberries pop, about 10 minutes. Let cool for 5 minutes, then spread over crust.", "Stir pecans and cinnamon into the reserved crust mixture for the streusel. Sprinkle over the cranberry filling.", "Bake until set, about 30 minutes. Cool completely before cutting into bars, 30 minutes to 1 hour."], "ingredients": [{"name": "cooking spray", "quantity": "as needed"}, {"name": "almond flour", "quantity": "2 cups"}, {"name": "low-calorie natural sweetener (such as Swerve)", "quantity": "1/3 cup, or more to taste"}, {"name": "butter", "quantity": "6 tablespoons, melted"}, {"name": "almond extract", "quantity": "1 teaspoon"}, {"name": "fresh cranberries", "quantity": "2 cups"}, {"name": "orange juice", "quantity": "1/4 cup"}, {"name": "orange zest", "quantity": "1 teaspoon, grated"}, {"name": "arrowroot powder", "quantity": "1/4 teaspoon"}, {"name": "pecans", "quantity": "1/3 cup, chopped"}, {"name": "ground cinnamon", "quantity": "1/2 teaspoon"}], "created": "2019/12/11", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/V9zEmUZjnNoWUAUI5w-gm4FeKoE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7422515-a8b491ac89c94b578e9496133173da02.jpg"}
{"title": "Strawberry-Orange Oatmeal Bars", "description": "Fruity bars with a strawberry-orange filling and a coconut-almond-oatmeal crust.", "preparation_time_minutes": 25, "cooking_time_minutes": 45, "steps": ["Preheat oven to 375 degrees F (190 degrees C). Line an 8x8-inch baking pan with parchment, leaving overhang on all sides. Lightly grease parchment with cooking spray.", "In a large bowl, mix oats, whole wheat flour, coconut, almonds, ginger, and salt. Add maple syrup, melted butter, and vanilla extract, stirring until combined. Reserve 1 cup of crust mixture for topping. Press remaining crust mixture firmly into the pan.", "In a separate bowl, combine strawberries, maple syrup, cornstarch, orange juice, and orange zest. Toss until no dry lumps of cornstarch remain. Spread strawberry mixture over the crust.", "Sprinkle reserved crust mixture over strawberries and press lightly into the strawberry mixture.", "Bake until the top is golden brown and strawberries are bubbling, 45 to 50 minutes. Cool completely in the pan, then remove using parchment 'handles' and slice into bars."], "ingredients": [{"name": "cooking spray", "quantity": "as needed"}, {"name": "rolled oats", "quantity": "1 cup"}, {"name": "whole wheat flour", "quantity": "3/4 cup"}, {"name": "shredded sweetened coconut", "quantity": "3/4 cup"}, {"name": "sliced almonds", "quantity": "1/2 cup"}, {"name": "ground ginger", "quantity": "1 teaspoon"}, {"name": "kosher salt", "quantity": "1/2 teaspoon"}, {"name": "maple syrup", "quantity": "1/2 cup"}, {"name": "unsalted butter", "quantity": "6 tablespoons, melted"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "fresh strawberries", "quantity": "3 cups, sliced"}, {"name": "maple syrup", "quantity": "3 tablespoons, or as needed"}, {"name": "cornstarch", "quantity": "1 1/2 tablespoons"}, {"name": "orange juice", "quantity": "1 tablespoon"}, {"name": "orange zest", "quantity": "1/4 teaspoon, grated"}], "created": "2019/12/09", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/4QALCZiNIY_8JlIKq2fQsKFX4Lw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/6780309-7b95ae186db140098f83282457cfe9d3.jpg"}
{"title": "Pecan Shortbread Cookies (Mexican Wedding Cookies)", "description": "A twist on traditional pecan shortbread cookies, with fresh orange juice and zest for extra flavor.", "preparation_time_minutes": 30, "cooking_time_minutes": 15, "steps": ["Combine butter and sugar in a large bowl; beat with an electric mixer until smooth and creamy, about 2 minutes. Add vanilla extract, orange juice, water, and orange zest; beat until blended.", "Add flour and pecans, and mix with a spoon until blended but crumbly. Cover and refrigerate until chilled, 3 hours to overnight.", "Preheat the oven to 325 degrees F (165 degrees C).", "Scoop up about a golf-ball-size of dough, press into a ball, flatten slightly, and smooth edges. Place on an ungreased cookie sheet.", "Bake until edges are golden, 15 to 20 minutes. Cool on the baking sheet for 1 minute before transferring to a wire rack to cool, 8 to 10 minutes.", "Sift confectioners' sugar into a small bowl. Drop a cookie into the sugar, flip to coat both sides, and repeat with remaining cookies."], "ingredients": [{"name": "butter", "quantity": "1 cup, softened"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "2 teaspoons"}, {"name": "orange juice", "quantity": "1 teaspoon, freshly squeezed"}, {"name": "water", "quantity": "1 teaspoon"}, {"name": "orange zest", "quantity": "1/2 teaspoon, freshly grated (optional)"}, {"name": "all-purpose flour", "quantity": "2 cups"}, {"name": "pecans", "quantity": "1 cup, very finely chopped"}, {"name": "confectioners' sugar", "quantity": "1/2 cup"}], "created": "2020/06/19", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/PcMp5ipGOaHJx0RGdVgUnHGxJrQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7516934-87b7d4ff772c4d90bd8cfb6d4b245dfa.jpg"}
{"title": "Melomakarona Cookies", "description": "Traditional Greek spice cookies with a honey syrup and walnut topping.", "preparation_time_minutes": 30, "cooking_time_minutes": 15, "steps": ["Preheat the oven to 350 degrees F (175 degrees C).", "In a large bowl, whisk together flour, cinnamon, baking powder, cloves, baking soda, and nutmeg.", "In a separate bowl, beat butter until light and fluffy, then add sugar and mix well.", "In another bowl, beat egg yolks and orange juice together, then stir into the butter mixture. Gradually add the flour mixture, mixing after each addition. Add honey and mix until a soft dough forms.", "Chill dough until firm, about 30 minutes. Shape into small ovals and place a few inches apart on baking sheets. Flatten slightly.", "Bake until light golden brown, 15 to 20 minutes.", "While cookies bake, heat honey, water, and sugar in a saucepan over medium-low heat until sugar is dissolved, then let cool.", "Mix walnuts, cinnamon, and cloves for the topping.", "Dip cookies into the cooled syrup for 10 to 15 seconds per side, then sprinkle with walnut topping. Let dry completely before storing."], "ingredients": [{"name": "all-purpose flour", "quantity": "4 cups"}, {"name": "ground cinnamon", "quantity": "2 teaspoons"}, {"name": "baking powder", "quantity": "2 teaspoons"}, {"name": "ground cloves", "quantity": "1 teaspoon"}, {"name": "baking soda", "quantity": "1 teaspoon"}, {"name": "ground nutmeg", "quantity": "1/2 teaspoon"}, {"name": "unsalted butter", "quantity": "1 pound"}, {"name": "white sugar", "quantity": "3/4 cup"}, {"name": "egg yolks", "quantity": "3"}, {"name": "orange juice", "quantity": "1/2 cup, freshly squeezed"}, {"name": "honey", "quantity": "1 teaspoon"}, {"name": "honey", "quantity": "1 cup (for syrup)"}, {"name": "water", "quantity": "1 cup (for syrup)"}, {"name": "white sugar", "quantity": "1 cup (for syrup)"}, {"name": "walnuts", "quantity": "1/2 cup, finely crushed (for topping)"}, {"name": "ground cinnamon", "quantity": "1 pinch, or to taste (for topping)"}, {"name": "ground cloves", "quantity": "1 pinch, or to taste (for topping)"}], "created": "2021/11/30", "ratings": 3.0, "image_url": "https://www.allrecipes.com/thmb/lEvhTgReFOzXCIgitWoGmSal9cY=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/9426835-56e05c35b88e4e128f3cba7988364c54.jpg"}
{"title": "Chantal's New York Cheesecake", "description": "A creamy New York-style cheesecake that tastes like deli-style cheesecake.", "preparation_time_minutes": 30, "cooking_time_minutes": 60, "steps": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch springform pan.", "Combine crushed graham crackers and melted butter in a bowl, mixing until well combined. Press onto the bottom of the prepared pan to form the crust.", "In a large bowl, mix cream cheese and sugar until smooth. Blend in milk, then add eggs one at a time, mixing just until combined.", "Add sour cream, flour, and vanilla, mixing until smooth. Pour filling onto the crust in the prepared pan.", "Bake in the preheated oven for 1 hour. Turn the oven off and allow the cheesecake to cool in the oven with the door closed for 5 to 6 hours to prevent cracking.", "Refrigerate until ready to serve."], "ingredients": [{"name": "graham crackers", "quantity": "15, crushed"}, {"name": "butter", "quantity": "2 tablespoons, melted"}, {"name": "cream cheese", "quantity": "4 (8-ounce) packages"}, {"name": "white sugar", "quantity": "1 1/2 cups"}, {"name": "milk", "quantity": "3/4 cup"}, {"name": "eggs", "quantity": "4 large"}, {"name": "sour cream", "quantity": "1 cup"}, {"name": "all-purpose flour", "quantity": "1/4 cup"}, {"name": "vanilla extract", "quantity": "1 tablespoon"}], "created": "2024/10/03", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/_lGKnVzJL12N6mUhO4yMGhdYiIw=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8350-chantals-new-york-cheesecake-DDMFS-4x3-426569e82b4142a6a1ed01e068544245.jpg"}
{"title": "Double-Layer Pumpkin Cheesecake", "description": "A decadent cheesecake with a layer of spiced pumpkin filling over a creamy base and a graham cracker crust, perfect for Thanksgiving or fall gatherings.", "preparation_time_minutes": 20, "cooking_time_minutes": 35, "steps": ["Preheat the oven to 325 degrees F (165 degrees C). Gather all ingredients.", "For the cheesecake layer: Beat cream cheese, sugar, and vanilla in a large bowl until smooth. Add eggs one at a time, blending well after each addition.", "Spread 1 cup of the batter in a prepared 9-inch graham cracker crust.", "For the pumpkin layer: Mix pumpkin puree, cinnamon, cloves, and nutmeg with the remaining batter and spread over the plain cheesecake layer.", "Bake for 35-40 minutes or until the center is almost set. Cool on a wire rack, then refrigerate for at least 4 hours before serving."], "ingredients": [{"name": "cream cheese", "quantity": "16 ounces"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "large eggs", "quantity": "2"}, {"name": "prepared graham cracker crust", "quantity": "1 (9-inch)"}, {"name": "pumpkin puree", "quantity": "1/2 cup"}, {"name": "ground cinnamon", "quantity": "1/2 teaspoon"}, {"name": "ground cloves", "quantity": "1 pinch"}, {"name": "ground nutmeg", "quantity": "1 pinch"}], "created": "2014/12/19", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/KRpnD9KRKWPM2QExazBlOu9TEeE=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/ALR-13477-double-layer-pumpkin-cheesecake-VAT-4x3-904eb668e0c3482bb15d79730307cde3.jpg"}
{"title": "The Best Chocolate Cheesecake", "description": "This chocolate cheesecake features a chocolate cookie crust, rich chocolate-cream cheese filling, and a decadent ganache topping.", "preparation_time_minutes": 20, "cooking_time_minutes": 50, "steps": ["Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9-inch springform pan.", "To make the crust: Combine chocolate cookie crumbs, melted butter, and sugar; press onto the bottom and 1 1/2 inches up the sides of the pan. Bake for 10 minutes; let cool. Reduce oven temperature to 325 degrees F (165 degrees C).", "To make the filling: Heat whipping cream and chocolate chips in a saucepan until melted; set aside. Beat cream cheese and sugar in a bowl until smooth. Add cocoa powder, then eggs one at a time. Stir in vanilla and melted chocolate-cream mixture; pour into crust.", "Bake for 45-50 minutes until the edges are puffed and the center slightly jiggles. Run a knife around the edge and cool on a wire rack.", "To make the topping: Heat whipping cream and vanilla in a saucepan until just before boiling; pour over chocolate chips and stir until smooth. Spread over cooled cheesecake and refrigerate for at least 4 hours."], "ingredients": [{"name": "chocolate cookie crumbs", "quantity": "1 1/2 cups"}, {"name": "butter, melted", "quantity": "1/4 cup"}, {"name": "white sugar", "quantity": "2 tablespoons"}, {"name": "semisweet chocolate chips", "quantity": "1 3/4 cups, divided"}, {"name": "heavy whipping cream", "quantity": "1/2 cup, divided"}, {"name": "cream cheese", "quantity": "3 (8-ounce) packages, softened"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "unsweetened cocoa powder", "quantity": "1/3 cup"}, {"name": "eggs", "quantity": "3"}, {"name": "vanilla extract", "quantity": "2 teaspoons, divided"}], "created": "2024/02/29", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/S9EDCzshxNAYVZGjghi0cOCX6BI=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8230chocolate-cheesecake-iiAimeeB4x3-c0b82c62e259497c827944ab0fa2d208.jpg"}
{"title": "Eggnog Cheesecake", "description": "This festive eggnog cheesecake is rich, creamy, and perfect for holiday celebrations. It features a graham cracker crust, a luscious eggnog-infused filling, and a hint of rum and nutmeg.", "preparation_time_minutes": 20, "cooking_time_minutes": 65, "steps": ["Preheat the oven to 325 degrees F (165 degrees C).", "Make the crust: Combine graham cracker crumbs, melted butter, and sugar in a bowl. Press into the bottom of a 9-inch springform pan.", "Bake crust for 10 minutes; transfer to a wire rack to cool. Increase oven temperature to 425 degrees F (220 degrees C).", "For the filling: Blend cream cheese, sugar, eggnog, and flour in a food processor until smooth. Add eggs, rum, and nutmeg; blend until combined.", "Pour filling into the cooled crust and bake for 10 minutes. Reduce heat to 250 degrees F (120 degrees C) and continue to bake for 45 minutes or until edges are set and center slightly jiggles.", "Run a knife around the edge to loosen and let cool. Remove the pan rim after cooling and refrigerate before serving."], "ingredients": [{"name": "graham cracker crumbs", "quantity": "1 cup"}, {"name": "butter, melted", "quantity": "3 tablespoons"}, {"name": "white sugar", "quantity": "2 tablespoons"}, {"name": "cream cheese", "quantity": "3 (8-ounce) packages, softened"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "eggnog", "quantity": "3/4 cup"}, {"name": "all-purpose flour", "quantity": "3 tablespoons"}, {"name": "large eggs", "quantity": "2"}, {"name": "rum", "quantity": "2 tablespoons"}, {"name": "ground nutmeg", "quantity": "1 pinch"}], "created": "2023/12/14", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/-0hYq1HG0ViZ5CtAjnPtBKwsxos=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/24308-eggnog-cheesecake-iii-DDMFS-4x3-3aebd08dc11d48018debd873456d3d7a.jpg"}
{"title": "Chocolate Pistachio Cheesecake", "description": "A healthier take on indulgent layered cheesecake with a chocolate wafer crust and creamy pistachio filling, topped with mousse and whipped topping.", "preparation_time_minutes": 60, "cooking_time_minutes": 40, "steps": ["Preheat the oven to 325 degrees F (165 degrees C) and coat a 9-inch springform pan with cooking spray.", "In a food processor, pulse cookies, 1/4 cup pistachios, and 2 tablespoons sugar until finely ground. Add melted butter and pulse to combine. Press into the bottom of the prepared pan.", "Make pistachio butter by blending 1/2 cup pistachios until smooth. Mix with cream cheese, avocado, 1 cup yogurt, cornstarch, and sugar until nearly smooth. Add egg whites, almond extract, and salt; blend until just combined. Spread over the crust.", "Bake for 40 minutes or until the edges are set. Turn off the oven and let stand for 30 minutes. Cool on a wire rack, then chill for at least 4 hours.", "Make the mousse by beating whipping cream, powdered sugar, vanilla, yogurt, and salt until fluffy. Spread over the cheesecake, followed by whipped topping. Garnish with additional pistachios."], "ingredients": [{"name": "chocolate wafer cookies", "quantity": "3 ounces"}, {"name": "raw unsalted pistachios", "quantity": "3/4 cup, divided"}, {"name": "granulated sugar", "quantity": "2 tablespoons"}, {"name": "butter, melted", "quantity": "2 tablespoons"}, {"name": "reduced-fat cream cheese (Neufchâtel)", "quantity": "16 ounces"}, {"name": "avocado, mashed", "quantity": "1/2 cup"}, {"name": "fat-free plain Greek-style yogurt", "quantity": "2 cups, divided"}, {"name": "cornstarch", "quantity": "2 tablespoons"}, {"name": "granulated sugar", "quantity": "3/4 cup"}, {"name": "large egg whites", "quantity": "2"}, {"name": "almond extract", "quantity": "1 teaspoon"}, {"name": "salt", "quantity": "1/8 teaspoon"}, {"name": "whipping cream", "quantity": "1/4 cup"}, {"name": "powdered sugar", "quantity": "2 tablespoons"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "frozen nondairy low-fat whipped topping", "quantity": "16 ounces"}], "created": "2023/01/19", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/d4vCmLh4XGzlYi_j76RQJ75s0uI=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Chocolate-Pistachio-Cheesecake-461eb67abbad4e4c93cc0fb4b1080d90.jpg"}
{"title": "Limoncello Ricotta Cake", "description": "A decadent and moist lemon-flavored ricotta cake infused with limoncello, perfect for lemon lovers seeking a rich and flavorful dessert.", "preparation_time_minutes": 25, "cooking_time_minutes": 75, "steps": ["Preheat the oven to 350 degrees F (180 degrees C). Spray a 9-inch springform pan with flour-based cooking spray.", "Sift together cake flour, baking powder, baking soda, and salt; set aside.", "In a large bowl, beat eggs and sugar on medium-high speed until lightened in color and tripled in volume (5-7 minutes). Mix in ricotta, olive oil, limoncello, lemon zest, lemon juice, and vanilla until combined.", "Add half of the flour mixture and mix until just combined. Add the remaining flour mixture and mix until just combined. Pour the batter into the prepared pan and place on a baking sheet.", "Bake for 65-75 minutes or until a toothpick inserted comes out with a few moist crumbs. Cool in the pan for 30 minutes before transferring to a wire rack to cool completely.", "Make the icing by mixing powdered sugar, limoncello, heavy cream, lemon juice, lemon zest, and salt until smooth. Pour over the cooled cake."], "ingredients": [{"name": "cake flour", "quantity": "1 1/2 cups"}, {"name": "baking powder", "quantity": "1 teaspoon"}, {"name": "baking soda", "quantity": "1/2 teaspoon"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "large eggs", "quantity": "3, at room temperature"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "whole milk ricotta cheese", "quantity": "15 ounces, at room temperature"}, {"name": "olive oil", "quantity": "1/2 cup"}, {"name": "limoncello", "quantity": "1/4 cup, plus 3 tablespoons for icing"}, {"name": "fresh lemon zest", "quantity": "2 tablespoons, plus 1/2 teaspoon for icing"}, {"name": "freshly squeezed lemon juice", "quantity": "2 tablespoons, plus 2 teaspoons for icing"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "powdered sugar", "quantity": "1 cup"}, {"name": "heavy cream", "quantity": "1 tablespoon"}, {"name": "salt", "quantity": "1 pinch"}], "created": "2023/09/20", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/SYk--45N9MSf8mVfy1fokBs9hMM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7970804_Limoncello-Ricotta-Cake_Kim_4x3-2e29ffd03ce04e2383cab606aa6ef521.jpg"}
{"title": "Lemon Meringue Cheesecake", "description": "A luscious combination of lemon meringue pie and classic cheesecake, featuring a shortbread cookie crust, creamy lemon-infused filling, and golden meringue topping.", "preparation_time_minutes": 20, "cooking_time_minutes": 70, "steps": ["Preheat the oven to 325 degrees F (165 degrees C). Gather ingredients and prepare a 9-inch springform pan with cooking spray.", "Make the crust: Mix shortbread cookie crumbs with melted butter and press into the bottom of the pan.", "Prepare the filling: Beat cream cheese, sour cream, and sugar until smooth. Add eggs one at a time, mixing well after each addition. Stir in lemon juice, lemon zest, and vanilla.", "Pour filling over the crust and bake for about 1 hour or until the center is almost set. Let cool to room temperature and refrigerate for at least 3-4 hours.", "Preheat oven to 375 degrees F (190 degrees C) and make the meringue: Beat egg whites until soft peaks form, then add sugar and cream of tartar, beating until glossy and stiff peaks form.", "Spread lemon curd over chilled cheesecake, then top with meringue. Bake for 10 minutes or until meringue is golden brown. Chill uncovered for at least 1 hour before serving."], "ingredients": [{"name": "shortbread cookie crumbs", "quantity": "2 cups"}, {"name": "butter, melted", "quantity": "1/4 cup"}, {"name": "cream cheese", "quantity": "3 (8-ounce) packages, softened"}, {"name": "sour cream", "quantity": "1 cup"}, {"name": "white sugar", "quantity": "1 cup, plus 1/4 cup for meringue"}, {"name": "large eggs", "quantity": "4, plus 4 egg whites for meringue"}, {"name": "fresh lemon juice", "quantity": "1/4 cup"}, {"name": "lemon zest", "quantity": "from 1 lemon"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "cream of tartar", "quantity": "1/4 teaspoon (optional)"}, {"name": "lemon curd", "quantity": "1 1/2 cups"}], "created": "2024/04/09", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/C9d4U_1Ix-LlrYdLSZnHrBPD9Fs=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/AR-244929_Lemon-Meringue-Cheesecake-DDMFS-4x3-df1a689ad3394c42a44fc4d649a24ef2.jpg"}
{"title": "Tiramisu Cheesecake", "description": "A decadent cheesecake that combines the classic flavors of tiramisu with the rich, creamy texture of New York-style cheesecake.", "preparation_time_minutes": 25, "cooking_time_minutes": 40, "steps": ["Preheat the oven to 350 degrees F (175 degrees C) and place a pan of water on the lowest oven rack.", "Make the crust: Crush ladyfingers into fine crumbs, then mix with melted butter and coffee-flavored liqueur. Press into the bottom of a 9-inch springform pan.", "Make the filling: Beat cream cheese, mascarpone cheese, and sugar until smooth. Add coffee-flavored liqueur and mix. Add flour and eggs; mix on low speed until smooth. Add heavy cream if the batter is too thick. Pour over the crust.", "Bake on the center rack for 40-45 minutes until set. Turn off the oven and leave the cheesecake to cool on the rack for 20 minutes.", "Remove from the oven and cool completely on a wire rack, then refrigerate for at least 3 hours or overnight.", "Grate semisweet chocolate over the top before serving."], "ingredients": [{"name": "ladyfingers", "quantity": "12 ounces"}, {"name": "unsalted butter, melted", "quantity": "1/4 cup"}, {"name": "coffee-flavored liqueur", "quantity": "2 tablespoons"}, {"name": "cream cheese", "quantity": "3 (8-ounce) packages, softened"}, {"name": "mascarpone cheese", "quantity": "8 ounces, softened"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "all-purpose flour", "quantity": "1/4 cup"}, {"name": "large eggs", "quantity": "2"}, {"name": "heavy cream", "quantity": "1 teaspoon (optional)"}, {"name": "semisweet chocolate", "quantity": "1/4 ounce, for grating"}], "created": "2023/01/31", "ratings": 4.5, "image_url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2022%2F07%2F16%2F514088-tiramisu-cheesecake-chibi-chef-1x1-1.jpg&q=60&c=sc&poi=auto&orient=true&h=512"}
{"title": "Chocolate Cupcakes with Bailey's Creme Frosting", "description": "Delicious chocolate cupcakes with a hint of Bailey's Irish Cream in the frosting, perfect for St. Patrick's Day or any celebration.", "preparation_time_minutes": 15, "cooking_time_minutes": 20, "steps": ["Preheat oven to 350 degrees F (175 degrees C) and line 24 muffin cups with paper liners.", "In a large bowl, whisk together 2 1/2 cups flour, cocoa powder, baking soda, salt, and baking powder.", "Beat sugar, 2/3 cup butter, water, vanilla extract, and eggs into the dry mixture until smooth. Toss chocolate chips with 2 tablespoons flour to coat and fold into the batter.", "Divide batter among muffin cups, filling each about 2/3 full. Bake for 20 minutes or until a toothpick comes out clean. Let cool completely.", "For frosting: Beat 1 cup butter, Irish cream, 2 teaspoons vanilla, and green food coloring (optional) until smooth. Reduce mixer speed to low, add confectioners' sugar 1 cup at a time until desired consistency is reached.", "Spread frosting on cooled cupcakes."], "ingredients": [{"name": "all-purpose flour", "quantity": "2 1/2 cups, plus 2 tablespoons for coating chocolate chips"}, {"name": "unsweetened cocoa powder", "quantity": "2/3 cup"}, {"name": "baking soda", "quantity": "1 1/4 teaspoons"}, {"name": "salt", "quantity": "1 teaspoon"}, {"name": "baking powder", "quantity": "1/4 teaspoon"}, {"name": "white sugar", "quantity": "1 2/3 cups"}, {"name": "butter, softened", "quantity": "2/3 cup, plus 1 cup for frosting"}, {"name": "water", "quantity": "1 1/4 cups"}, {"name": "vanilla extract", "quantity": "1 teaspoon, plus 2 teaspoons for frosting"}, {"name": "eggs", "quantity": "2"}, {"name": "chocolate chips", "quantity": "2 cups"}, {"name": "Irish cream liqueur", "quantity": "1/4 cup"}, {"name": "green food coloring", "quantity": "3 drops, optional"}, {"name": "confectioners' sugar", "quantity": "3 cups, or more as needed"}], "created": "2020/06/18", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/FlOtZ9UmIWChI5JbbDwr8ljR30k=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/6457346-ccc70228d41742f9a1a493ba7c87be74.jpg"}
{"title": "Irish Cocktail Cupcakes", "description": "A rich and decadent dessert inspired by the Irish cocktail made with Guinness, whiskey, and Irish cream.", "preparation_time_minutes": 15, "cooking_time_minutes": 30, "steps": ["Preheat oven to 350 degrees F (175 degrees C). Line a muffin tin with paper liners.", "Combine stout beer and butter in a saucepan over low heat until butter melts, about 5 minutes. Remove from heat and whisk in brown sugar and cocoa.", "In a separate bowl, whisk together sour cream, eggs, and vanilla extract. Pour into the saucepan mixture and stir until smooth.", "Stir flour and baking soda together, then fold into the batter. Divide batter among prepared muffin cups.", "Bake for about 25 minutes or until a toothpick comes out clean. Cool in tin for 10 minutes, then transfer to a wire rack.", "For frosting: Beat 1 stick butter until smooth, then add Irish cream and whiskey on low speed. Gradually add confectioners' sugar until frosting is smooth and creamy.", "Spread frosting over cooled cupcakes."], "ingredients": [{"name": "Irish stout beer (e.g., Guinness)", "quantity": "1 cup"}, {"name": "unsalted butter", "quantity": "9 tablespoons, cut into 1-inch pieces"}, {"name": "dark brown sugar", "quantity": "2 cups"}, {"name": "unsweetened cocoa powder", "quantity": "3/4 cup"}, {"name": "sour cream", "quantity": "3/4 cup"}, {"name": "eggs", "quantity": "2"}, {"name": "vanilla extract", "quantity": "1 tablespoon"}, {"name": "all-purpose flour", "quantity": "2 cups"}, {"name": "baking soda", "quantity": "2 1/2 teaspoons"}, {"name": "unsalted butter for frosting", "quantity": "1 stick"}, {"name": "Irish cream liqueur (e.g., Baileys)", "quantity": "2 tablespoons or more to taste"}, {"name": "Irish whiskey (e.g., Jameson)", "quantity": "2 teaspoons or to taste"}, {"name": "confectioners' sugar", "quantity": "3 cups"}], "created": "2020/03/05", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/patQxHT8huFAsFzsIwhka-uwqCU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/6382465-98b9df958e6544819771dfc84bee49d6.jpg"}
{"title": "Peach Custard Pie", "description": "This peach custard pie, a cross between peach pie and Southern chess pie, has just the right amount of peach to balance with the tender custard and the flaky crust.", "preparation_time_minutes": 20, "cooking_time_minutes": 65, "steps": ["To blind bake the crust (optional): Chill pastry-filled pie pan at least 20 minutes before baking to prevent shrinkage.", "Preheat the oven to 400 degrees F (200 degrees C). Line pastry with parchment or a double layer of aluminum foil and a layer of pie weights or dried beans.", "Bake in the preheated oven for about 15 minutes. Remove from the oven, carefully remove the foil and weights, and let cool to room temperature, about 20 minutes.", "Reduce the oven temperature to 350 degrees F (175 degrees C). For custard: combine eggs, white sugar, and brown sugar in a bowl, and whisk vigorously until sugar is dissolved, about 2 minutes. Add flour, cornmeal, salt, vanilla, vinegar, milk, and butter, and whisk vigorously until you achieve a smooth, emulsified batter, about 2 minutes.", "Arrange 12 peach slices on the bottom of the crust. Whisk batter again, and slowly ladle into the crust, being careful not to move the peach slices out of place.", "Bake in the preheated oven at 350 degrees F (175 degrees C) until top is browned and a very sharp knife inserted near the center comes out clean, 50 to 60 minutes.", "Let cool completely before serving. For best results, chill in the refrigerator before serving."], "ingredients": [{"name": "pie crust shell", "quantity": "1"}, {"name": "ripe peaches, peeled and sliced into eighths", "quantity": "2"}, {"name": "large eggs", "quantity": "4"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "brown sugar", "quantity": "1 tablespoon"}, {"name": "all-purpose flour", "quantity": "1 tablespoon"}, {"name": "cornmeal", "quantity": "2 tablespoons"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "apple cider vinegar", "quantity": "1 tablespoon"}, {"name": "whole milk", "quantity": "1/4 cup"}, {"name": "melted butter", "quantity": "1/2 cup"}], "created": "2024/07/23", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/_l5gdVl8KPTjb_rhjiGQgzvcqk0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/3791468-ab8dd1ed8b034152a3a908023a63d896.jpg"}
{"title": "Blackberry Peach Pie", "description": "You can't go wrong with blackberries and peaches in a pie, with some spices sprinkled on top for a tasty summer dessert.", "preparation_time_minutes": 15, "cooking_time_minutes": 50, "steps": ["Preheat the oven to 450 degrees F (230 degrees C).", "Mix blackberries, peaches, cornstarch, and sugar together in a large bowl.", "Press one of the pie crusts into the bottom of a 9-inch pie pan. Pour blackberry mixture into crust; cover with remaining pie crust. Crimp the edges of the two crusts together to seal. Cut slits in the top of the pie to vent. Brush the top with melted butter; sprinkle cinnamon and nutmeg on top.", "Bake in the preheated oven for 15 minutes. Reduce oven temperature to 350 degrees F (175 degrees C) and continue to cook until top crust is golden brown, 35 to 40 minutes."], "ingredients": [{"name": "fresh blackberries", "quantity": "3 cups"}, {"name": "fresh peaches, peeled, pitted, and sliced", "quantity": "3"}, {"name": "cornstarch", "quantity": "3 tablespoons"}, {"name": "white sugar", "quantity": "3/4 cup"}, {"name": "double crust ready-to-use pie crust", "quantity": "1"}, {"name": "butter, melted", "quantity": "2 tablespoons"}, {"name": "ground cinnamon", "quantity": "1 tablespoon"}, {"name": "ground nutmeg", "quantity": "1/2 teaspoon"}], "created": "2023/06/26", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/NI2emkYzkplVZj8X4ZNVgqJ1m_o=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/2554932-b1fab13608c643eeb75b9dad17463525.jpg"}
{"title": "Strawberry Rhubarb Cream Pie", "description": "Strawberries and rhubarb are surrounded by a creamy custard in this rich double crust pie.", "preparation_time_minutes": 15, "cooking_time_minutes": 60, "steps": ["Preheat oven to 400 degrees F (200 degrees C).", "In a large bowl, mix together sugar, flour, and nutmeg. Stir in eggs. Fold in rhubarb making sure to coat well, then do the same with the strawberries.", "Pour mixture into pie crust. Place second crust on top being sure to cut slits into it to vent steam. Brush egg white on top crust.", "Bake for 50 to 60 minutes in the preheated oven, until rhubarb is tender, and crust is golden."], "ingredients": [{"name": "white sugar", "quantity": "1 1/2 cups"}, {"name": "all-purpose flour", "quantity": "1/4 cup"}, {"name": "ground nutmeg", "quantity": "3/4 teaspoon"}, {"name": "eggs, beaten", "quantity": "3"}, {"name": "chopped rhubarb", "quantity": "4 cups"}, {"name": "halved fresh strawberries", "quantity": "3 cups"}, {"name": "pastry for a 9 inch double crust pie", "quantity": "1"}, {"name": "egg white", "quantity": "1"}], "created": "2024/06/10", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/o6fUPuXEqggLb5516XHpYzaoe_c=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/12612-RhubarbAndStrawberryPie-mfs-4X3-3491-9de1214bfb2040988e0f1acb94b5661c.jpg"}
{"title": "Mini Lemon Tarts", "description": "These little lemon tarts have a rich and buttery shortbread crust and a tangy lemon filling made with lemon zest and lemon juice. They're the perfect size for parties!", "preparation_time_minutes": 15, "cooking_time_minutes": 25, "steps": ["Preheat the oven to 350 degrees F (175 degrees C).", "To make the filling: Combine sugar, lemon juice, eggs, flour, and lemon zest together in a large mixing bowl, and whisk until well blended. Set aside.", "To make the crust: Combine flour, butter, sugar, and salt in the bowl of a food processor; pulse several times until dough begins to come together in a ball.", "Divide the dough into 6 equal portions: press each portion of dough into the bottom and up the sides of nonstick 6-cup mini tart pan. Spoon lemon filling into each crust.", "Bake tarts in the preheated oven until the filling is set and the crust is lightly browned, 25 to 30 minutes. Cool on a wire rack until mini tarts reach room temperature."], "ingredients": [{"name": "white sugar", "quantity": "1 cup"}, {"name": "freshly squeezed lemon juice", "quantity": "1/3 cup"}, {"name": "large eggs", "quantity": "3"}, {"name": "all-purpose flour", "quantity": "3 tablespoons"}, {"name": "lemon zest", "quantity": "1 tablespoon"}, {"name": "all-purpose flour", "quantity": "2 cups"}, {"name": "unsalted butter, softened", "quantity": "1 cup"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "kosher salt", "quantity": "1/2 teaspoon"}], "created": "2024/05/18", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/g8sesLfe44Cr-BpijussNHTdJNc=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/kimshupe_easyminilemontartswithshortbreadcrust_horizontal-704d21fe6c174b56b5be0434feb577ad.JPG"}
{"title": "Peanut Butter Pie", "description": "This peanut butter pie recipe is very easy to make. Garnish with peanut butter cups for an extra special treat!", "preparation_time_minutes": 20, "cooking_time_minutes": 60, "steps": ["Mix cream cheese, peanut butter, and confectioners' sugar together until smooth.", "Fold in 1/2 of the whipped topping, then spoon the mixture into graham cracker crust.", "Spread remaining whipped topping over the peanut butter mixture and garnish with peanut butter cups.", "Chill for at least 2 hours or overnight before serving."], "ingredients": [{"name": "cream cheese, softened", "quantity": "8 ounces"}, {"name": "creamy peanut butter", "quantity": "1/2 cup"}, {"name": "confectioners' sugar", "quantity": "1/2 cup"}, {"name": "frozen whipped topping, thawed, divided", "quantity": "16 ounces"}, {"name": "prepared graham cracker crust", "quantity": "1 (9-inch)"}, {"name": "miniature chocolate-covered peanut butter cups", "quantity": "15"}], "created": "2024/10/03", "ratings": 4.8, "image_url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2022%2F05%2F17%2F190359-peanut-butter-pie-Melissa-Goff-1x1-1.jpg&q=60&c=sc&poi=auto&orient=true&h=512"}
{"title": "Coconut Pie", "description": "This coconut pie recipe includes a homemade custardy filling with lots of flaked coconut and vanilla for a sweet and delicious dessert.", "preparation_time_minutes": 10, "cooking_time_minutes": 60, "steps": ["Preheat the oven to 300 degrees F (150 degrees C).", "Mix sugar and flour together in a large bowl. Beat in eggs and butter until well combined.", "Stir in milk and vanilla until incorporated. Fold in coconut. Pour into prepared pie crust.", "Bake in the preheated oven for 1 hour. Cool completely before slicing."], "ingredients": [{"name": "white sugar", "quantity": "1 cup"}, {"name": "all-purpose flour", "quantity": "2 tablespoons"}, {"name": "large eggs", "quantity": "3"}, {"name": "butter, softened", "quantity": "1/2 cup"}, {"name": "milk", "quantity": "1 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "flaked coconut", "quantity": "1 cup"}, {"name": "unbaked pie crust", "quantity": "1 (9-inch)"}], "created": "2023/10/30", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/icCTpCLUVK2vYa5eCkdw0X5ADQM=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/12506coconut-pieChefMo4x3-54d62d67daf44025b60234d4ae8cb245.jpg"}
{"title": "Chocolate Potato Chip Pie", "description": "Sweet or salty? This rich chocolaty pie with a potato chip crust has you covered.", "preparation_time_minutes": 20, "cooking_time_minutes": 45, "steps": ["Preheat the oven to 350 degrees F (175 degrees C).", "Crust: In a food processor, pulse potato chips until fine crumbs. Transfer to a large bowl; add oat flour and melted butter. Mix until well combined. Press crumbs evenly into a 9-inch deep-dish pie plate.", "Bake in the preheated oven until golden, 10 to 12 minutes. Set aside.", "Filling: Place semisweet chocolate chips, bittersweet chocolate, and heavy whipping cream in a saucepan over medium-low heat. Stir until chocolate melts and mixture is smooth, about 5 minutes. Whisk in eggs, vanilla, and salt. Cook, stirring, just until mixture begins to thicken, about 5 minutes. Remove from heat; pour filling into crust.", "Bake in the preheated oven until set, 28 to 30 minutes. Cool for 30 minutes.", "Ganache: In a small saucepan over medium-low heat, whisk together the dark chocolate chips and heavy whipping cream until smooth. Whisk in the vegetable oil. Let cool for 5 minutes.", "Pour ganache over top of pie and smooth with an offset spatula.", "Before chocolate sets, sprinkle crushed chips around the edge of the pie. Let stand for 30 minutes.", "Place pie in refrigerator and let cool until ganache is set, 1 to 2 hours. Cut into slices and enjoy!"], "ingredients": [{"name": "kettle-cooked potato chips", "quantity": "16 ounces"}, {"name": "unsalted butter, melted", "quantity": "6 tablespoons"}, {"name": "oat flour", "quantity": "1/4 cup"}, {"name": "semisweet chocolate chips", "quantity": "1 1/2 cups"}, {"name": "bittersweet chocolate, chopped", "quantity": "4 ounces"}, {"name": "heavy whipping cream", "quantity": "1/2 cup"}, {"name": "large eggs, yolks broken", "quantity": "3"}, {"name": "vanilla extract", "quantity": "2 teaspoons"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "dark chocolate chips", "quantity": "2 cups"}, {"name": "heavy whipping cream", "quantity": "1 cup"}, {"name": "vegetable oil", "quantity": "1 tablespoon"}, {"name": "kettle-cooked potato chips, crushed", "quantity": "12"}], "created": "2023/06/28", "ratings": 4.0, "image_url": "https://www.allrecipes.com/thmb/2EVs08yZuUKm9iuRX0QFuawL2M0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7501170ChocolatePotatoChipPieKim4x3-bf1cc657cb52454a9ef2a837200d052f.jpg"}
{"title": "Ruffled Milk Pie", "description": "This Greek-origin pie consists of a milk base, eggs, vanilla, and phyllo dough, decorated with icing sugar and cinnamon.", "preparation_time_minutes": 20, "cooking_time_minutes": 45, "steps": ["Preheat oven to 375 degrees F (190 degrees C). Brush 1 tablespoon butter in bottom and up sides of a 9 1/2-inch deep dish pie plate.", "Combine sugar, cinnamon, and salt in a small bowl.", "Place 1 sheet of phyllo dough on a cutting board or clean work surface; brush butter over 1 side. Carefully scrunch up phyllo by pushing the short sides towards another to create a rope.", "Loosely wrap into a coil and place in the center of the prepared baking dish. Repeat with remaining phyllo sheets and butter, placing and forming around the center coil to form a concentric circle, packing them in tightly.", "Sprinkle 2 tablespoons of the spiced sugar mixture on top.", "Bake in the preheated oven until golden, about 25 minutes. Remove from oven and reduce oven temperature to 325 degrees F (165 degrees C).", "While phyllo bakes, heat milk and cream in a small saucepan over medium heat until it just begins to boil. Remove from heat.", "Whisk together eggs, vanilla, and remaining spiced sugar mixture in a bowl; gradually add hot milk, whisking constantly, until combined. Immediately pour spiced milk over phyllo in the baking dish and return to the oven.", "Bake until custard is just set, 20 to 25 minutes. Dust with powdered sugar. Serve warm or at room temperature."], "ingredients": [{"name": "melted ghee or clarified butter, divided", "quantity": "12 tablespoons"}, {"name": "granulated sugar", "quantity": "3/4 cup"}, {"name": "ground cinnamon", "quantity": "1/2 teaspoon"}, {"name": "table salt", "quantity": "1/8 teaspoon"}, {"name": "frozen phyllo dough, thawed", "quantity": "14 sheets"}, {"name": "whole milk", "quantity": "1 1/4 cups"}, {"name": "heavy cream", "quantity": "1/4 cup"}, {"name": "large eggs", "quantity": "5"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "powdered sugar", "quantity": "1 tablespoon"}], "created": "2023/02/24", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/qnrxoJsEpRcGjPBwMbD4br1R2QY=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Ruffled-Milk-Pie-mfs-4x3-001-baf455217af1466ab32c20bf5632bff5.jpg"}
{"title": "Air Fryer Mini Dark Chocolate Cake with Brown Butter Frosting", "description": "Use your air fryer to make this yummy mini dark chocolate cake topped with brown butter frosting. Brown butter frosting needs to be used immediately after preparation.", "preparation_time_minutes": 20, "cooking_time_minutes": 25, "steps": ["Preheat air fryer to 320 degrees F (160 degrees C). Coat a 6-inch cake pan with cooking spray. Line bottom of pan with parchment paper; dust with 2 tablespoons flour, tapping out excess.", "Stir together 1/4 cup flour, the cocoa, baking powder, baking soda, and salt in a small bowl. In another small bowl, whisk together buttermilk, applesauce, oil, espresso powder, and vanilla.", "In a third bowl, beat egg with an electric mixer at low speed. Gradually add sugar. Increase mixer speed to high and continue beating until mixture is thick and pale, about 2 minutes.", "Alternately fold flour mixture and buttermilk mixture into egg mixture with a rubber spatula, stirring until incorporated before adding next addition. Fold in dark chocolate.", "Pour batter into the prepared pan. Arrange pan in the air fryer basket.", "Cook until a toothpick inserted in center comes out clean, about 25 minutes. Let cool in pan on a wire rack about 10 minutes. Remove cake from pan and allow to cool completely on a wire rack.", "For the frosting, melt butter in a heavy saucepan over medium heat; cook, stirring occasionally, until butter begins to turn golden brown and smells nutty, 15 to 20 minutes. Transfer butter to a bowl; cool for 10 minutes.", "Whisk in honey and vanilla. Whisk in powdered sugar until smooth, adding water, 1 teaspoon at a time, until desired consistency. The frosting will look separated but will come together with whisking in water a little at a time.", "Immediately top cooled cake with the frosting and garnish with additional dark chocolate."], "ingredients": [{"name": "cooking spray", "quantity": "1 can"}, {"name": "flour", "quantity": "1/4 cup"}, {"name": "Unsweetened Dutch process cocoa powder", "quantity": "3 tablespoons"}, {"name": "Baking powder", "quantity": "1/2 teaspoon"}, {"name": "Baking soda", "quantity": "1/4 teaspoon"}, {"name": "Salt", "quantity": "1/4 teaspoon"}, {"name": "Low-fat buttermilk", "quantity": "3 teaspoons"}, {"name": "Unsweetened applesauce", "quantity": "3 teaspoons"}, {"name": "Canola oil", "quantity": "4 1/2 teaspoons"}, {"name": "Instant espresso coffee powder", "quantity": "1 teaspoon"}, {"name": "Vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "Large egg", "quantity": "1"}, {"name": "Sugar", "quantity": "1/2"}, {"name": "Dark chocolate", "quantity": "1 ounce"}], "created": "2023/6/21", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/ylHHityWd9Eaw2bfgyYAk_OC5Zo=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7509612-air-fryer-mini-dark-chocolate-cake-with-brown-butter-frosting-GOLDMAN-R311671-4x3-2717-cb0e2b7273b94b63946d0a0259debbe0.jpg"}
{"title": "No-Bake Chocolate Cheesecake", "description": "This no-bake chocolate cheesecake is deliciously rich but easy to make! It's lovely topped with some sweetened whipped cream, fresh berries, or a raspberry coulis. This recipe was passed down to me from my mom.", "preparation_time_minutes": 30, "cooking_time_minutes": 90, "steps": ["Gather your ingredients.", "Mix graham cracker crumbs with melted butter and 1 tablespoon of sugar; press crumb mixture into bottom and 1/2-inch up the sides of an 8-inch springform pan. Refrigerate crust while you make the filling.", "Melt chocolate in a microwave-safe glass or ceramic bowl in the microwave on high power for 1 to 2 minutes, or until melted, stirring every 15 seconds; set aside to cool.", "Whisk cocoa powder and enough warm water together in a medium bowl to form a smooth paste.", "Beat cream cheese and remaining sugar into cocoa mixture until combined; set aside.", "Beat cream in a chilled glass or metal bowl with an electric mixer until soft peaks form. Fold in cooled melted chocolate.", "Fold chocolate cream mixture into cream cheese mixture until thoroughly combined; spread on top of graham cracker crust.", "Freeze cheesecake for 1 hour. Thaw in the refrigerator for 30 minutes before serving."], "ingredients": [{"name": "Graham cracker crumbs", "quantity": "1 cup"}, {"name": "Salted butter, melted", "quantity": "1/4 cup"}, {"name": "White sugar", "quantity": "1/2 cup"}, {"name": "Dark chocolate", "quantity": "5 ounces"}, {"name": "Unsweetened cocoa powder", "quantity": "2 tablespoons"}, {"name": "Hot water", "quantity": "3 tablespoons"}, {"name": "Cream cheese", "quantity": "8 ounces"}, {"name": "Heavy cream", "quantity": "1/2 cup"}], "created": "2024/3/6", "ratings": 4.9, "image_url": "https://www.allrecipes.com/thmb/27djV28FQBhsLGLa5tURn-oDgSw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7485249-no-bake-chocolate-cheesecake-mfs-4x3-f88418918dcd4358865f6c440ff72ad9.jpg"}
{"title": "Cranberry Bliss Bars", "description": "These cranberry bliss bars are my version of Starbucks festive treat. Not identical but they still taste delicious!", "preparation_time_minutes": 25, "cooking_time_minutes": 30, "steps": ["Beat 3 cups confectioners' sugar, cream cheese, lemon or orange juice, and 1 teaspoon vanilla extract together in a large bowl using an electric mixer until frosting is smooth. Cover bowl with plastic wrap and refrigerate while preparing cake.", "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking pan.", "Beat brown sugar and butter together in a large bowl using an electric mixer until smooth; beat in eggs, 1 at a time, until smooth. Stir 2 tablespoons ginger, 1 teaspoon vanilla extract, and salt into brown sugar-butter mixture until incorporated.", "Beat flour and baking powder into brown sugar-butter mixture until batter is smooth; fold in 3/4 cup dried cranberries and white chocolate chips. Pour batter into the prepared baking pan, spreading evenly.", "Bake in the preheated oven until cake is lightly browned and a toothpick inserted in the center comes out clean, about 30 minutes. Cool cake completely.", "Spread frosting evenly over cake; sprinkle with 1/4 cup dried cranberries and 2 tablespoons ginger.", "Whisk 1/2 cup confectioners' sugar and cream together in a bowl until smooth; drizzle over frosted cake. Cover cake with plastic wrap and refrigerate until chilled, about 2 hours.", "Cut cake in half lengthwise and each half into 8 equal rectangles. Cut each rectangle in half diagonally, creating 16 triangle-shaped bars."], "ingredients": [{"name": "Confectioners' sugar", "quantity": "3 cups"}, {"name": "Cream cheese", "quantity": "8 ounces"}, {"name": "Lemon or orange juice", "quantity": "1 tablespoon"}, {"name": "Vanilla extract", "quantity": "1 teaspoon"}, {"name": "Packed dark brown sugar", "quantity": "1 cup"}, {"name": "Butter", "quantity": "3/4 cups"}, {"name": "Large eggs", "quantity": "3"}, {"name": "Minced candied ginger", "quantity": "2 tablespoons"}, {"name": "Salt", "quantity": "1/2 teaspoon"}, {"name": "All-purpose flour", "quantity": "1 1/2 cups"}, {"name": "Baking powder", "quantity": "1/2 teaspoon"}, {"name": "Chopped sweetened dried cranberries", "quantity": "3/4 cups"}, {"name": "White chocolate chips", "quantity": "1 cup"}, {"name": "Confectioners' sugar", "quantity": "1/2 cup"}, {"name": "Heavy whipping cream", "quantity": "1/2 tablespoon"}], "created": "2023/9/21", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/T3K1Kwe--e4HmzTRXmOdnlEhLCE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/1101151-81ac2078709043a284131a6193cf3641.jpg"}
{"title": "Raspberry White Chocolate Mousse", "description": "This white chocolate mousse is deliciously light and fluffy with a fruity raspberry sauce. This wonderful mousse can also be used as a filling or frosting for cakes.", "preparation_time_minutes": 15, "cooking_time_minutes": 10, "steps": ["Process berries in a blender or food processor until smooth. Strain mixture into a small bowl and discard seeds. Add sugar and liqueur; stir until sugar dissolves. Makes 1 cup raspberry sauce.", "Warm 1/4 cup cream and white chocolate in a heavy saucepan over low heat, stirring constantly, until chocolate melts; let mixture cool until lukewarm.", "Stir in 1 tablespoon raspberry sauce and food coloring. Transfer to a large bowl.", "Beat 1 1/2 cups cream in a chilled glass or metal bowl with an electric mixer until soft peaks form; fold into melted chocolate mixture, 1/3 at a time, until no streaks remain.", "Layer into parfait dishes and serve with remaining raspberry sauce."], "ingredients": [{"name": "Frozen raspberries", "quantity": "10 ounces"}, {"name": "White sugar", "quantity": "2 tablespoons"}, {"name": "Orange liqueur", "quantity": "2 tablespoons"}, {"name": "Heavy whipping cream", "quantity": "1 3/4 cups, divided"}, {"name": "White chocolate chips", "quantity": "6 ounces"}, {"name": "Red food coloring", "quantity": "1 drop"}], "created": "2023/04/21", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/3CePtfZht3CGHea774-ItW7ScyE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/3449-raspberry-white-chocolate-mousse-LynnInHK-4x3-1-1280ceff90c346c9ba94f5329fe31752.jpg"}
{"title": "White Chocolate Macadamia Nut Cookies", "description": "I was served white chocolate macadamia nut cookies at a restaurant in Springfield, MO, during a business conference. Went home and made up this recipe which has been a hit at any church gathering I take them to. They're even better than the one I had at the conference.", "preparation_time_minutes": 15, "cooking_time_minutes": 10, "steps": ["Preheat the oven to 350 degrees F (175 degrees C).", "Beat butter, brown sugar, and white sugar together in a large bowl with an electric mixer until light and fluffy. Beat in eggs one at a time, then stir in vanilla and almond extracts.", "Combine flour, baking soda, and salt in another bowl. Gradually stir flour mixture into butter mixture; fold in macadamia nuts and white chocolate.", "Drop spoonfuls of dough 2 inches apart onto ungreased cookie sheets.", "Bake in the preheated oven until golden brown, about 10 minutes."], "ingredients": [{"name": "Butter", "quantity": "1 cup"}, {"name": "Light brown sugar", "quantity": "3/4 cup"}, {"name": "White sugar", "quantity": "1/2 cup"}, {"name": "Large eggs", "quantity": "2"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "almond extract", "quantity": "1/2 teaspoon"}, {"name": "all-purpose flour", "quantity": "2 1/2 cups"}, {"name": "baking soda", "quantity": "1 teaspoon"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "coarsely chopped macadamia nuts", "quantity": "1 cup"}, {"name": "coarsely chopped white chocolate", "quantity": "1 cup"}], "created": "2023/10/12", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/dxfHavgPzMbrL7Pj8Y_t9qOh1CA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/292145-white-chocolate-macadamia-nut-cookies-iii-photo-by-apurpleocean-3f0771a7832d4fcbb8d4d2d2ce136a61.jpg"}
{"title": "White Chocolate Raspberry Cheesecake", "description": "This white chocolate raspberry cheesecake is excellent and similar to one you would get in a restaurant. Great for special occasions. Garnish with white chocolate curls if desired.", "preparation_time_minutes": 25, "cooking_time_minutes": 70, "steps": ["Gather the ingredients.", "Make crust: Mix together cookie crumbs, melted butter, and sugar in a medium bowl. Press mixture into the bottom of a 9-inch springform pan.", "Make sauce: Combine raspberries, water, sugar, and cornstarch in a saucepan. Bring to a boil and continue boiling until sauce is thick, about 5 minutes. Strain through a mesh strainer to remove seeds.", "Preheat the oven to 325 degrees F (165 degrees C).", "Make cheesecake: Melt white chocolate chips with half-and-half in a metal bowl over a pan of simmering water; stir occasionally until smooth.", "Mix together cream cheese and sugar in a large bowl until smooth. Beat in eggs one at a time. Blend in vanilla and melted white chocolate mixture. Pour 1/2 of the batter over crust.", "Spoon 3 tablespoons raspberry sauce over batter. Pour remaining cheesecake batter on top. Spoon 3 tablespoons raspberry sauce over batter. Swirl batter with the tip of a knife to create a marbled effect.", "Bake in the preheated oven until filling is set, 55 to 60 minutes. Cool cheesecake at room temperature, then cover with plastic wrap and refrigerate until thoroughly chilled, 8 hours to overnight.", "Remove cheesecake from the pan and serve with remaining raspberry sauce."], "ingredients": [{"name": "Chocolate cookie crumbs", "quantity": "1 cup"}, {"name": "Melted butter", "quantity": "1/4 cup"}, {"name": "White sugar", "quantity": "5 tablespoons"}, {"name": "Frozen raspberries", "quantity": "10 ounces"}, {"name": "water", "quantity": "1/2 cup"}, {"name": "cornstarch", "quantity": "2 teaspoons"}, {"name": "white chocolate chips", "quantity": "2 cups"}, {"name": "cream", "quantity": "1/2 cup"}, {"name": "cream cheese", "quantity": "8 ounces"}, {"name": "large eggs", "quantity": "3"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2023/10/27", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/wfnkPcjfent9X42TgoIEkcs7ejA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/91737-eagle-brand-peanut-butter-fudge-vat-2297-4x3-1446069a0f5144469d00c578ef0498d7.jpg"}
{"title": "Eagle Brand Peanut Butter Fudge", "description": "A favorite peanut butter fudge with condensed milk. The family will go wild for this peanutty treat. Peanut butter, chopped peanuts, and white chocolate really make it special.", "preparation_time_minutes": 20, "cooking_time_minutes": 5, "steps": ["Gather all ingredients.", "Heat sweetened condensed milk and peanut butter in a heavy saucepan over medium heat, stirring constantly, until just bubbly.", "Remove from heat. Stir in white chocolate until smooth. Immediately stir in peanuts and vanilla.", "Spread evenly into a wax paper lined 8-or 9-inch square pan. Cool.", "Cover and chill for 2 hours or until firm.", "Turn fudge onto a cutting board; peel off paper. Cut into squares. Store leftovers covered in refrigerator."], "ingredients": [{"name": "Eagle Brand sweetened condensed milk", "quantity": "14 ounces"}, {"name": "Creamy Peanut Butter", "quantity": "1/2 cup"}, {"name": "white chocolate squares or white baking bars", "quantity": "12 ounces, chopped"}, {"name": "chopped peanuts", "quantity": "3/4 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2023/11/14", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/wfnkPcjfent9X42TgoIEkcs7ejA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/91737-eagle-brand-peanut-butter-fudge-vat-2297-4x3-1446069a0f5144469d00c578ef0498d7.jpg"}
{"title": "World's Best Oreo Fudge", "description": "This Oreo fudge is the best! It's sweet and chocolaty, with loads of cookie pieces. It's a pretty addition to any holiday dessert platter.", "preparation_time_minutes": 15, "cooking_time_minutes": 5, "steps": ["Line a 9x13-inch baking dish with parchment paper; set aside.", "Bring sugar, butter, and evaporated milk to a boil in a heavy-bottomed saucepan, stirring constantly; cook and stir at a boil until mixture is smooth, 3 to 5 minutes.", "Remove the saucepan from heat. Mix in white chocolate chips and marshmallow creme until melted, then stir in vanilla. Fold in 1/2 cup crumbled cookies until just incorporated. Spread fudge into the prepared baking dish.", "Sprinkle 1 cup crushed cookies evenly over the top. Press crushed cookies lightly into fudge. Cool at room temperature until set, then cut into small squares to serve."], "ingredients": [{"name": "white sugar", "quantity": "3 cups"}, {"name": "butter", "quantity": "3/4 cup"}, {"name": "evaporated milk", "quantity": "2/3 cup"}, {"name": "white chocolate chips", "quantity": "2 cups"}, {"name": "marshmallow creme", "quantity": "7 ounces"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "crumbled chocolate sandwich cookies (such as Oreo)", "quantity": "1/2 cup"}, {"name": "crushed chocolate sandwich cookies (such as Oreo)", "quantity": "1 cup"}], "created": "2023/10/31", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/XoRE3frox_kDUUCo5r34XracN70=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/5589087-e5e625806f9b43e8acfac9662ede8829.jpg"}
{"title": "White Chocolate-Covered Pretzels", "description": "This easy white chocolate-covered pretzel recipe is fun to do with the kids! Top some of the pretzels with chopped peanuts for a treat. Store in an airtight container.", "preparation_time_minutes": 30, "cooking_time_minutes": 5, "steps": ["Place white chocolate into the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until melted, about 5 minutes.", "Dip pretzels into melted chocolate to completely cover half of each one. Roll in candy sprinkles, then place onto waxed paper. Refrigerate for 15 minutes to harden."], "ingredients": [{"name": "white chocolate", "quantity": "6 ounces"}, {"name": "mini twist pretzels", "quantity": "15 ounces"}, {"name": "red and green candy sprinkles", "quantity": "1/4 cup"}], "created": "2023/05/06", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/nc9NTLhy00fHuk1Z7y5hwdYl36Y=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/4467635-98a16e90c60a4c09943e9f7ebcbc2721.jpg"}
{"title": "White Chocolate Macadamia Cranberry Dreams", "description": "A rich buttery cookie that is sure to remind you of Cape Cod!", "preparation_time_minutes": 40, "cooking_time_minutes": 10, "steps": ["Preheat oven to 350 degrees F (175 degrees C).", "In a medium bowl, combine flour, baking soda, and salt; set aside. Cream together white sugar, light brown sugar, and butter. Stir in slightly beaten eggs and vanilla.", "Add flour mixture until just mixed. Stir in vanilla chips, macadamia nuts, and dried cranberries.", "Drop dough on an ungreased cookie sheet by small scoop or rounded teaspoon. Bake in preheated oven until cookies are just set, about 10 minutes. Remove from oven and let cool. Cookies will sink slightly.", "Variations: To make chocolate cookies, omit 1/2 cup flour and replace with 1/2 cup cocoa. To make refrigerator cookies: Roll dough into 2 rolls, wrap with plastic wrap and chill or freeze. (If you freeze the dough, thaw for at least 1/2 hour before cutting). Slice 1-inch slices; cut into 4 and place on baking sheet point up. For fancier cookies: Drizzle melted white chocolate on chocolate cookies and melted dark chocolate on the white cookie. Enjoy!"], "ingredients": [{"name": "all-purpose flour", "quantity": "3 cups"}, {"name": "baking soda", "quantity": "3/4 teaspoon"}, {"name": "salt", "quantity": "3/4 teaspoon"}, {"name": "white sugar", "quantity": "3/4 cup"}, {"name": "light brown sugar", "quantity": "1 cup"}, {"name": "butter", "quantity": "1 cup"}, {"name": "eggs", "quantity": "2"}, {"name": "vanilla extract", "quantity": "1 tablespoon"}, {"name": "vanilla baking chips", "quantity": "1 cup"}, {"name": "chopped macadamia nuts", "quantity": "1 cup"}, {"name": "dried cranberries", "quantity": "1 cup"}], "created": "2022/07/14", "ratings": 4.8, "image_url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F767007.jpg&q=60&c=sc&poi=auto&orient=true&h=512"}
{"title": "White Chocolate Popcorn", "description": "This is a really, really easy recipe for white chocolate popcorn and the results are fantastic. The salty-sweet ratio is perfect! Great for parties or festive goodie bags.", "preparation_time_minutes": 10, "cooking_time_minutes": 5, "steps": ["Pop 1 popcorn package at a time in the microwave on high until popping begins to slow down, about 2 1/2 minutes. Open bags carefully and transfer popcorn to a large plastic bag, discarding any burnt pieces or unpopped kernels.", "Melt white chocolate chips with butter in top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula, until mixture is creamy, about 5 minutes.", "Drizzle melted chocolate over popcorn. Close bag and shake until thoroughly coated, 3 to 4 minutes. Place in the refrigerator to cool, about 1 hour."], "ingredients": [{"name": "plain microwave popcorn", "quantity": "3.5 ounces"}, {"name": "white chocolate chips", "quantity": "17 ounces"}, {"name": "butter", "quantity": "1 tablespoon"}], "created": "2023/10/09", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/MXkXCJwFh-_vQVJ_HGBxMFuUgDk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/3300355-white-chocolate-popcorn-Christina-4x3-1-343fa24c74bb461796f7e2bc934097a9.jpg"}
{"title": "White Chocolate Cake", "description": "This is a very heavy white chocolate cake with a white chocolate frosting. It is a family favorite that is requested at every family gathering.", "preparation_time_minutes": 20, "cooking_time_minutes": 35, "steps": ["Preheat oven to 350 degrees F (175 degrees C). Sift together flour, baking soda, baking powder, and salt. Set aside.", "In a small saucepan, melt white chocolate with hot water over low heat. Stir until smooth and allow to cool to room temperature.", "In a large bowl, cream butter and sugar until light and fluffy. Add eggs one at a time, beating well with each addition. Stir in flour mixture alternately with buttermilk. Mix in melted white chocolate.", "Pour batter into two 9-inch round cake pans. Bake for 30 to 35 minutes, until a toothpick inserted into the center comes out clean.", "To make frosting, combine white chocolate, flour, and milk in a medium bowl. Cook over medium heat, stirring constantly, until mixture is very thick. Cool completely.", "In a large bowl, cream butter, sugar, and vanilla; beat until light and fluffy. Gradually add cooled white chocolate mixture and beat until it reaches the consistency of whipped cream. Spread between layers, on top, and sides of cake."], "ingredients": [{"name": "all-purpose flour", "quantity": "2 1/2 cups"}, {"name": "baking soda", "quantity": "1 teaspoon"}, {"name": "baking powder", "quantity": "1/2 teaspoon"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "chopped white chocolate", "quantity": "12 ounces"}, {"name": "hot water", "quantity": "1/2 cup"}, {"name": "butter", "quantity": "1 cup"}, {"name": "white sugar", "quantity": "1 1/2 cups"}, {"name": "eggs", "quantity": "3"}, {"name": "buttermilk", "quantity": "1 cup"}, {"name": "milk", "quantity": "1 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2022/08/09", "ratings": 4.1, "image_url": "https://www.allrecipes.com/thmb/h_SWhpHCeXtpKEglv-Qm1IqP0CU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/772147-white-chocolate-cake-E-C-Kelly-4x3-1-4739357ce3404e67ba17e717f96e6673.jpg"}
{"title": "Milk Chocolate Peppermint Bark", "description": "This peppermint bark has a delicious milk chocolate layer on the bottom with white chocolate and bits of candy canes on top.", "preparation_time_minutes": 30, "cooking_time_minutes": 90, "steps": ["Line a 12x18 inch jelly roll pan with aluminum foil.", "Melt the milk chocolate in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 5 minutes. Do not overheat or chocolate will scorch. Stir in the peppermint extract. Spread the melted milk chocolate evenly in the prepared pan and chill until set, about 30 minutes.", "Melt the white chocolate in a microwave-safe bowl in 30-second intervals, stirring after each melting, for 1 to 5 minutes. Stir in 1/4 cup of the crushed candy canes into the melted white chocolate. Spread the white chocolate mixture evenly over the milk chocolate layer and sprinkle the remaining candy cane pieces on top.", "Chill until set, about 1 hour, then break into small pieces to serve."], "ingredients": [{"name": "milk chocolate chips", "quantity": "24 ounces"}, {"name": "white chocolate chips", "quantity": "24 ounces"}, {"name": "peppermint extract", "quantity": "2 teaspoons"}, {"name": "peppermint candy canes", "quantity": "8"}], "created": "2023/11/16", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/YsovFFHKygDbLKjpFRV0b3Zkh6c=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/ALR-155827-milk-chocolate-peppermint-bark-VAT-4x3-1-563035eb44394746a86dc88e786646e5.jpg"}
{"title": "Carrot Cupcakes with White Chocolate Cream Cheese Icing", "description": "These moist carrot cupcakes are easy to make from scratch with shredded carrots, pineapple, spices, and walnuts. A white chocolate cream cheese frosting adds the perfect amount of sweetness to these delicious treats!", "preparation_time_minutes": 30, "cooking_time_minutes": 25, "steps": ["Preheat the oven to 350 degrees F (175 degrees C). Line a 12-cup muffin pan with cupcake liners.", "For the cupcakes: In a bowl, beat white sugar, brown sugar, and eggs together; mix in oil and vanilla. Fold in shredded carrots and crushed pineapple.", "Mix flour, baking soda, cinnamon, salt, nutmeg and ginger in a separate bowl; add to carrot mixture until evenly moist. Fold in 1/2 of the chopped walnuts. Spoon batter into the prepared liners, filling each 3/4 full.", "Bake in the preheated oven until tops spring back when lightly pressed, about 25 minutes. Cool cupcakes completely on wire racks.", "Meanwhile, make the frosting: Melt white chocolate in small saucepan over low heat; stir until smooth and allow to cool to room temperature.", "Beat cream cheese and butter together with an electric mixer until smooth. Mix in cooled white chocolate, vanilla, and orange extract. Gradually beat in confectioners' sugar until fluffy, then mix in heavy cream. Top each cooled cupcake with frosting and sprinkle with remaining walnuts."], "ingredients": [{"name": "white sugar", "quantity": "1 1/8 cups"}, {"name": "brown sugar", "quantity": "1/3 cup"}, {"name": "lightly beaten large eggs", "quantity": "2"}, {"name": "vegetable oil", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "shredded carrots", "quantity": "2 cups"}, {"name": "crushed pineapple", "quantity": "1/2 cup"}, {"name": "all-purpose flour", "quantity": "1 1/2 cups"}, {"name": "baking soda", "quantity": "1 1/4 teaspoons"}, {"name": "ground cinnamon", "quantity": "1 1/2 teaspoons"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "ground nutmeg", "quantity": "1/2 teaspoon"}, {"name": "ground ginger", "quantity": "1/4 teaspoon"}, {"name": "chopped walnuts", "quantity": "1 cup"}, {"name": "white chocolate", "quantity": "2 ounces"}, {"name": "cream cheese", "quantity": "8 ounces"}, {"name": "unsalted butter", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "orange extract", "quantity": "1/2 teaspoon"}, {"name": "confectioners' sugar", "quantity": "4 cups"}, {"name": "heavy cream", "quantity": "2 tablespoons"}], "created": "2024/02/21", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/VJWoKAao6PnDIvfp33-BJj_uVQo=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/666640-carrot-cupcakes-with-white-chocolate-cream-cheese-icing-Dianne-1x1-1-074f2f11d2ce4e028661a927a7ef3df4.jpg"}
{"title": "Oreo Cookie Bark", "description": "This is really more of a candy than a cookie, but it is always a hit on my cookie trays!", "preparation_time_minutes": 20, "cooking_time_minutes": 60, "steps": ["Line a 10x15-inch jellyroll pan with waxed paper and coat with non-stick vegetable spray.", "In a large mixing bowl, break half of the cookies into coarse pieces using fingers or the back of a wooden spoon.", "In a microwave-safe glass or ceramic mixing bowl, melt one package of the white chocolate according to package directions. Remove from microwave and quickly fold in broken cookie pieces. Pour mixture into prepared pan and spread to cover half the pan.", "Repeat the process with the remaining chocolate and cookies, spreading the mixture into the other half of the pan. Refrigerate until solid, about 1 hour.", "Remove bark from the pan and carefully peel off waxed paper. Place bark on a large cutting board and cut with a large chef's knife.", "Store in an airtight container."], "ingredients": [{"name": "chocolate sandwich cookies with creme filling", "quantity": "20 ounces"}, {"name": "white chocolate", "quantity": "37 ounces"}], "created": "2022/11/20", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/znIYBjyqLR6kix_VA6qUGUt1aHY=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/507319-oreo-cookie-bark-Melissa-Goff-4x3-1-d82ef4bfa91349e7a36b28e8b663abe6.jpg"}
{"title": "White Chocolate Blondie Brownies", "description": "This is a simple variation on a chocolate brownie recipe that my mother made me growing up, which originally came from my grandmother. I am a big white chocolate fan, and this will satisfy even the biggest white chocolate craving.", "preparation_time_minutes": 15, "cooking_time_minutes": 30, "steps": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.", "Melt the butter and chopped white chocolate together over low heat in a saucepan. Remove from heat and let cool slightly. Meanwhile, beat eggs with sugar and vanilla extract in a mixing bowl. Mix in the melted butter mixture, then stir in flour and salt until thoroughly combined. Scoop the batter into the prepared baking pan and sprinkle with white chocolate chips.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 35 minutes. Allow to cool in pan for about 10 minutes before cutting into bars."], "ingredients": [{"name": "butter", "quantity": "1 cup"}, {"name": "white chocolate", "quantity": "3 ounces"}, {"name": "large eggs", "quantity": "4"}, {"name": "white sugar", "quantity": "2 cups"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "all-purpose flour", "quantity": "2 cups"}, {"name": "salt", "quantity": "1 teaspoon"}, {"name": "white chocolate chips", "quantity": "1 cup"}], "created": "2020/06/18", "ratings": 4.3, "image_url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9332222.jpg&q=60&c=sc&poi=auto&orient=true&h=512"}
{"title": "2-Ingredient Peanut Butter Fudge", "description": "This two-ingredient peanut butter fudge is the easiest fudge ever, and it is so good. Every time I make it, I get so many compliments on how great it is. I hope you try it and enjoy it as much as I do.", "preparation_time_minutes": 10, "cooking_time_minutes": 10, "steps": ["Line an 8x8-inch baking dish with plastic wrap long enough to overhang the dish by several inches on each side.", "Place broken confectioners' coating in a large glass microwave-safe bowl. Microwave on Low power until melted, smooth, and creamy, about 5 minutes, stirring every 30 seconds to 1 minute. Stir in peanut butter until fudge is thoroughly combined. Spread into the prepared baking dish.", "Refrigerate fudge until set, 1 to 2 hours. Lift out of the pan using the overhanging plastic wrap as handles; slice into 48 squares with a pizza cutter."], "ingredients": [{"name": "broken up white confectioners' coating (white almond bark)", "quantity": "1 pound"}, {"name": "peanut butter", "quantity": "18 ounce"}], "created": "2024/09/03", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/Bu9QB1qM59SIbmaRRvp72hdOsW8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/962805-cbe79e5d40b448d0b184db0c7ce62e5c.jpg"}
{"title": "Cranberry Hootycreeks", "description": "A beautifully festive cookie in a jar recipe. These make great gifts.", "preparation_time_minutes": 25, "cooking_time_minutes": 25, "steps": ["Layer the ingredients in a 1-quart or 1-liter jar in the order listed.", "Attach a tag with the following instructions: Preheat oven to 350 degrees F (175 degrees C). Grease a cookie sheet or line with parchment paper. In a medium bowl, beat together 1/2 cup softened butter, 1 egg, and 1 teaspoon of vanilla until fluffy. Add the entire jar of ingredients, and mix together by hand until well blended. Drop by heaping spoonfuls onto the prepared baking sheets.", "Bake for 8 to 10 minutes, or until edges start to brown. Cool on baking sheets, or remove to cool on wire racks."], "ingredients": [{"name": "all-purpose flour", "quantity": "5/8 cup"}, {"name": "rolled oats", "quantity": "1/2 cup"}, {"name": "all-purpose flour", "quantity": "1/2 cup"}, {"name": "baking soda", "quantity": "1/2 teaspoon"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "brown sugar", "quantity": "1/3 cup"}, {"name": "white sugar", "quantity": "1/3 cup"}, {"name": "dried cranberries", "quantity": "1/2 cup"}, {"name": "white chocolate chips", "quantity": "1/2 cup"}, {"name": "chopped pecans", "quantity": "1/2 cup"}], "created": "2022/07/14", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/5_MVesFI6XR9B2xfeObcpUmdIDI=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/747168-d91db8317e604e2ea976c561886eccde.jpg"}
{"title": "Alexander's Chocolate-Covered Peanuts", "description": "Sweet, crunchy chocolate-covered peanut clusters made in the slow cooker with three simple ingredients.", "preparation_time_minutes": 15, "cooking_time_minutes": 10, "steps": ["Cook almond bark in a slow cooker on High, uncovered and stirring occasionally, until mostly melted, 5 to 10 minutes. Reduce heat to Low and stir in chocolate chips. Cook and stir until chips are melted and mixture is dark in color, another 5 to 10 minutes.", "Turn off heat and stir in peanuts. Drop a spoonful onto parchment paper to test consistency; if too loose, stir in more chocolate chips and peanuts.", "Line several baking sheets with parchment paper. Use a melon baller to drop spoonfuls of peanut mixture onto the prepared baking sheets. Let harden before serving, about 1 hour."], "ingredients": [{"name": "white almond bark", "quantity": "18 ounces"}, {"name": "semisweet chocolate chips", "quantity": "2 cups"}, {"name": "lightly salted peanuts", "quantity": "24 ounces"}], "created": "2024/07/14", "ratings": 4.9, "image_url": "https://www.allrecipes.com/thmb/hhakp3UIPq0Tx-oU3DVPNK0vSIc=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/6153986-da9f7deb4c70414982dfac5bf4670b59.jpg"}
{"title": "White Chocolate Fudge", "description": "This is the white chocolate lovers' equivalent to heaven. Creamy sweet fudge with pecans. Serve it alongside traditional chocolate fudge for a beautiful presentation.", "preparation_time_minutes": 15, "cooking_time_minutes": 10, "steps": ["Grease an 8x8 inch baking dish and set aside.", "In a medium bowl, beat cream cheese, sugar, and vanilla until smooth.", "In a double boiler over lightly simmering water, melt white chocolate, stirring until smooth.", "Fold melted white chocolate and pecans into the cream cheese mixture. Spread into prepared baking dish. Chill for 1 hour, then cut into 1 inch squares."], "ingredients": [{"name": "cream cheese", "quantity": "8 ounces"}, {"name": "confectioners' sugar", "quantity": "4 cups"}, {"name": "vanilla extract", "quantity": "1 1/2 teaspoons"}, {"name": "chopped white chocolate", "quantity": "12 ounces"}, {"name": "chopped pecans", "quantity": "3/4 cup"}], "created": "2022/08/08", "ratings": 4.1, "image_url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F423872.jpg&q=60&c=sc&poi=auto&orient=true&h=512"}
{"title": "Cookie Balls", "description": "Only 3 ingredients! These easy cookie balls can be decorated with chocolate jimmies or colored sprinkles if done immediately after dipping.", "preparation_time_minutes": 20, "cooking_time_minutes": 30, "steps": ["In a large mixing bowl, combine crushed cookies and cream cheese to form a stiff dough. Roll into balls and dip with a fork in melted candy coating.", "Let rest until set, about 30 minutes."], "ingredients": [{"name": "chocolate sandwich cookies", "quantity": "1 pound"}, {"name": "cream cheese", "quantity": "8 ounces"}, {"name": "vanilla-flavored candy coating", "quantity": "1 pound"}], "created": "2022/11/10", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/jH0A3vIZgNN2CH9rlnjhgSrLOcA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/797850_Cookie-Balls-1x1-1-2000-33a24c082ea942c8a6ccbcd953857498.jpg"}
{"title": "Layered Peppermint Bark", "description": "I never liked peppermint bark until I tried this recipe. The soft ganache center contrasts perfectly with the crunchy peppermints.", "preparation_time_minutes": 30, "cooking_time_minutes": 15, "steps": ["Line a 9x12-inch baking pan with aluminum foil or parchment paper; set aside.", "Melt 1/2 of the white chocolate in the top of a double boiler over just barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Spread melted white chocolate into the prepared pan. Sprinkle 1/4 of the crushed peppermint candies evenly over white chocolate. Chill in the refrigerator until firm, about 15 minutes.", "Meanwhile, melt dark chocolate, heavy cream, and peppermint extract in the top of a double boiler over just barely simmering water, stirring frequently, until just melted. Quickly pour chocolate over chilled white chocolate layer; spread evenly. Chill in the refrigerator until firm, about 20 minutes.", "Meanwhile, melt remaining white chocolate in the top of a double boiler over just barely simmering water, stirring frequently, until just melted. Spread quickly over chilled chocolate layers. Sprinkle with remaining peppermint candies. Chill in the refrigerator until firm, about 20 minutes. Cut or break into small pieces to serve."], "ingredients": [{"name": "coarsely chopped white chocolate", "quantity": "20 ounces"}, {"name": "peppermint candies", "quantity": "30"}, {"name": "coarsely chopped dark chocolate", "quantity": "10 ounces"}, {"name": "heavy cream", "quantity": "6 tablespoons"}, {"name": "peppermint extract", "quantity": "1 teaspoon"}], "created": "2022/11/10", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/TP5z_t2wyyyXucme39Gqx2QgZb0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/4645138-65d422ee6e6e4443b6585a861b1b98a4.jpg"}
{"title": "Margarita Balls I", "description": "These margarita balls are right up there with rum balls.", "preparation_time_minutes": 30, "cooking_time_minutes": 15, "steps": ["Crush vanilla wafers into crumbs; combine with ground almonds.", "Melt white chocolate in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each interval, 1 to 3 minutes, or according to package directions.", "Combine tequila, orange marmalade, and light corn syrup in a blender; blend until smooth.", "Stir tequila mixture and melted chocolate into crumb mixture. Shape into 1-inch balls and coat with sugar. Store in refrigerator."], "ingredients": [{"name": "vanilla wafers", "quantity": "12 ounces"}, {"name": "blanched almonds", "quantity": "8 ounces"}, {"name": "white chocolate", "quantity": "4 ounces"}, {"name": "tequila", "quantity": "1/4 cup"}, {"name": "orange marmalade", "quantity": "1/4 cup"}, {"name": "light corn syrup", "quantity": "2 tablespoons"}, {"name": "white sugar", "quantity": "1 tablespoon"}], "created": "2024/06/06", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/TZGRovJOhjKOJHScByO0L0cfc8M=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/2264581-0a932c179d0944a59330b1958dc2a6d8.jpg"}
{"title": "Cookies 'n' Creme Fudge", "description": "This cookies and cream fudge recipe is simple to make. Creme-filled chocolate cookies are great in this white chocolate fudge.", "preparation_time_minutes": 5, "cooking_time_minutes": 10, "steps": ["In a heavy saucepan over low heat, melt white chocolate squares, sweetened condensed milk, and salt. Remove from heat; stir in crushed cookies.", "Spread evenly into a wax paper-lined 8-inch square pan. Chill in the refrigerator until firm, about 2 hours.", "Turn chilled fudge onto a cutting board; peel off wax paper. Cut fudge into squares. Store leftovers covered in the refrigerator."], "ingredients": [{"name": "white chocolate baking squares", "quantity": "6 ounces"}, {"name": "EAGLE BRAND Sweetened Condensed Milk", "quantity": "14 ounces"}, {"name": "salt", "quantity": "1/8 teaspoon"}, {"name": "coarsely crushed chocolate creme-filled sandwich cookies", "quantity": "3 cups"}], "created": "2023/02/05", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/0kDGwAIxqzf3ZxOqLMt8MInXq78=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/326521-cookies-n-creme-fudge-Shalaine_1-4x3-1-23c376323e1d4d7e934e7d796cb9c4db.jpg"}
{"title": "Cake Pops", "description": "Got this recipe for donut pops from a friend and I must share. Birthdays, Easter, baby showers, or just because they are cute and taste good! There are many ways to be creative when making these. There are dozens of different types of sprinkles or you can use different colors of candy melts and no sprinkles if you wish. Almost everything can be bought at a craft store.", "preparation_time_minutes": 30, "cooking_time_minutes": 10, "steps": ["Place about 1/4 cup candy melts into a small microwave-safe bowl and melt in the microwave at 40 percent power for 30 seconds. Stir the candy coating and continue to heat in 30 second-intervals until the coating is just warm and completely melted.", "Poke a hole halfway through doughnut holes with lollipop sticks then remove the sticks. Dip the end of the sticks into the melted coating and reinsert into doughnut holes (this holds the doughnut holes firmly on the sticks). Stick doughnut pops upright into a block of plastic foam and place into the refrigerator for 1 hour to firm up.", "When pops are firmly attached to their sticks, melt the remaining candy coating dots in a microwave-safe bowl on 40 percent power for 1 minute; stir, and melt in 30-second intervals until the coating is warm and smoothly melted.", "Dip doughnut holes into the coating, covering it completely. Hold dipped pops over a bowl and sprinkle with candy sprinkles. Return decorated pops to the plastic foam block to set."], "ingredients": [{"name": "colored candy coating melts", "quantity": "12 ounces"}, {"name": "doughnut holes", "quantity": "24 plains"}, {"name": "lollipop", "quantity": "24 sticks"}, {"name": "multicolored candy sprinkles", "quantity": "1 tablespoon"}], "created": "2022/10/20", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/nDvrHgIsf5rf4WS-yR5gOfVGjf0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/839200-975b5f0892ee4998b0da795c6bd0f7c6.jpg"}
{"title": "Buckeyes", "description": "Buckeyes are peanut butter fudge candy balls dipped in chocolate. They're called buckeyes because they look like the nuts that grow on Ohio buckeye trees. This recipe for buckeye candy is so good that I double it whenever I make it.", "preparation_time_minutes": 15, "cooking_time_minutes": 5, "steps": ["Gather all ingredients.", "Beat peanut butter, butter, and vanilla together in a large bowl with an electric mixer until light and fluffy.", "Beat in 4 cups sifted confectioners' sugar until dough is stiff, firm, and dry with no lumps; adding more sifted sugar as needed.", "Roll dough into about sixty 1-inch balls and place on wax-lined cookie sheets. Press a toothpick into the top of each ball and chill in the freezer until firm, about 30 minutes.", "Place chocolate chips in a double boiler or in a bowl set over a pan of barely simmering water. Stir frequently until melted and smooth.", "Hold the toothpicks and dip frozen peanut butter balls into the melted chocolate, leaving a small portion of peanut butter showing at the top.", "Return to the cookie sheet, remove and discard the toothpicks, and refrigerate until ready to serve. Enjoy!"], "ingredients": [{"name": "peanut butter", "quantity": "1 1/2 cups"}, {"name": "butter", "quantity": "1 cup"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "sifted confectioners' sugar, plus more as needed", "quantity": "4 cups"}, {"name": "semisweet chocolate chips", "quantity": "4 cups"}, {"name": "toothpicks", "quantity": "30"}], "created": "2022/10/20", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/oj-xLl4I8JpnxWC-xmPWNO0A5bI=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Screen-Shot-2022-08-08-at-2.04.25-PM-44856eaa13f7436e981a471445aa85d9.png"}
{"title": "Saltine Cracker Toffee", "description": "This saltine cracker toffee features a base of crackers topped with homemade toffee, melted chocolate, and chopped nuts for a delicious treat. Perfect for gifting during the holidays.", "preparation_time_minutes": 10, "cooking_time_minutes": 15, "steps": ["Gather all ingredients, and preheat the oven to 400 degrees F (200 degrees C).", "Line a rimmed baking sheet with saltine crackers in a single layer.", "Combine butter and dark brown sugar in a saucepan and bring to a boil for 3 minutes.", "Immediately pour over saltines and spread to cover crackers completely. Bake in the preheated oven for 5 to 6 minutes.", "Remove from oven and sprinkle chocolate chips over the top. Let sit for 5 minutes.", "Spread the softened chocolate evenly and sprinkle with chopped pecans. Allow to cool completely, about 25 minutes, then break into pieces."], "ingredients": [{"name": "saltine crackers", "quantity": "4 ounces"}, {"name": "butter", "quantity": "1 cup"}, {"name": "dark brown sugar", "quantity": "1 cup"}, {"name": "semisweet chocolate chips", "quantity": "2 cups"}, {"name": "chopped pecans", "quantity": "3/4 cup"}], "created": "2023/12/04", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/N2A_LrnqymqN9PwcIekjL_aoX5Y=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/ALR-recipe-11376-saltine-toffee-cookies-hero-02-VAT-4x3-916a7c0490734a19bb0313dc03719ab2.jpg"}
{"title": "Easy Oreo Truffles", "description": "These Oreo truffles are delicious and easy to make with oreo cookies, cream cheese, and semisweet chocolate. These sweet little treats are a great addition to all the other cookies on your holiday tray.", "preparation_time_minutes": 35, "cooking_time_minutes": 5, "steps": ["Gather all ingredients.", "Melt the semisweet baking chocolate in a saucepan over low heat, stirring occasionally for 4 to 6 minutes.", "While the chocolate is melting, place 9 cream-filled sandwich cookies in a food processor and blend until finely crushed. Transfer crumbs to a bowl and reserve for decorating.", "Add remaining cookies to the food processor and blend until finely crushed. Transfer crumbs to a large bowl and stir in cream cheese; mix until well-blended. Roll mixture into 42 balls, about 1-inch in diameter.", "Place each ball in melted chocolate and use two forks to roll it until fully coated. Lift the ball with both forks and allow excess chocolate to drip off.", "Place coated truffle on a wax paper-lined baking sheet and sprinkle with reserved cookie crumbs to decorate. Repeat to make remaining truffles.", "Refrigerate truffles until firm, at least 1 hour. Keep in the refrigerator until just before serving. Enjoy!"], "ingredients": [{"name": "semisweet baking chocolate", "quantity": "16 ounces"}, {"name": "cream-filled chocolate sandwich cookies", "quantity": "16 ounces"}, {"name": "cream cheese", "quantity": "8 ounces"}], "created": "2024/01/24", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/IRqMaWX8fo-dEFh0YWWSAapAwU4=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/1702587303099-Easy-Oreo-Truffles-4x3-christmas-kim-shupe-2b178d331f3c4dd092aba711321949ad.jpg"}
{"title": "Kentucky Bourbon Balls", "description": "Authentic, smooth Kentucky bourbon balls with a rich chocolate coating. Perfect for holiday gatherings or gifts, these bite-sized treats balance sweetness with the warmth of bourbon and crunchy nuts.", "preparation_time_minutes": 20, "cooking_time_minutes": 10, "steps": ["Gather all ingredients", "Place chopped nuts in a sealable jar and pour bourbon over them. Seal and let soak for 8 hours or overnight.", "In a medium bowl, mix the confectioners' sugar and softened butter until well combined.", "Fold in the soaked nuts along with any remaining bourbon. Form the mixture into 3/4-inch balls and refrigerate for 8 hours or overnight.", "Line a baking tray with waxed paper.", "Melt the semisweet chocolate in a double boiler over gently simmering water, stirring frequently.", "Roll each ball in the melted chocolate to coat evenly and place on the prepared tray.", "Refrigerate bourbon balls until set and store them in the refrigerator until serving."], "ingredients": [{"name": "chopped nuts", "quantity": "1 cup"}, {"name": "Kentucky bourbon", "quantity": "5 tablespoons"}, {"name": "confectioners' sugar", "quantity": "16 ounces"}, {"name": "butter, softened", "quantity": "1/2 cup"}, {"name": "semisweet chocolate", "quantity": "18 ounces"}, {"name": "waxed paper", "quantity": "as needed"}], "created": "2023/11/29", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/wJxKkgxdzHLAVWt7l08GI2rdgBY=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/176961-kentucky-bourbon-balls-DDMFS-Beauty-3x4-2672-fad0b3b0de4a4a83957f8c6ab22ca58c.jpg"}
{"title": "Homemade Melt-In-Your-Mouth Dark Chocolate", "description": "Homemade chocolate that melts in your mouth! This wholesome chocolate recipe is made without artificial ingredients or waxes and is ideal for health-conscious individuals who enjoy an indulgent treat. The sweetness can be tweaked to taste, and add-in ingredients and combinations are endless. Enjoy!", "preparation_time_minutes": 10, "cooking_time_minutes": 60, "steps": ["Gather all ingredients.", "Gently melt coconut oil in a saucepan over medium-low heat. Stir cocoa powder, honey, and vanilla extract into the melted oil until well blended.", "Pour the mixture into a candy mold or pliable tray.", "Refrigerate until chilled, about 1 hour.", "Cut or break into pieces and enjoy."], "ingredients": [{"name": "coconut oil", "quantity": "1/2 cup"}, {"name": "cocoa powder", "quantity": "1/2 cup"}, {"name": "honey", "quantity": "3 tablespoons"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}], "created": "2024/06/25", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/LLjT19CN8TflyLA-__X9s_W-JOk=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/AR-236212-Melt-In-Your-Mouth-Dark-Chocolate-Paleo-DDMFS-4x3-58f2dfe1d00f4177971371483accb4ca.jpg"}
{"title": "Chocolate Scotcheroos", "description": "These peanut butter scotcheroos are crunchy cereal snack bars with a rich chocolate and butterscotch topping, perfect for any gathering or as a sweet treat.", "preparation_time_minutes": 15, "cooking_time_minutes": 10, "steps": ["Spray a 9x13-inch baking dish with cooking spray.", "Make the bars: Combine corn syrup and sugar in 3-quart saucepan. Cook over medium heat, stirring frequently, until sugar dissolves and mixture begins to boil.", "Remove from heat and stir in peanut butter until well combined. Add Rice Krispies cereal and stir until evenly coated. Press the mixture into the prepared baking dish.", "Make the topping: Melt chocolate and butterscotch chips in a 1-quart saucepan over low heat, stirring constantly. Spread evenly over cereal mixture. Let stand until firm, about 20 minutes. Cut into 24 bars."], "ingredients": [{"name": "cooking spray", "quantity": "as needed"}, {"name": "light corn syrup", "quantity": "1 cup"}, {"name": "sugar", "quantity": "1 cup"}, {"name": "peanut butter", "quantity": "1 cup"}, {"name": "Kellogg's Rice Krispies cereal", "quantity": "6 cups"}, {"name": "semisweet chocolate chips", "quantity": "1 cup"}, {"name": "butterscotch chips", "quantity": "1 cup"}], "created": "2023/09-/20", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/s9OlV3nMRzVCs4-6aWStn7xp9Pk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/149064kelloggs-chocolate-scotcheroosKim4x3-2798f79076834798a0389168f0a9a5b3.jpg"}
{"title": "Lava Cake", "description": "The best lava cake I've ever had! Serve these decadent molten chocolate cakes topped with powdered sugar or vanilla ice cream. This recipe makes four delicious individual desserts.", "preparation_time_minutes": 10, "cooking_time_minutes": 15, "steps": ["Preheat the oven to 400 degrees F (200 degrees C). Grease and flour four 6-ounce ramekins.", "Place chocolate and butter in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes.", "Combine eggs and sugar in a large bowl; beat with an electric mixer until pale and thick, about 5 minutes. Mix in melted chocolate, flour, cocoa powder, and a pinch of salt until combined. Pour batter into the prepared ramekins and place on a baking tray.", "Bake in the preheated oven until the sides are set but the middle is still jiggly, 10 to 13 minutes. Let cool for 5 minutes before serving."], "ingredients": [{"name": "semisweet chocolate", "quantity": "1 ounce"}, {"name": "butter", "quantity": "1/2 cup, cut into 8 pieces"}, {"name": "eggs", "quantity": "3"}, {"name": "white sugar", "quantity": "1/3 cup"}, {"name": "all-purpose flour", "quantity": "2 tablespoons"}, {"name": "unsweetened cocoa powder", "quantity": "4 teaspoons"}, {"name": "salt", "quantity": "1 pinch"}], "created": "2024/01/16", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/3MHKBrVtQkX_KoPdaxPY_HgWyvk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/276304lava-cakeKim-e03d3bc55516400e8d05b8d84b524b73.jpg"}
{"title": "Rocky Road Candies", "description": "If a Rocky Road candy bar is your favorite treat, this recipe is one to try. Just stir peanuts and marshmallows into melted chocolate, then chill until firm. It couldn't be easier!", "preparation_time_minutes": 5, "cooking_time_minutes": 5, "steps": ["Gather all ingredients", "Line a 9x13-inch pan with waxed paper.", "Heat chocolate chips and butter in a microwave-safe bowl in 30-second increments, stirring occasionally, until melted and smooth. Stir in condensed milk.", "Mix peanuts and mini marshmallows together in a separate bowl.", "Gradually stir into chocolate mixture until incorporated.", "Pour into the prepared pan. Refrigerate until firm, about 2 hours.", "Cut into 24 squares. Enjoy!"], "ingredients": [{"name": "semisweet chocolate chips", "quantity": "12 ounces"}, {"name": "butter", "quantity": "2 tablespoons"}, {"name": "sweetened condensed milk", "quantity": "14 ounces"}, {"name": "dry-roasted peanuts", "quantity": "2 1/2 cups"}, {"name": "miniature marshmallows", "quantity": "16 ounces"}], "created": "2024/08/11", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/JO9Eu5isqMfKQ_eSzCjzhU359HU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/22730-RockyRoadCandies--ddmfs-gw-beauty-4x3-0190-db26aa17f292427c8b3b02de162e2541.jpg"}
{"title": "Peanut Butter Eggs", "description": "My mom made peanut butter eggs at Easter for many years. She would put our names on them in frosting and decorate them with bunnies and flowers. You can make smaller eggs if desired. These chocolate-dipped treats bring back wonderful memories.", "preparation_time_minutes": 25, "cooking_time_minutes": 60, "steps": ["Beat confectioners' sugar, peanut butter, and butter in a large mixing bowl until well blended; mix in milk if needed for moisture. Divide mixture in half and form into two large eggs. Place eggs onto on a wax paper-lined plate and freeze until firm, about 1 hour.", "When the eggs are almost ready, combine chocolate and shortening in the top of a double boiler over simmering water. Melt over medium heat, stirring frequently until smooth. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes.", "Remove eggs from the freezer. Carefully stick a long-tined fork in the top of an egg; gently dip it in melted chocolate until covered, then return it to the waxed paper. Repeat to dip remaining egg. Decorate as desired."], "ingredients": [{"name": "confectioners' sugar", "quantity": "16 ounces"}, {"name": "creamy peanut butter", "quantity": "1 cup"}, {"name": "unsalted butter", "quantity": "1/4 cup"}, {"name": "milk", "quantity": "1 tablespoon"}, {"name": "semisweet chocolate", "quantity": "1 ounce"}, {"name": "shortening", "quantity": "1 tablespoon"}], "created": "2024/02/07", "ratings": 4.6, "image_url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F04%2Fimage-197.jpg&q=60&c=sc&poi=auto&orient=true&h=512"}
{"title": "Dark Chocolate Cake I", "description": "This recipe features an icing made with cream cheese, cocoa, and cinnamon frosts this dark chocolate cake for an elegant dessert.", "preparation_time_minutes": 30, "cooking_time_minutes": 30, "steps": ["Preheat oven to 350 degrees F (175 degrees C). Grease 3 - 9 inch round cake pans. In medium bowl, pour boiling water over cocoa, and whisk until smooth. Let mixture cool. Sift together flour, baking soda, baking powder and salt; set aside.", "In a large bowl, cream butter and sugar together until light and fluffy. Beat in eggs one at time, then stir in vanilla. Add the flour mixture alternately with the cocoa mixture. Spread batter evenly between the 3 prepared pans.", "Bake in preheated oven for 25 to 30 minutes. Allow to cool."], "ingredients": [{"name": "boiling water", "quantity": "2 cups"}, {"name": "unsweetened cocoa powder", "quantity": "1 cup"}, {"name": "all-purpose flour", "quantity": "2 3/4 cups"}, {"name": "baking soda", "quantity": "2 tablespoons"}, {"name": "baking powder", "quantity": "1/2 teaspoon"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "butter", "quantity": "1 cup"}, {"name": "white sugar", "quantity": "2 1/4 cups"}, {"name": "eggs", "quantity": "4"}, {"name": "vanilla extract", "quantity": "1 1/2 teaspoons"}], "created": "2022/08/22", "ratings": 4.6, "image_url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F05%2F07%2F7736_DarkChocolate-Cake1_MFS50-2000.jpg&q=60&c=sc&poi=auto&orient=true&h=512"}
{"title": "Melt In Your Mouth Toffee", "description": "This is the easiest, best toffee I have ever made. Everyone who tries it wants the recipe.", "preparation_time_minutes": 10, "cooking_time_minutes": 20, "steps": ["In a heavy saucepan, combine butter, white sugar, and brown sugar. Cook over medium heat, stirring constantly until mixture boils. Boil to brittle stage, 300 degrees F (150 degrees C) without stirring. Remove from heat.", "Pour nuts and chocolate chips into a 9x13 inch dish. Pour hot mixture over the nuts and chocolate. Let the mixture cool and break it into pieces before serving."], "ingredients": [{"name": "butter", "quantity": "1 pound"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "brown sugar", "quantity": "1 cup"}, {"name": "chopped walnuts", "quantity": "1 cup"}, {"name": "semisweet chocolate chips", "quantity": "2 cups"}], "created": "2022/07/14", "ratings": 4.3, "image_url": "https://www.allrecipes.com/thmb/nmkyPm3BiySM2eT8SHNuKBIhlJA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/790289-808f33fb97634551adb125a371517aaa.jpg"}
{"title": "S'mores at Home", "description": "Quick, easy, and delicious indoor S'mores. They're messy but tasty.", "preparation_time_minutes": 10, "cooking_time_minutes": 10, "steps": ["Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13 inch baking dish.", "In a medium bowl, combine butter, sugar and graham cracker crumbs until well coated. Press half of crumb mixture into the bottom of the prepared pan. Top with the chocolate chips, then the marshmallows. Sprinkle the remaining graham cracker mixture over the marshmallows and press down with a spatula.", "Bake in preheated oven 10 minutes, until marshmallows are melted. Cool completely before cutting into squares. I Made It"], "ingredients": [{"name": "melted butter", "quantity": "1 cup"}, {"name": "white sugar", "quantity": "1/3 cup"}, {"name": "graham cracker crumbs", "quantity": "3 cups"}, {"name": "miniature marshmallows", "quantity": "3 cups"}], "created": "2020/06/18", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/knOGcJKSpWAdBNPzTSvKBcHDwZo=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/2493800-1391ef8a5c5242cd81769330aaaa8f7e.jpg"}
{"title": "Chocolate Cavity-Maker Cake", "description": "A rich, moist chocolate cake so indulgent it doesn't need frosting. This cake is perfect for chocolate lovers and makes a great impression at gatherings.", "preparation_time_minutes": 15, "cooking_time_minutes": 60, "steps": ["Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch Bundt pan.", "In a large bowl, beat together the cake mix, pudding mix, sour cream, eggs, vegetable oil, and coffee-flavored liqueur until well blended. Fold in the chocolate chips; the batter will be thick. Spoon into the prepared Bundt pan.", "Bake in the preheated oven for about 1 hour or until the cake springs back when lightly tapped. Cool the cake in the pan for 10 minutes before turning it out onto a wire rack to cool completely."], "ingredients": [{"name": "dark chocolate cake mix", "quantity": "15.25 ounces"}, {"name": "instant chocolate pudding mix", "quantity": "3.9 ounces"}, {"name": "sour cream", "quantity": "16 ounces"}, {"name": "eggs", "quantity": "3"}, {"name": "vegetable oil", "quantity": "1/3 cup"}, {"name": "coffee-flavored liqueur", "quantity": "1/2 cup"}, {"name": "semisweet chocolate chips", "quantity": "2 cups"}], "created": "2023/03/31", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/lFD5Li_t1iTwofz--GQbhhDDO2w=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/4535805-4c8f92644de74b2e927cb5d1bc3df1fd.jpg"}
{"title": "Chocolate Pretzel Treats", "description": "Pretzel Hershey kiss treats topped with M&Ms candies. These are really fun to make with the kids for a wonderful chocolate treat.", "preparation_time_minutes": 10, "cooking_time_minutes": 5, "steps": ["Gather all ingredients. Preheat the oven to 175 degrees F (80 degrees C).", "Arrange pretzels in a single layer on a baking sheet. Place a candy kiss in the center of each pretzel.", "Warm in the preheated oven for about 2 minutes, until the kisses are shiny and slightly softened.", "Press an M&M candy atop each softened kiss. Chill in the refrigerator for 10 minutes until firm."], "ingredients": [{"name": "small pretzel twists", "quantity": "15 ounces"}, {"name": "milk chocolate candy kisses", "quantity": "8 ounces"}, {"name": "candy-coated milk chocolate pieces (M&M's)", "quantity": "1.69 ounces"}], "created": "2024/08/15", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/uvUc0XskSQhkEOhVAlmXrhl7-40=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/AR-223594-Chocolate-Pretzel-Treats-4x3-step-4-0d83a046c22d487cbc552106d0cc3000.jpg"}
{"title": "Chocolate Fondue", "description": "This chocolate fondue recipes combines melted grated chocolate bars with heavy cream, coffee powder, and vanilla for a rich and creamy chocolaty treat! Serve with fruit or pieces of leftover cake on skewers.", "preparation_time_minutes": 5, "cooking_time_minutes": 15, "steps": ["Combine grated milk chocolate and heavy cream in a saucepan over medium heat; stir until melted and smooth.", "Mix in hot water, coffee powder, vanilla extract, and sugar.", "Continue to heat and stir frequently until the fondue is smooth and ready for serving."], "ingredients": [{"name": "milk chocolate", "quantity": "32 ounces"}, {"name": "heavy cream", "quantity": "1 1/4 cups"}, {"name": "hot water", "quantity": "1/3 cup"}, {"name": "instant coffee powder", "quantity": "1 tablespoon"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "white sugar", "quantity": "1 teaspoon"}], "created": "2024/01/24", "ratings": 4.9, "image_url": "https://www.allrecipes.com/thmb/IzfaBRU0Vv0QdGRAZ3qGUg6UKmU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/3429605-1ce6650b5a554890b6f287bb3e96d615.jpg"}
{"title": "Chocolate-Covered Strawberries", "description": "These chocolate-covered strawberries are made with the simplest recipe I know. White chocolate may be drizzled over the milk chocolate for a fancier look. They are perfect for parties, Valentine's Day, and weddings. Decorate with frosting bow ties, bells, butterflies, hearts, roses, etc.", "preparation_time_minutes": 15, "cooking_time_minutes": 5, "steps": ["Melt milk chocolate chips and shortening in a double boiler, stirring until smooth.", "Insert toothpicks into the tops of strawberries.", "Dip each strawberry into the melted chocolate, turning upside down to let excess drip off.", "Place the dipped strawberries on waxed paper or insert the toothpick into a Styrofoam block to cool and harden."], "ingredients": [{"name": "milk chocolate chips", "quantity": "16 ounces"}, {"name": "shortening", "quantity": "2 tablespoons"}, {"name": "fresh strawberries with leaves", "quantity": "1 pound"}, {"name": "toothpicks", "quantity": "as needed"}], "created": "2024/10/18", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/Vwrgg4GDeU9qLxJCkvctmZ1wfbQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/5125171-chocolate-covered-strawberries-photo-by-my-hot-southern-mess-2000-ff3db8c3106e42669de60ac8970b6981.jpg"}
{"title": "Aunt Teen's Creamy Chocolate Fudge", "description": "This is the best fudge recipe ever! It's my aunt's recipe, passed down through the family. It's better than any fudge I've ever had at the Jersey shore and easy enough to whip up in 15 minutes or so.", "preparation_time_minutes": 10, "cooking_time_minutes": 20, "steps": ["Line an 8-inch square pan with aluminum foil and set aside.", "In a large saucepan over medium heat, combine sugar, marshmallow creme, evaporated milk, butter, and salt. Bring to a full boil, cooking for 5 minutes while stirring constantly.", "Remove from heat, stir in both types of chocolate chips until melted and smooth.", "Mix in nuts and vanilla. Pour into prepared pan.", "Chill in the refrigerator for 2 hours or until firm. Cut into squares."], "ingredients": [{"name": "white sugar", "quantity": "1 1/2 cups"}, {"name": "marshmallow creme", "quantity": "7 ounces"}, {"name": "evaporated milk", "quantity": "2/3 cup"}, {"name": "butter", "quantity": "1/4 cup"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "milk chocolate chips", "quantity": "2 cups"}, {"name": "semisweet chocolate chips", "quantity": "1 cup"}, {"name": "chopped nuts", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2022/12/07", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/jpkGOmyUU4RigGubYkWJOoUuZ8c=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/589179_-Aunt-Teens-Creamy-Chocolate-Fudge-Photo-by-Kari-c72df3e77dd6469bb1a4d0e7273034a8.jpg"}
{"title": "Chocolate Pretzels", "description": "Easy-to-make chocolate pretzels topped with candy-coated chocolates for a sweet and salty treat.", "preparation_time_minutes": 10, "cooking_time_minutes": 5, "steps": ["Gather ingredients and preheat the oven to 350 degrees F (175 degrees C).", "Spread pretzels evenly on baking sheets. Unwrap candy kisses and place one in the center of each pretzel.", "Bake for 1 to 2 minutes until kisses melt. Remove from oven and gently press a mini candy-coated chocolate into each melted kiss.", "Chill in the refrigerator until set."], "ingredients": [{"name": "circular pretzels", "quantity": "24"}, {"name": "milk chocolate candy kisses", "quantity": "24"}, {"name": "mini candy-coated chocolates", "quantity": "1.69 ounce"}], "created": "2023/02/17", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/G1GOjUDCPuNnV2Tf_3IR23PofQ0=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/21169-chocolate-pretzels-VAT-hero-4x3-1-fc847b043f624479931549f7e8aa9036.jpg"}
{"title": "Easy Chocolate Chip Pound Cake", "description": "A rich, moist Bundt cake with chocolate chips and a hint of chocolate pudding.", "preparation_time_minutes": 10, "cooking_time_minutes": 50, "steps": ["Preheat the oven to 325 degrees F (165 degrees C). Grease and flour a 10-inch Bundt pan.", "Stir together cake mix, sugar, and instant pudding in a large bowl. Mix in beaten eggs, sour cream, water, and oil until well blended. Fold in chocolate chips. Pour into the prepared Bundt pan.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 50 to 60 minutes. Cool in the pan for 10 minutes before inverting onto a wire rack to cool completely.", "Dust cooled cake with confectioners' sugar before serving."], "ingredients": [{"name": "yellow cake mix", "quantity": "15.25 ounces"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "instant chocolate pudding mix", "quantity": "3.9 ounces"}, {"name": "large eggs", "quantity": "4"}, {"name": "sour cream", "quantity": "1 cup"}, {"name": "water", "quantity": "3/4 cup"}, {"name": "vegetable oil", "quantity": "3/4 cup"}, {"name": "milk chocolate chips", "quantity": "1/2 cup"}, {"name": "confectioners' sugar", "quantity": "1/8 cup, for dusting"}], "created": "2023/04/24", "ratings": 4.7, "image_url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F3ceee9961a0652f5493309a494fc6e4f%2F5758144.jpg&q=60&c=sc&poi=auto&orient=true&h=512"}
{"title": "Chocolate Covered Caramels", "description": "These caramels are easy and WONDERFUL for anytime of the year! Everyone loves them! I can't make enough of them. You can omit the chocolate and just have wonderful caramels.", "preparation_time_minutes": 5, "cooking_time_minutes": 25, "steps": ["Grease an 8x8-inch square pan.", "In a heavy 4 quart saucepan melt butter over medium heat; add brown sugar, corn syrup and milk. Stirring constantly, heat to 242 to 248 degrees F (116 to 120 degrees C), or until a small amount of syrup dropped into cold water forms a firm but pliable ball. Remove from heat and stir in vanilla extract. Pour into prepared pan.", "When caramel has cooled and set, cut into 1-inch squares and chill in the refrigerator until firm.", "Melt chocolate and butter in a double boiler or microwave until smooth.", "Dip caramel squares into chocolate and place on wax paper to cool."], "ingredients": [{"name": "butter", "quantity": "1 cup"}, {"name": "brown sugar", "quantity": "2 1/4 cups"}, {"name": "light corn syrup", "quantity": "1 cup"}, {"name": "sweetened condensed milk", "quantity": "14 ounces"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "milk chocolate", "quantity": "1 pound"}, {"name": "butter", "quantity": "1 tablespoon"}], "created": "2022/09/01", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/9azSLKUSpPSLxnmXOE77A7XXKxw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/556040-chocolate-covered-caramels-footballgrl16-4x3-1-8a39e44d26f74c7e9b7fcba5f6148995.jpg"}
{"title": "Chocolate Peanut Butter Cups", "description": "A simple yet decadent treat combining creamy peanut butter with smooth milk chocolate for the ultimate indulgence.", "preparation_time_minutes": 120, "cooking_time_minutes": 60, "steps": ["Trim 12 paper muffin cup liners to half their height.", "Place 1/2 of the chocolate chips in a microwave-safe container and microwave for 2 minutes, stirring after each minute. Spoon melted chocolate into muffin cups, filling halfway. Draw the chocolate up the sides of the cups until evenly coated. Cool in the refrigerator until firm.", "In a small bowl, mix peanut butter, confectioners' sugar, and salt. Divide the mixture into the chocolate cups. Melt the remaining chocolate and spoon over the peanut butter, spreading it to the edges of the cups."], "ingredients": [{"name": "milk chocolate chips", "quantity": "11.5 ounces"}, {"name": "peanut butter", "quantity": "1 cup"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "confectioners' sugar", "quantity": "1/2 cup"}], "created": "2023/02/13", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/WwI6IRKcbJN11AXWNFty0w8nITQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/411529-chocolate-peanut-butter-cups-Sara-4x3-1-861a3262edfe4774994034b87fddba73.jpg"}
{"title": "Fudge Puddles", "description": "Chocolate-filled deliciousness in these fun fudge puddles!", "preparation_time_minutes": 15, "cooking_time_minutes": 15, "steps": ["Preheat the oven to 325 degrees F (165 degrees C).", "Sift together flour, baking soda, and salt.", "Cream together butter, peanut butter, white sugar, and brown sugar. Mix in egg and 1/2 teaspoon vanilla extract. Stir in the flour mixture until well combined. Shape the dough into 48 one-inch balls and place each ball in a compartment of a mini muffin tin.", "For the filling, melt milk chocolate chips in a double boiler with sweetened condensed milk and 1 teaspoon vanilla.", "Bake for 14-16 minutes or until lightly browned. Remove from the oven and immediately create wells in the center of each cookie using a melon baller.", "Cool in the pan for 5 minutes, then carefully remove to a wire rack. Fill each well with the chocolate mixture and top with a pecan half."], "ingredients": [{"name": "butter", "quantity": "1/2 cup, softened"}, {"name": "creamy peanut butter", "quantity": "1/2 cup"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "brown sugar", "quantity": "1/2 cup"}, {"name": "egg", "quantity": "1"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon, plus 1 teaspoon for filling"}, {"name": "all-purpose flour", "quantity": "1 1/4 cups"}, {"name": "baking soda", "quantity": "3/4 teaspoon"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "milk chocolate chips", "quantity": "1 cup"}, {"name": "semi-sweet chocolate chips", "quantity": "1 cup"}, {"name": "sweetened condensed milk", "quantity": "14-ounces"}, {"name": "pecan halves", "quantity": "3/4 cup"}], "created": "2023/01/07", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/AmbLWmEv5fpnZvf0cJJmNJrWRQM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/530188-fudge-puddles-lindsaybjorn-1x1-1-5eb59c153b574becb4ac26cc6488540c.jpg"}
{"title": "Vanilla and Chocolate Delight", "description": "A layer of pecans, topped with cream cheese and whipped topping, is topped with vanilla-chocolate pudding to make this chocolate delight dessert!", "preparation_time_minutes": 20, "cooking_time_minutes": 25, "steps": ["Preheat the oven to 400 degrees F (200 degrees C). In a medium mixing bowl, combine pecans, flour, and butter. Press into a 9x13-inch pan. Bake for 25 minutes. Allow to cool.", "In a large bowl, beat cream cheese and confectioners' sugar until smooth. Fold in half of the whipped topping and spread on top of cooled crust.", "In another bowl, combine milk, chocolate pudding mix, and vanilla pudding mix. Beat until thick. Pour over the cream cheese layer. Top with the remaining whipped topping and sprinkle with crumbled chocolate bars."], "ingredients": [{"name": "finely chopped pecans", "quantity": "1 cup"}, {"name": "all-purpose flour", "quantity": "1 cup"}, {"name": "butter", "quantity": "1/2 cup"}, {"name": "cream cheese", "quantity": "8 ounces"}, {"name": "confectioners' sugar", "quantity": "1 cup"}, {"name": "frozen whipped topping", "quantity": "16-ounces"}, {"name": "milk", "quantity": "3 cups"}, {"name": "instant chocolate pudding mix", "quantity": "3.9 ounces"}, {"name": "instant vanilla pudding mix", "quantity": "1 3.4 ounces"}, {"name": "milk chocolate with crispy rice bars", "quantity": "1.45-ounces"}], "created": "2023/01/06", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/Gly-BugB8103CmuwFYSnVV3lMoo=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/882699-vanilla-and-chocolate-delight-Paula-4x3-1-e7946ac8c72d4a3a80fa8d80611fa807.jpg"}
{"title": "Chocolate Chip Cheesecake", "description": "This is the best chocolate chip cheesecake I've ever had. People have offered to pay me to make these for them during the holidays!", "preparation_time_minutes": 20, "cooking_time_minutes": 60, "steps": ["Preheat the oven to 300 degrees F (150 degrees C).", "Make the crust by mixing graham cracker crumbs, sugar, cocoa, and melted butter. Press into the bottom and up the sides of a 9-inch springform pan.", "For the cheesecake filling, beat cream cheese until smooth, then add sweetened condensed milk and beat well.", "Add eggs and vanilla, and beat on medium speed until smooth.", "Toss 1/3 of the chocolate chips with flour to coat, then mix them into the cheesecake batter.", "Pour batter into the prepared crust and sprinkle the top with the remaining chocolate chips.", "Bake for 1 hour, then turn off the oven and let the cake cool in the oven (with the door closed) for another hour.", "Remove from oven and cool completely. Refrigerate before removing the sides of the pan and serve cold."], "ingredients": [{"name": "graham cracker crumbs", "quantity": "1 1/2 cups"}, {"name": "white sugar", "quantity": "1/3 cup"}, {"name": "unsweetened cocoa powder", "quantity": "1/3 cup"}, {"name": "butter", "quantity": "1/3 cup"}, {"name": "cream cheese", "quantity": "8 ounces"}, {"name": "sweetened condensed milk", "quantity": "14 ounces"}, {"name": "eggs", "quantity": "3"}, {"name": "vanilla extract", "quantity": "2 teaspoons"}, {"name": "mini semisweet chocolate chips", "quantity": "1 cup"}, {"name": "all-purpose flour", "quantity": "1 teaspoon"}], "created": "2022/11/04", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/WbiVo-ow18p8RckM0UWGhDFXxyM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/15058-chocolate-chip-cheesecake-i-nataliet-1x1-1-2000-fc0070d08ca54a48bc9ad7fc5f6f3cf5.jpg"}
{"title": "Royal Icing", "description": "This royal icing recipe is a sweet white icing made with two main ingredients: pasteurized egg whites and confectioners' sugar. The icing dries quickly making it perfect for decorating gingerbread houses and holiday cut-out cookies.", "preparation_time_minutes": 10, "cooking_time_minutes": 60, "steps": ["Gather all ingredients.", "Beat egg whites in a large bowl at high speed until foamy.", "Gradually add sifted confectioners' sugar and lemon or vanilla extract, continuing to beat until thickened.", "Use immediately to pipe or decorate cookies."], "ingredients": [{"name": "pasteurized egg whites", "quantity": "4"}, {"name": "confectioners' sugar", "quantity": "4 cups"}, {"name": "lemon or vanilla extract", "quantity": "1 teaspoon"}], "created": "2024/11/07", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/rPnn5nCW2yOGOWu9vFbJW6biIC8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/6132383_RoyalIcing4x3winter-d1f5810023ce4043a69b0e44bac097d6.jpg"}
{"title": "Sugar Cookie Icing", "description": "This sugar cookie icing dries hard and shiny and the colors stay bright. Choose as many different food colorings as you desire. This recipe makes enough icing to decorate a dozen sugar cookies.", "preparation_time_minutes": 10, "cooking_time_minutes": 60, "steps": ["Gather all ingredients.", "Stir together confectioners' sugar and milk in a small bowl until smooth.", "Beat in corn syrup and almond extract until icing is smooth and glossy.", "If icing is too thick, add more corn syrup.", "Divide icing into separate bowls and add food coloring to desired intensity.", "Dip cookies or paint them with a brush."], "ingredients": [{"name": "confectioners' sugar", "quantity": "1 cup"}, {"name": "milk", "quantity": "2 teaspoons"}, {"name": "light corn syrup", "quantity": "2 teaspoons"}, {"name": "almond extract", "quantity": "1/4 teaspoon"}, {"name": "assorted food coloring", "quantity": "as desired"}], "created": "2024/10/08", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/IikFVoy5STPpHU_Y1xoT5kqJeUo=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/1052450_Sugar-Cookie-Icing-4x3-1-56e26180c1fb440198a469a0fc90f876.jpg"}
{"title": "Homemade Whipped Cream", "description": "This whipped cream recipe shows you how to make sweetened whipped cream that holds its shape. For best results make sure the whisk and bowl are ice cold.", "preparation_time_minutes": 5, "cooking_time_minutes": 5, "steps": ["Gather all ingredients.", "Whisk cream in a chilled glass or metal bowl with an electric mixer until frothy.", "Add confectioners' sugar and vanilla; continue to beat until soft peaks form.", "Enjoy!"], "ingredients": [{"name": "heavy cream", "quantity": "1 cup"}, {"name": "confectioners' sugar", "quantity": "1 tablespoon"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2024/09/26", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/uvQ0ex4_ewG3Uctx_7NUGAR69_E=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/AR-18352-whipped-cream-ddmfs-beauty-4x3-8b9816a1ad6f4b1aaebc2ecf2a03f408.jpg"}
{"title": "Quick and Almost-Professional Buttercream Icing", "description": "After failing to find the perfect recipe for buttercream frosting, I found one that worked for me and then added my own two cents.", "preparation_time_minutes": 10, "cooking_time_minutes": 10, "steps": ["Gather the ingredients.", "Cream butter in the bowl of a stand mixer fitted with the paddle attachment until smooth and fluffy.", "Gradually beat in confectioners' sugar until fully incorporated.", "Beat in vanilla extract.", "Add milk and beat for an additional 3 to 4 minutes.", "Add food coloring, if using, and beat for thirty seconds until smooth or until desired color is reached.", "Use immediately or store buttercream in an airtight container at room temperature for up to three days."], "ingredients": [{"name": "unsalted butter", "quantity": "1/2 cup"}, {"name": "confectioners' sugar", "quantity": "2 cups"}, {"name": "pure vanilla extract", "quantity": "1 1/2 teaspoons"}, {"name": "milk", "quantity": "2 tablespoons"}, {"name": "food coloring", "quantity": "3 drops"}], "created": "2023/11/12", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/y1TBF8az7Vo_PuWRNpnkbPZkUR0=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/174347-quick-and-almosy-professional-buttercream-icing-ddmfs-beauty-4x3-4fe9622e00ab4a66a22db65fc73715b8.jpg"}
{"title": "Chocolate Ganache", "description": "Chocolate ganache is a mixture of cream and chocolate that has lots of uses with homemade baked goods. Perfect for cakes, truffles, and pastries, this deliciously rich topping can be used as a filling, frosting, or glaze.", "preparation_time_minutes": 5, "cooking_time_minutes": 5, "steps": ["Gather all ingredients.", "Place chocolate in a medium mixing bowl.", "Heat cream in a small saucepan over medium heat. Bring just to a boil, watching carefully to avoid overflowing.", "As soon as the cream comes to a boil, pour it over the chocolate in the mixing bowl. Whisk until chocolate has melted and the mixture is smooth, then stir in rum (if using).", "To use ganache as a cake glaze, cool slightly (5 to 10 minutes), then pour it onto the cake starting at the center and working outward.", "For a fluffy frosting or chocolate filling, allow ganache to cool until thick (up to 1 hour in the refrigerator), then whip until light and fluffy. Apply with a spatula as a conventional frosting."], "ingredients": [{"name": "bittersweet chocolate", "quantity": "9 ounces"}, {"name": "heavy cream", "quantity": "1 cup"}, {"name": "dark rum", "quantity": "1 tablespoon"}], "created": "2023/11/13", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/A0VKw3P_Dg-4vOkoMjElkk4qe_E=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/33647-chocolate-ganache-DDMFS-4x3-c9c937b06ac2481fb5529e56494ecca2.jpg"}
{"title": "Whipped Cream Cream Cheese Frosting", "description": "This whipped cream cheese frosting is so decadent everyone will be asking if they can lick the bowl! It pipes very well.", "preparation_time_minutes": 15, "cooking_time_minutes": 5, "steps": ["Beat whipping cream in a mixing bowl until stiff peaks form; set aside.", "Combine cream cheese, sugar, salt, and vanilla in a large bowl. Beat until smooth, then fold in whipped cream."], "ingredients": [{"name": "heavy whipping cream", "quantity": "1 1/2 cups"}, {"name": "cream cheese", "quantity": "8 ounces"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "salt", "quantity": "1/8 teaspoon"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2022/12/18", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/7Ay4dwAExRYN6ymtpjpPez2FV2E=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7856595-whipped-cream-cream-cheese-frosting-Catarina-Lewis-1x1-1-19ab4858c7f8476b80f58a3e9be6dd9a.jpg"}
{"title": "One Minute Chocolate Icing", "description": "Make chocolate frosting without powdered sugar with this boiled fudge-like icing. Spread icing on a completely cooled cake.", "preparation_time_minutes": 5, "cooking_time_minutes": 10, "steps": ["Combine sugar, cocoa powder, milk, butter, and vanilla in a saucepan. Bring to a rolling boil, stirring constantly; cook for 1 minute. Remove from heat.", "Beat icing with an electric mixer until mixture cools and thickens to spreading consistency, about 3 minutes."], "ingredients": [{"name": "white sugar", "quantity": "1 cup"}, {"name": "unsweetened cocoa powder", "quantity": "1/2 cup"}, {"name": "milk", "quantity": "1/4 cup"}, {"name": "butter", "quantity": "1/4 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2022/09/23", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/GCuhdsECVgkbpItSiokdSTpn0zo=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/23392_One-Minute-Chocolate-Icing_Joi-Brown_5437689_original-4x3-1-18c6d90910674560b833c0cac9bffed9.jpg"}
{"title": "Satiny Chocolate Glaze", "description": "Satiny chocolate drizzle for a Bundt cake. It's also great on cookies and doughnuts.", "preparation_time_minutes": 5, "cooking_time_minutes": 10, "steps": ["Gather all ingredients.", "Combine chocolate chips, butter, and corn syrup in a double boiler over hot, but not boiling water.", "Gently stir until chocolate is melted and mixture is smooth, then add vanilla.", "To use, spread warm glaze over top of your cooled cake, letting it drizzle down the sides."], "ingredients": [{"name": "semisweet chocolate chips", "quantity": "3/4 cup"}, {"name": "butter", "quantity": "3 tablespoons"}, {"name": "light corn syrup", "quantity": "1 tablespoon"}, {"name": "vanilla extract", "quantity": "1/4 teaspoon"}], "created": "2024-06-25", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/jLdPpLqZfv5itqtinAkcWRZkD_o=/0x512/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/AR-8236-satiny-chocolate-glaze-DDMFS-4x3-42611f2f30b84071a058bf092275c209.jpg"}
{"title": "Real Strawberry Frosting", "description": "This strawberry frosting has an intense strawberry taste without using extract or gelatin. I wanted real strawberry frosting for my real strawberry cupcakes and could not find an acceptable recipe. I came up with this recipe using a strawberry puree reduction that is truly the strawberry-est. If you love strawberries, you'll love this!", "preparation_time_minutes": 20, "cooking_time_minutes": 20, "steps": ["Place strawberries in a blender; puree until smooth.", "Transfer strawberry puree to a saucepan over medium heat; bring to a boil, stirring often, until reduced by at least half, about 20 minutes. Remove from heat and cool completely.", "Beat butter with an electric mixer in a bowl until light and fluffy. Beat in 1 cup confectioners' sugar until combined.", "Beat 2 tablespoons cooled strawberry puree and vanilla extract into butter mixture until just blended.", "Beat in 1 cup confectioners' sugar until combined, followed by 2 tablespoons strawberry puree. Repeat this step once more.", "Beat remaining 1/2 cup confectioners' sugar into mixture until just blended."], "ingredients": [{"name": "fresh strawberries", "quantity": "1 cup"}, {"name": "butter", "quantity": "1 cup"}, {"name": "confectioners' sugar, sifted", "quantity": "3 1/2 cups"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2024-01-10", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/IEGx9UhjdoQdswyKvML9ywkAEEo=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/5154435-real-strawberry-frosting-AllrecipesPhoto-4x3-1-5667bc53a03c494d89823d88f763324f.jpg"}
{"title": "Quick Keto Chocolate Mousse", "description": "This keto chocolate mousse is perfect when a sweet craving hits. It's so quick it will be ready in no time. No need to pre-whip the heavy cream just throw everything into a bowl and mix! Use any keto-friendly granular sweetener that measures like sugar. Adjust cocoa powder and sweetener amounts to suit your tastes. This is quite rich, so you don't need a lot to feel satisfied.", "preparation_time_minutes": 10, "cooking_time_minutes": 60, "steps": ["Beat cream cheese in a large bowl with an electric mixer until light and fluffy.", "Turn mixer to low speed and slowly mix in heavy cream and vanilla extract.", "Add the powdered sweetener, cocoa powder, and salt; mix until fully incorporated.", "Turn the mixer to high and mix until the mixture becomes light and fluffy, about 1 to 2 minutes more.", "Serve immediately, or refrigerate for later."], "ingredients": [{"name": "cream cheese", "quantity": "3 ounces, softened"}, {"name": "heavy cream", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "powdered zero-calorie sweetener (e.g., Swerve)", "quantity": "1/4 cup"}, {"name": "cocoa powder", "quantity": "2 tablespoons"}, {"name": "salt", "quantity": "1 pinch"}], "created": "2023/11/11", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/JK-l_hSaKU7klsdsMkpmV9mL1vM=/0x512/filters:no_upscale():max_bytes(150000):strip_icc()/270598-quick-keto-chocolate-mousse-FRANCEC-4x3-0ede43ded02b4e4d8d7a9f9e81970da5.jpg"}
{"title": "Easy Lemon Mousse", "description": "This lemon mousse recipe is quick and easy to make with lemon curd, whipped cream, and cream cheese. Served with fresh berries and a sprig of mint on top for a gorgeous summer dessert.", "preparation_time_minutes": 10, "cooking_time_minutes": 60, "steps": ["Beat heavy cream in a chilled glass or metal bowl with an electric mixer until frothy. Gradually add confectioners' sugar, continuing to beat until stiff peaks form, starting on low speed and increasing to high speed, for about 2 minutes; set aside.", "Beat cream cheese in a bowl with an electric mixer until lump-free, 1 to 2 minutes. Add the lemon curd and vanilla extract and mix until smooth and creamy, 1 to 2 minutes.", "Fold whipped cream into the lemon mixture until just combined. Divide mousse equally among 4 dessert dishes or ramekins.", "Chill for at least 1 hour before serving.", "Garnish with fresh berries and mint leaves."], "ingredients": [{"name": "heavy cream", "quantity": "1/2 cup"}, {"name": "confectioners' sugar", "quantity": "1 tablespoon"}, {"name": "cream cheese", "quantity": "1 (4 ounce) package, softened"}, {"name": "lemon curd", "quantity": "1 1/2 cups"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "mixed fresh berries", "quantity": "4 tablespoons"}, {"name": "fresh mint leaves", "quantity": "4"}], "created": "2023/04/19", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/r6rlWcJq4WLf2Hbdcj_hBgEeDk8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/Easy-Lemon-Mousse-311d126339df4addb2356cd923477e71.jpg"}
{"title": "Chocolate Mousse", "description": "This easy chocolate mousse recipe is made in a blender with just three ingredients. It's light, fluffy, and very tasty!", "preparation_time_minutes": 15, "cooking_time_minutes": 60, "steps": ["Place chocolate chips in a blender; pulse until ground. Add boiling water and blend until chocolate is melted. Add egg yolks, one at a time, blending well after each addition; transfer to a mixing bowl.", "Beat egg whites in a glass, metal, or ceramic bowl until stiff peaks form. Gently fold egg whites into chocolate mixture.", "Pour mousse into wine glasses or other serving glasses and chill in the refrigerator until set, 2 to 3 hours."], "ingredients": [{"name": "semisweet chocolate chips", "quantity": "1 cup"}, {"name": "boiling water", "quantity": "5 tablespoons"}, {"name": "large eggs, separated, divided", "quantity": "4"}], "created": "2022/12/05", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/BbHmHTQrIAyrwwPHlRhonA1K7ME=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/802464-14789d85bc834bb294ee6cdb775e715b.jpg"}
{"title": "Quick and Easy Pumpkin Mousse", "description": "This creamy pumpkin mousse with marshmallows and pumpkin pie spice is sweet and fluffy. It's easy to make for a fun treat around the holidays. Pour into chocolate shells for an elegant touch or serve with ginger cookies for dipping.", "preparation_time_minutes": 5, "cooking_time_minutes": 10, "steps": ["Melt butter in a large skillet; stir in marshmallows, milk, and pumpkin. Stir frequently until melted and smooth. Remove from heat; stir in vanilla and pumpkin pie spice. Cool completely, about 30 minutes.", "Combine 1/3 cup confectioners' sugar and 1 cup heavy cream in a large bowl. Use an electric mixer to beat until stiff peaks form. Fold whipped cream into cooled pumpkin mixture.", "Pour mousse into ramekins or chocolate shells. Cover and refrigerate until firm, about 2 hours."], "ingredients": [{"name": "butter", "quantity": "1 tablespoon"}, {"name": "marshmallows", "quantity": "24"}, {"name": "milk", "quantity": "1/2 cup"}, {"name": "canned pumpkin", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "pumpkin pie spice", "quantity": "1 teaspoon"}, {"name": "confectioners' sugar", "quantity": "1/3 cup"}, {"name": "heavy cream", "quantity": "1 cup"}], "created": "2024/10/24", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/e_hy9IOmq0s-cLuCQf2XB53hHgE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/2668601-ee18be5b5dcc4600806f7cfe9ad350cd.jpg"}
{"title": "Easy Faux Chocolate Mousse", "description": "This is a quick recipe for a faux mascarpone 'mousse' that tricks the eyes and palate into thinking it's an authentic chocolate mousse made with eggs.", "preparation_time_minutes": 10, "cooking_time_minutes": 5, "steps": ["Mix mascarpone cheese, whipping cream, and vanilla together in a bowl.", "Melt chocolate chips in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching.", "Fold melted chocolate into mascarpone cheese mixture. Refrigerate until set, 1 to 2 hours."], "ingredients": [{"name": "mascarpone cheese", "quantity": "1 (8 ounce) container"}, {"name": "heavy whipping cream", "quantity": "2 tablespoons"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "chocolate chips", "quantity": "1/4 cup"}], "created": "2023/09/27", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/oUPXaRomjSgVPhyYiZx_BsvU_mI=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/9323087-98e91318d1984531ba3c4bd8674634aa.jpg"}
{"title": "Chocolate Mousse for Beginners", "description": "This chocolate mousse for beginners is the all-time easiest method, perfect for beginners, but even experts may want to pay attention, because this technique produces the most delicious, most perfectly-textured mousse I've ever had.", "preparation_time_minutes": 20, "cooking_time_minutes": 5, "steps": ["Break up or chop chocolate into small pieces and set aside with butter.", "Add egg yolks, sugar, water, and salt to a metal mixing bowl. Cook, whisking, directly over medium-low heat until the mixture is thick, foamy, and hot to the touch (145 to 150 degrees F (63 to 65 degrees C)).", "Once the yolk mixture is thick and hot, add chocolate and butter, and whisk until all chocolate is melted. Let rest for a few minutes on the counter, whisking occasionally to further cool the mixture to just above or at room temperature.", "Whisk cold cream until medium stiff peaks form. If cream is whisked further, it will separate and the final texture will be grainy.", "Transfer about 1/3 of chocolate mixture into whipped cream, and fold with a spatula until almost incorporated. Gently fold in remaining chocolate, trying to keep as much air in the mixture as possible.", "Transfer into 4 serving dishes, wrap, and chill before serving, at least 1 hour."], "ingredients": [{"name": "dark chocolate (62% cacao is ideal)", "quantity": "3 1/2 ounces"}, {"name": "unsalted butter", "quantity": "1 tablespoon"}, {"name": "large egg yolks", "quantity": "2"}, {"name": "white sugar", "quantity": "1 tablespoon"}, {"name": "water", "quantity": "1/4 cup"}, {"name": "salt", "quantity": "1 tiny pinch"}, {"name": "chilled heavy whipping cream", "quantity": "1/2 cup"}], "created": "2024/03/12", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/Eia6WxZaHpwpvqgJOq-KaC19NkE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/IMG_8145_Chocolate-Mousse-for-Beginners-4x3-cropped-757ae43035ff48cc8bc9ccffbd6cf3b7.jpg"}
{"title": "Cocoa Powder Chocolate Mousse", "description": "This mousse served in shot glasses is perfect for when you're craving something sweet but just want a small portion. You can enjoy them as soon as you make them, or you can chill them in the fridge for a cooler dessert.", "preparation_time_minutes": 10, "cooking_time_minutes": 60, "steps": ["Combine heavy whipping cream, cocoa powder, powdered sugar, vanilla extract, and salt in a large bowl and beat with an electric mixer until stiff peaks form.", "Pipe mousse into 6 shot glasses. Serve immediately or chill until serving."], "ingredients": [{"name": "heavy whipping cream", "quantity": "1/2 cup"}, {"name": "unsweetened cocoa powder", "quantity": "2 tablespoons"}, {"name": "powdered sugar", "quantity": "2 tablespoons"}, {"name": "vanilla extract", "quantity": "1/4 teaspoon"}, {"name": "salt", "quantity": "1 pinch"}], "created": "2021/01/21", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/TQcQk1mNb9NlEixLEPvd78qesck=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/9058701-ec58d0b436ed4dba9e20bdd566db509e.jpg"}
{"title": "Chef John's Dark Chocolate Mousse", "description": "This has a pinch of chile pepper as the secret ingredient. It's firm yet unbelievably light and airy. The little bit of chile pepper is in there just to bring out the flavor of the chocolate and add a tiny bit of delicious heat. Garnish each serving with a dollop of whipped cream and a sprinkle of shaved chocolate.", "preparation_time_minutes": 20, "cooking_time_minutes": 5, "steps": ["Bring a saucepan of water to a simmer over low heat. Place chocolate, butter, 2 tablespoons water, ground chipotle pepper, and salt in a heatproof bowl; set bowl over the simmering water. When the butter melts, whisk the chocolate mixture gently until smooth and shiny. Set aside to cool for a few minutes.", "Whisk egg yolks, 2 tablespoons water, and sugar in another heatproof bowl over the same pan of simmering water until egg yolk mixture is foamy and hot to the touch, about 3 minutes. Pour hot egg mixture into warm chocolate mixture, whisk until smooth, and set over a bowl of ice to chill. Whisk constantly until mixture has cooled to room temperature or slightly cooler.", "Pour 1/2 cup and 1 tablespoon cold cream into a chilled metal bowl; whisk until cream holds soft peaks. Place about half the whipped cream into the cooled chocolate mixture; gently fold the cream into the chocolate. Repeat with remaining half of whipped cream, folding gently until nearly all the streaks have disappeared.", "Divide mousse into 4 6-ounce ramekins. Cover each ramekin with plastic wrap and refrigerate at least 4 hours (up to overnight) before serving."], "ingredients": [{"name": "dark chocolate, chopped", "quantity": "3 1/2 ounces"}, {"name": "butter", "quantity": "1 tablespoon"}, {"name": "water", "quantity": "2 tablespoons"}, {"name": "ground dried chipotle pepper", "quantity": "1/8 teaspoon"}, {"name": "salt", "quantity": "1 tiny pinch"}, {"name": "large egg yolks", "quantity": "2"}, {"name": "white sugar", "quantity": "1 tablespoon"}, {"name": "heavy whipping cream, chilled", "quantity": "1/2 cup"}, {"name": "heavy whipping cream, chilled", "quantity": "1 tablespoon"}], "created": "2022/11/28", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/BTaO5PW6BqL5-X6niFKrlpNp-Js=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/5101485-313a52fcad59430589c06662aeafd8c7.jpg"}
{"title": "Brazilian Passion Fruit Mousse (Maracuja)", "description": "This is a Brazilian favorite (and an old family recipe) that takes no cooking at all. It's a little tart and tangy for those who don't like their desserts too sweet.", "preparation_time_minutes": 15, "cooking_time_minutes": 60, "steps": ["Break passion fruits in half, and empty contents into a bowl. Use a little water to help rinse the juice out of the skins. Mix with hands to soften pulp. Strain through a sieve or cheesecloth.", "Stir in sugar and sweetened condensed milk.", "In a chilled bowl, beat cream until stiff peaks form.", "Fold 1/3 of the cream into the passion fruit mixture, then quickly fold in remaining cream until no streaks remain.", "Refrigerate for 1 hour."], "ingredients": [{"name": "passion fruits", "quantity": "8"}, {"name": "white sugar", "quantity": "1 tablespoon"}, {"name": "sweetened condensed milk", "quantity": "1 (14 ounce) can"}, {"name": "cream", "quantity": "2 cups"}], "created": "2022/12/08", "ratings": 4.3, "image_url": "https://www.allrecipes.com/thmb/ZtwFBAtASzdF3JJgDxLlQXuyYtE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/47436-brazilian-passion-fruit-mousse-maracuja-DDMFS-4x3-1-260f5b65cf144367a92476019d5e4594.jpg"}
{"title": "Strawberry Chocolate Mousse Cake", "description": "Fresh strawberries and chocolate mousse make this strawberry chocolate mousse cake an appealing treat.", "preparation_time_minutes": 45, "cooking_time_minutes": 1, "steps": ["In a bowl, mix crumbs and melted butter to blend thoroughly. Press evenly onto the bottom of a 9-inch springform pan. Arrange some strawberry halves around the pan side-by-side, pointed tips up, with cut sides against the ring of the pan; set aside.", "Place chocolate chips in a blender. Pour water and corn syrup into a small saucepan. Bring to a boil and simmer for 1 minute. Immediately pour over chocolate chips and blend until smooth. Pour into a mixing bowl and cool to room temperature.", "While chocolate cools, whip 1 1/2 cups cream to form stiff peaks. Use a rubber spatula or large whisk to fold 1/3 of the whipped cream into the cooled chocolate to lighten it. Gently fold in remaining whipped cream until mousse is thoroughly blended.", "Transfer mousse into the prepared pan and smooth the top. The tips of the strawberries might extend above chocolate mixture. Cover with plastic wrap and refrigerate for 4 to 24 hours.", "Up to 2 hours before serving, in a medium mixing bowl, beat remaining 1/2 cup cream to form soft peaks. Add sugar. Beat to form stiff peaks.", "Remove the ring of the springform pan and place cake on a serving plate. Pipe or dollop whipped cream onto the top of cake. Arrange remaining halved strawberries on whipped cream. To serve, cut into wedges with a thin knife, wiping the blade between cuts."], "ingredients": [{"name": "chocolate cookie crumbs", "quantity": "1 cup"}, {"name": "butter, melted", "quantity": "3 tablespoons"}, {"name": "halved fresh strawberries, divided", "quantity": "2 pints"}, {"name": "semisweet chocolate chips", "quantity": "2 cups"}, {"name": "water", "quantity": "1/2 cup"}, {"name": "light corn syrup", "quantity": "2 tablespoons"}, {"name": "heavy cream, divided", "quantity": "2 1/2 cups"}, {"name": "white sugar", "quantity": "1 tablespoon"}], "created": "2023/02/05", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/cT3jDtfu2S6d6Df4Q_FfMk5AstI=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/4570010-strawberry-chocolate-mousse-cake-Lulu-4x3-1-56537fc70fe34912ab7f5150819f2bfe.jpg"}
{"title": "French Chocolate Mousse with Orange", "description": "A traditional chocolate mousse with a hint of orange flavor. This luxurious dairy-free and low-carb mousse is made simply with eggs and chocolate. Omit the orange zest for a plain chocolate mousse.", "preparation_time_minutes": 20, "cooking_time_minutes": 10, "steps": ["Grind orange zest using a mortar and pestle until it forms a smooth paste.", "Combine chocolate, coffee, and orange zest in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes. Stir until smooth and remove from heat. Allow to cool slightly.", "Beat egg whites and salt in a glass, metal, or ceramic bowl until stiff peaks form.", "Add egg yolks to the slightly cooled chocolate mixture and stir until well combined. Pour over egg whites. Carefully fold together using a spatula until just combined.", "Pour mixture into 10 small dessert glasses or 1 large serving dish. Refrigerate at least 6 hours to overnight."], "ingredients": [{"name": "orange, zested", "quantity": "1"}, {"name": "dark chocolate (65 to 70% cocao), chopped into small pieces", "quantity": "7 ounces"}, {"name": "strong brewed coffee", "quantity": "2 tablespoons"}, {"name": "eggs, separated, room temperature", "quantity": "6"}, {"name": "salt", "quantity": "1 pinch"}], "created": "2022/08/22", "ratings": 4.1, "image_url": "https://www.allrecipes.com/thmb/Nvlw-EtuubR8lIpj4j38MRFcQW8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/5720505-20e4a9316f5c4239a013ef65e13c032d.jpg"}
{"title": "Raspberry Mousse", "description": "I make this raspberry mousse every year when raspberries are in season. You want to use ripe, sweet berries. Adjust sugar amount accordingly.", "preparation_time_minutes": 20, "cooking_time_minutes": 5, "steps": ["Set a few raspberries aside for garnish. Combine remaining raspberries and confectioners' sugar in a bowl, mix, and set aside for 30 minutes. Pass raspberries through a sieve to strain out seeds. Discard seeds.", "Pour orange juice into a small saucepan and sprinkle gelatin on top. Set aside for 1 minute. Heat over low temperature without boiling until gelatin is fully dissolved, about 3 minutes.", "Remove from the stove, allow to cool slightly, then mix with raspberry puree.", "Beat cream in a chilled glass or metal bowl using an electric mixer until frothy. Add vanilla sugar gradually, continuing to beat until soft peaks form. Fold whipped cream into raspberry puee. Stir in lemon juice and sweeten with more confectioners' sugar if desired.", "Cover and refrigerate for 2 hours. Garnish with the reserved raspberries."], "ingredients": [{"name": "fresh raspberries", "quantity": "18 ounces"}, {"name": "confectioners' sugar", "quantity": "7 tablespoons"}, {"name": "orange juice", "quantity": "4 tablespoons"}, {"name": "unflavored gelatin", "quantity": "1 (.25 ounce) package"}, {"name": "heavy cream", "quantity": "1 3/4 cups"}, {"name": "vanilla sugar", "quantity": "2 tablespoons"}, {"name": "lemon juice", "quantity": "1 dash"}], "created": "2023/03/29", "ratings": 4.9, "image_url": "https://www.allrecipes.com/thmb/QsCCIYy1iGciyMvEuI1iJBDNkyQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/6552480-30c0ce7394d94c24ad5b49be415b01e8.jpg"}
{"title": "Healthy Peanut Butter Mousse", "description": "I whipped this up after school one day when I wanted peanut butter and a healthy snack. There are many other toppings that can be used with this such as Nutella, extra peanut butter, granola, fruit, oats, graham crackers, cookies, or cereal. The possibilities are endless!", "preparation_time_minutes": 5, "cooking_time_minutes": 1, "steps": ["Microwave peanut butter in a microwave-safe bowl until liquid and smooth, about 20 seconds.", "Stir Greek yogurt into the peanut butter with a spoon until smooth, scraping off any peanut butter stuck to the spoon. Stir in stevia and vanilla extract. Fold in chocolate chips."], "ingredients": [{"name": "peanut butter", "quantity": "2 tablespoons"}, {"name": "plain Greek yogurt", "quantity": "1/4 cup"}, {"name": "stevia brown sugar blend", "quantity": "1/2 teaspoon"}, {"name": "vanilla extract", "quantity": "1/8 teaspoon"}, {"name": "chocolate chips", "quantity": "1 tablespoon"}], "created": "2022/01/11", "ratings": 4.3, "image_url": "https://www.allrecipes.com/thmb/2L8SU1dXnbD99G_OUOReDT9H8Ck=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/4453566-87b196742fb54c378006dd4e790afdc9.jpg"}
{"title": "Ultimate Irish Cream Chocolate Mousse", "description": "A creamy chocolate mousse flavored with Irish cream. I really didn't know I could make something so good!", "preparation_time_minutes": 15, "cooking_time_minutes": 5, "steps": ["Melt chocolate in a small saucepan over low heat. Remove from heat and allow to cool.", "Beat egg yolks in a large bowl; stir in cooled melted chocolate and Baileys. Fold in 1/2 of the whipped cream.", "Beat egg whites in a separate bowl until stiff; fold into chocolate mixture.", "Spoon mousse into serving glasses and garnish with remaining whipped cream and chocolate shavings before serving."], "ingredients": [{"name": "dark chocolate, chopped", "quantity": "4 ounces"}, {"name": "large eggs, separated", "quantity": "3"}, {"name": "Baileys Irish cream liqueur", "quantity": "1 tablespoon"}, {"name": "whipped cream", "quantity": "1 cup"}, {"name": "chocolate shavings", "quantity": "to taste"}], "created": "2024/01/16", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/Yg3RqceTY4RjFYBFX2FzdcWqu1E=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/2171568-a80129de75a848e7aee3f9eeb2c71009.jpg"}
{"title": "Tiramisu Chocolate Mousse", "description": "Tiramisu translates to pick-me-up. Considering that this popular Italian dessert is spiked with proven mood-elevators such as coffee, cocoa, sugar, and alcohol, the name seems to fit perfectly.", "preparation_time_minutes": 5, "cooking_time_minutes": 10, "steps": ["Combine espresso and butter in the top of a double boiler over simmering water.", "Place dark chocolate pieces in the espresso mixture; cook without stirring until chocolate starts to melt, about 3 minutes. Whisk chocolate and espresso mixture until well combined. Remove from heat and set aside.", "Combine Marsala, egg yolks, and sugar in a saucepan over medium-low heat, whisking constantly until frothy and thickened, 3 to 5 minutes. Remove from heat.", "Stir mascarpone cheese into marsala mixture.", "Combine chocolate mixture with mascarpone mixture. Cool to room temperature.", "Whip heavy cream in a bowl until soft peaks form, 2 to 3 minutes.", "Fold half of whipped cream into cooled chocolate mixture.", "Fold second half of whipped cream into chocolate mixture. Cover with plastic wrap and chill in refrigerator for at least 2 hours."], "ingredients": [{"name": "brewed espresso", "quantity": "2 tablespoons"}, {"name": "unsalted butter", "quantity": "1 tablespoon"}, {"name": "dark chocolate, broken into small pieces", "quantity": "3 1/2 ounces"}, {"name": "Marsala wine or rum (optional)", "quantity": "2 tablespoons"}, {"name": "egg yolks", "quantity": "2"}, {"name": "white sugar", "quantity": "4 teaspoons"}, {"name": "mascarpone cheese", "quantity": "2 tablespoons"}, {"name": "heavy cream", "quantity": "3/4 cup"}], "created": "2022/01/11", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/pUPDdqwYKWXUdDZHNchm3m4gUj4=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/4568488-844a9224d6f949c283a4fd11a956a0ac.jpg"}
{"title": "Vegan Chocolate Mousse with Aquafaba", "description": "This is a delicious and light chocolate mousse that is simple to make. It's made with canned chickpea liquid but you wouldn't know it. There's no chickpea taste - just fluffy, smooth, chocolate goodness! Top chocolate mousse with chocolate chips, shaved chocolate, raspberries, pistachios, or whatever you like.", "preparation_time_minutes": 20, "cooking_time_minutes": 5, "steps": ["Melt chocolate in top of a double boiler over simmering water, about 5 minutes. Remove from heat and let cool.", "Beat aquafaba in a stand mixer on high speed until firm peaks form, 10 to 15 minutes. Add sugar gradually into the mixture while continuing to beat.", "Fold in cooled chocolate gently.", "Spoon mousse into small glass cups and chill in the refrigerator for at least 4 hours before serving."], "ingredients": [{"name": "vegan dark chocolate chips", "quantity": "3/4 cup"}, {"name": "aquafaba (chickpea water)", "quantity": "3/4 cup"}, {"name": "white sugar", "quantity": "1 tablespoon"}], "created": "2021/04/01", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/rX7kQOM1gNkuluqI8cglfDJiEIU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/9126723-4816adf522164c2a8437f81e4166c21c.jpg"}
{"title": "Creamiest Chocolate Mousse", "description": "This is one of the best chocolate mousses I've ever tried. It's so creamy (o.k. probably extremely fattening but holiday calories never count, do they?). I personally make the mousse without any alcohol added. Garnish with whipped cream and chocolate shavings for an extra special effect.", "preparation_time_minutes": 45, "cooking_time_minutes": 60, "steps": ["Place chocolate in a metal bowl over a pan of simmering water. Stir occasionally until mostly melted, then remove from heat, and stir until smooth. Set aside to cool slightly.", "In a separate bowl, whip heavy cream to medium stiff peaks, but do not allow it to become grainy. Set aside.", "In a separate bowl, whip egg whites with salt until soft peaks form. Sprinkle in the sugar, and continue whipping to medium stiff peaks. Fold in egg yolks and kirschwasser.", "Fold in the melted chocolate until completely incorporated, then fold in whipped cream until evenly blended.", "Spoon into dessert cups, and chill until firm, about 1 hour."], "ingredients": [{"name": "bittersweet chocolate, chopped", "quantity": "7 ounces"}, {"name": "egg yolks, beaten", "quantity": "7"}, {"name": "sugar", "quantity": "2 tablespoons"}, {"name": "salt", "quantity": "1 pinch"}, {"name": "egg white", "quantity": "7"}, {"name": "heavy cream", "quantity": "1 1/4 cups"}, {"name": "kirschwasser (optional)", "quantity": "1 tablespoon"}], "created": "2020/06/18", "ratings": 4.2, "image_url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F16216.jpg&q=60&c=sc&poi=auto&orient=true&h=512"}
{"title": "Chocolate Mousse with Cocoa Powder", "description": "No cooking involved, and it just doesn't get much easier than this for an elegant dessert. I like to pipe the mousse into small shooter glasses for a lovely presentation. Everybody has room for a mini dessert! Chilling the bowl and beaters will result in a better whipped cream.", "preparation_time_minutes": 20, "cooking_time_minutes": 60, "steps": ["Combine cream, 1/2 cup powdered sugar, and cocoa powder in a large chilled bowl. Beat with an electric mixer with chilled beaters until stiff peaks form; set aside.", "Beat whipped cream cheese in a separate bowl until soft. Add 2 tablespoons powdered sugar gradually and beat until well combined. Mix in almond extract and beat until well incorporated.", "Fold the cream cheese mixture into the chocolate whipped cream until both are completely blended.", "Spoon or pipe mousse into small serving dishes. Top with grated chocolate."], "ingredients": [{"name": "heavy cream", "quantity": "1 1/3 cups"}, {"name": "powdered sugar", "quantity": "1/2 cup"}, {"name": "unsweetened cocoa powder", "quantity": "1/3 cup"}, {"name": "Philadelphia Whipped Cream Cheese KFT", "quantity": "2/3 cup"}, {"name": "powdered sugar", "quantity": "2 tablespoons"}, {"name": "almond extract", "quantity": "1/2 teaspoon"}, {"name": "grated chocolate", "quantity": "1 tablespoon"}], "created": "2021/01/21", "ratings": 4.9, "image_url": "https://www.allrecipes.com/thmb/WRgT4oChYur51sgSA7SOo0pp5ro=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/8968167-4337e8878d7649f4a93aef59d1882c28.jpg"}
{"title": "Citrus Mousse", "description": "This is fast and elegant--everyone always thinks it must be a complicated recipe but it's shamefully simple. I don't know why, but I always confess after serving it that it only took a few minutes to make. Either pour it into one bowl or individual serving dishes, and garnish with fresh fruit, such as strawberries or mandarin slices. Try it with pineapple or lime juice in place of the grapefruit, if you like!", "preparation_time_minutes": 15, "cooking_time_minutes": 60, "steps": ["In a large bowl, beat together whipped topping and condensed milk. Gradually beat in lemon and grapefruit juices, until evenly blended.", "Pour the mousse into one bowl or divide it into individual serving dishes. Garnish with fruit, if desired."], "ingredients": [{"name": "frozen whipped topping, thawed", "quantity": "2 (12 ounce) containers"}, {"name": "sweetened condensed milk", "quantity": "1 (14 ounce) can"}, {"name": "lemon juice", "quantity": "1/2 cup"}, {"name": "grapefruit juice", "quantity": "1/2 cup"}, {"name": "mandarin oranges, drained (optional)", "quantity": "1 (15 ounce) can"}], "created": "2022/07/14", "ratings": 4.1, "image_url": "https://www.allrecipes.com/thmb/T8QHsVTOvF_FDaYldd2FewAB5YA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/1010355-44d37e5e72134ce8a89ab55a10f4b02a.jpg"}
{"title": "Lemon Mousse with Berries", "description": "A light and lovely mousse flavored with lemon is topped with fresh berries and an optional mint garnish. Serve it in tall stemmed glasses for an elegant finish.", "preparation_time_minutes": 15, "cooking_time_minutes": 60, "steps": ["Beat cream in medium bowl until stiff peaks form.", "Stir together curd, cream cheese and almond extract in a small bowl until smooth.", "Stir curd mixture into whipped cream until blended.", "Divide mousse into tall stemmed glasses. Divide berries among glasses and garnish with mint, if desired.", "Refrigerate until serving."], "ingredients": [{"name": "heavy cream", "quantity": "1 cup"}, {"name": "Dickinson's Lemon Curd (or any flavor Dickinson's Creme Curd)", "quantity": "1 (10 ounce) jar"}, {"name": "cream cheese, softened", "quantity": "1 (8 ounce) package"}, {"name": "almond extract", "quantity": "1/8 teaspoon"}, {"name": "fresh mixed berries", "quantity": "1 cup"}, {"name": "mint leaves", "quantity": "optional"}], "created": "2022/01/11", "ratings": 4.8, "image_url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9313515.jpg&q=60&c=sc&poi=auto&orient=true&h=512"}
{"title": "Easter Lemon Drop Mousse", "description": "This refreshingly tangy dessert pie is prepared in a 9-inch springform pan. The delicate crust is sweetened with lemon drops, and the light lemony filling is topped with whipping cream sprinkled with lemon drop sugar.", "preparation_time_minutes": 60, "cooking_time_minutes": 60, "steps": ["To prepare the crust, combine the crushed vanilla wafers with the melted butter and 1/4 cup of the finely crushed candy (save the remainder for use as a decoration). Mix well, then press into the bottom of a 9-inch springform pan. Refrigerate while proceeding with the recipe.", "Whisk together egg yolks, lemon juice, lemon zest, and 2 tablespoons of sugar until smooth, then set aside. In a separate bowl, beat the egg whites until foamy. Sprinkle in the cream of tartar and continue whipping until soft peaks form. Gradually add 3/4 cups of sugar while continuing to whip to stiff peaks.", "Fold the egg yolk mixture into the egg whites, then gently fold in the whipped cream until no streaks remain. Spoon this mixture into the chilled crust, and place into the freezer.", "Whip the remaining 1/2 cup of whipping cream until it starts to thicken, then gradually add 3 tablespoons of light corn syrup, and continue beating until stiff. Using a pastry bag, pipe the whipped cream onto the mousse in a decorative pattern. Sprinkle the top with the reserved crushed lemon drop candy. Freeze for at least 8 hours before serving."], "ingredients": [{"name": "vanilla wafers, crushed", "quantity": "55"}, {"name": "melted butter", "quantity": "6 tablespoons"}, {"name": "lemon drop candies, finely crushed, divided", "quantity": "20"}, {"name": "egg yolks", "quantity": "4"}, {"name": "fresh lemon juice", "quantity": "1/2 cup"}, {"name": "minced lemon zest", "quantity": "5 teaspoons"}, {"name": "white sugar", "quantity": "2 tablespoons"}, {"name": "egg whites", "quantity": "4"}, {"name": "cream of tartar", "quantity": "1/8 teaspoon"}, {"name": "white sugar", "quantity": "3/4 cup"}, {"name": "whipping cream, whipped until stiff", "quantity": "1 1/2 cups"}, {"name": "whipping cream", "quantity": "1/2 cup"}, {"name": "light corn syrup", "quantity": "3 tablespoons"}], "created": "2022/10/07", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/xM1HqQ1cjrGYvhHHxFcy2zd8Qjs=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/1122310-5fbd39592a01482e8d7f10da2d5a3eaa.jpg"}
{"title": "OREO Mint Chocolate Mousse", "description": "Instant pudding mix makes short work of this minty chocolate mousse. A garnish of fresh berries and minty cookie halves takes the dish to new heights.", "preparation_time_minutes": 15, "cooking_time_minutes": 60, "steps": ["Beat pudding mix and milk in medium bowl with whisk 2 minutes.", "Chop 10 cookies coarsely; stir into pudding with whipped topping until blended. Spoon into 8 dessert dishes.", "Refrigerate 1 hour. Cut remaining cookies in half. Top desserts with cookie halves and fruit. Garnish with mint, if desired."], "ingredients": [{"name": "chocolate instant pudding mix", "quantity": "1 (3.9 ounce) package"}, {"name": "cold milk", "quantity": "2 cups"}, {"name": "Mint OREO Fudge Cremes, divided", "quantity": "14"}, {"name": "thawed frozen whipped topping", "quantity": "1 cup"}, {"name": "fresh strawberries, cut in half", "quantity": "4"}, {"name": "fresh mint leaves", "quantity": "8"}], "created": "2022/02/11", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/mLPamuMeiomIaV2gZ0bfWv3vFJA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/989566-bfad0136943447de8c5ce9a90e54cb7c.jpg"}
{"title": "Mombasa Pumpkin Dessert", "description": "This dessert's coconut and creamy taste is irresistible! For the weight watchers this could be too much! You can add more sugar to this dish, according to your taste.", "preparation_time_minutes": 15, "cooking_time_minutes": 45, "steps": ["Steam the pumpkin pieces for 5 to 10 minutes. Scoop flesh from skins.", "In a medium saucepan, combine the pumpkin flesh and sugar. Heat over medium-low temperature until sugar dissolves into the pumpkin.", "Add coconut milk and cardamom. Stir often and cook until the mixture has thickened to a thick pudding-like consistency."], "ingredients": [{"name": "medium sugar pumpkin, seeded and cubed", "quantity": "1"}, {"name": "white sugar", "quantity": "2 cups"}, {"name": "coconut milk", "quantity": "1 cup"}, {"name": "ground cardamom", "quantity": "1 teaspoon"}], "created": "2022/07/14", "ratings": 4.0, "image_url": "https://www.allrecipes.com/thmb/Wh-3SkXQdFn6BpW7w86xA9_0teQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/44510-578995e074174497b5270b5cc48db761.jpg"}
{"title": "Irish Cream Chocolate Mousse", "description": "A wonderful light (if slightly alcoholic) mousse that will be sure to end your dinner on the perfect note!", "preparation_time_minutes": 25, "cooking_time_minutes": 1, "steps": ["In a mixing bowl, beat the egg yolks and sugar with an electric mixer set on medium speed until pale, creamy, and starting to thicken, about 5 minutes.", "With clean beaters, whip the cream in a non-plastic bowl on medium speed until fluffy and the cream forms stiff peaks. Fold 1/3 of the yolk mixture into the whipped cream. Add the remaining yolk mixture and Irish cream liqueur, folding just until incorporated.", "In a microwave-safe bowl, heat the chocolate very gently on low power just until melted; stir to dissolve any lumps.", "Gently fold the chocolate into the Irish cream mixture, keeping as much fluffy volume as possible. Beat the egg whites to stiff peaks in a non-plastic bowl and fold into the chocolate mixture until evenly incorporated.", "Spoon the mousse into individual dessert cups or glasses, and chill for 4 to 6 hours."], "ingredients": [{"name": "eggs, separated", "quantity": "6"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "chilled heavy cream", "quantity": "1 cup"}, {"name": "Irish cream liqueur", "quantity": "3 1/2 tablespoons"}, {"name": "chocolate, chopped", "quantity": "8 ounces"}], "created": "2024/03/11", "ratings": 4.3, "image_url": "https://www.allrecipes.com/thmb/9YDfj4WSawsaOB8ZUEbeFWvy1EA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/216924irish-cream-chocolate-mousseGroceryAddict4x3-c294684369be478c9dee0b8d2ff0ee8a.jpg"}
{"title": "Tropical Mango Mousse", "description": "There's nothing quite so refreshing as mangos! Preparation time: 5 minutes. This recipe is from The WEBB Cooks, articles and recipes by Robyn Webb, courtesy of the American Diabetes Association.", "preparation_time_minutes": 5, "cooking_time_minutes": 60, "steps": ["In a blender, combine mangoes, banana, yogurt, honey, ice cubes, and vanilla extract until smooth.", "Refrigerate for 3 hours.", "Pour into individual dishes and serve."], "ingredients": [{"name": "mangos, peeled, seeded, and cubed", "quantity": "2"}, {"name": "banana", "quantity": "1"}, {"name": "nonfat plain yogurt", "quantity": "2/3 cup"}, {"name": "honey", "quantity": "2 teaspoons"}, {"name": "ice cubes", "quantity": "6"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2022/08/22", "ratings": 3.9, "image_url": "https://www.allrecipes.com/thmb/dyO6oq1osEYCdki7Zj5dqc9_A2U=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/223542-24c4171c2c2a450eb51324da8a14f813.jpg"}
{"title": "Coconut Coffee Mousse", "description": "This is delicious and very easy to make. Before serving, sprinkle on some confectioners' sugar and cocoa for decoration.", "preparation_time_minutes": 10, "cooking_time_minutes": 60, "steps": ["Fold coffee liqueur and coconut into whipped topping until well combined.", "Pour into 8x8 inch baking dish and freeze 4 hours, until firm."], "ingredients": [{"name": "frozen whipped topping, thawed", "quantity": "1 (8 ounce) container"}, {"name": "coffee flavored liqueur", "quantity": "2 tablespoons"}, {"name": "flaked coconut", "quantity": "1/4 cup"}], "created": "2022/07/14", "ratings": 3.8, "image_url": "https://www.allrecipes.com/thmb/C_BZTTdvb8iSvRn6h9iYfNK_q8E=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/2349483-f7c76e6c83214b718621671d6744de7d.jpg"}
{"title": "Everyone Loves It Chocolate Mousse", "description": "Since this recipe was created, it has been requested at family holidays. I make it in big batches so that people can take some home. It is light and creamy in texture yet rich in flavor!", "preparation_time_minutes": 45, "cooking_time_minutes": 15, "steps": ["Melt semisweet chocolate chips and milk chocolate chips in a heavy saucepan over very low heat while stirring. Stir coffee into the melted chocolate, remove from heat, and cool to room temperature.", "Beat egg yolks, one at a time, into the chocolate mixture.", "Beat heavy cream with an electric hand mixer in a large mixing bowl until thickened. Gradually beat sugar into the cream until the mixture is stiff.", "Beat egg whites with the salt in a separate glass or metal bowl until stiff peaks form; fold into the cream mixture.", "Take about 1/3 of the resulting mixture and stir into the chocolate mixture. Scrape remaining cream-and-egg mixture over lightened chocolate base and fold together gently; pour into a serving bowl or individual dessert cups.", "Chill in refrigerator until set, about 2 hours."], "ingredients": [{"name": "semisweet chocolate chips", "quantity": "3 (12 ounce) bags"}, {"name": "milk chocolate chips", "quantity": "1 (11.5 ounce) package"}, {"name": "coffee", "quantity": "3/4 cup"}, {"name": "egg yolks", "quantity": "8"}, {"name": "heavy whipping cream", "quantity": "8 cups"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "egg whites", "quantity": "16"}, {"name": "salt", "quantity": "1 pinch"}], "created": "2022/06/14", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/VIvi0hMpAqDSkgtA3toJ_BdReLI=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/3242110-e38eb5579542441990a2dba4bb61812d.jpg"}
{"title": "Pumpkin Mousse", "description": "A light, airy alternative to the traditional pumpkin pie. Water can be substituted for milk if you would like a non-dairy mousse.", "preparation_time_minutes": 30, "cooking_time_minutes": 15, "steps": ["Pour the 1/2 cup of water or milk into a small bowl and sprinkle the gelatin over it to soften.", "Separate the eggs, placing the whites in an electric mixer bowl and the yolks in a heat-proof bowl that holds at least 2 cups.", "Combine the milk, honey, and spices in a heavy bottomed saucepan and heat until the honey dissolves and the mixture is steaming hot. Add the softened gelatin with its liquid and stir until it is completely dissolved.", "Pour most of the hot milk mixture into the egg yolks, whisking constantly, then pour this mixture back into the pot and continue heating until it thickens and almost boils. Stir in the pumpkin and keep stirring until there are no big bubbles when you stop stirring for a few seconds. Remove from the heat and whisk in the vanilla.", "Beat the egg whites until frothy, then start adding the sugar gradually, beating until stiff peaks have formed. Fold a big spatula of the whites into the pumpkin custard, then fold in the remaining egg whites.", "Turn the mousse into a 6-cup metal mold that has been rinsed with cold water. Chill mousse overnight. To unmold, dip the mold in hot water for about 30 seconds then invert onto a serving platter. Alternatively, spoon the mousse into individual ramekins or wine glasses that have a tablespoon or two of chopped crystallized ginger and/or gingersnap crumbs in the bottom. Serve with whipped cream."], "ingredients": [{"name": "eggs", "quantity": "3"}, {"name": "milk", "quantity": "1 cup"}, {"name": "honey", "quantity": "3/4 cup"}, {"name": "milk", "quantity": "1/2 cup"}, {"name": "unflavored gelatin", "quantity": "1 (.25 ounce) package"}, {"name": "pumpkin puree", "quantity": "1 1/2 cups"}, {"name": "white sugar", "quantity": "3 tablespoons"}, {"name": "ground cinnamon", "quantity": "1 teaspoon"}, {"name": "ground cloves", "quantity": "1/2 teaspoon"}, {"name": "ground mace", "quantity": "1/2 teaspoon"}, {"name": "ground nutmeg", "quantity": "1/2 teaspoon"}, {"name": "ground ginger", "quantity": "1/2 teaspoon"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "chopped crystallized ginger", "quantity": "2 tablespoons"}], "created": "2022/08/22", "ratings": 4.2, "image_url": "https://www.allrecipes.com/thmb/X73W3cGcTajPT1MJGyI2W8r37tA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/2691772-f26cf4c3823c43aa91528e9ab0d3cb19.jpg"}
{"title": "Easy Chocolate Mousse", "description": "This chocolate mousse made with instant pudding and cool whip is easy to whisk up for a simple but delicious chocolate dessert.", "preparation_time_minutes": 5, "cooking_time_minutes": 60, "steps": ["Whisk together milk and pudding mix in a large bowl for 2 minutes.", "Fold in whipped topping until blended.", "Chill in the refrigerator before serving."], "ingredients": [{"name": "cold milk", "quantity": "1 1/2 cups"}, {"name": "instant chocolate pudding mix", "quantity": "1 (3.9 ounce) package"}, {"name": "frozen whipped topping, thawed", "quantity": "1 (16 ounce) container"}], "created": "2023/03/21", "ratings": 4.3, "image_url": "https://www.allrecipes.com/thmb/pgmuJ4ewDOuH-5-RXvZwWdW5qy4=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/2196418-easy-chocolate-mousse-Mark-Podmore-4x3-1-5a86e68366eb42d3a830cce937773fb4.jpg"}
{"title": "5 Minute Baileys Chocolate Mousse", "description": "In a hurry for a quick and delicious dessert? Got unexpected company drop by? This dessert is ready in less than 5 minutes. Ready to eat as soon as it is made or chill in the fridge for later.", "preparation_time_minutes": 5, "cooking_time_minutes": 60, "steps": ["Combine heavy whipping cream, Baileys, cocoa powder, powdered sugar, vanilla extract, and salt in a large bowl.", "Beat with an electric mixer until stiff peaks form.", "Serve immediately or chill until serving."], "ingredients": [{"name": "heavy whipping cream", "quantity": "1 cup"}, {"name": "Baileys Irish Cream", "quantity": "1/4 cup"}, {"name": "unsweetened cocoa powder", "quantity": "1/4 cup"}, {"name": "powdered sugar", "quantity": "1/4 cup"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "salt", "quantity": "pinch"}], "created": "2023/06/28", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/-G28Jalwd-1TFG9y01Nw1FyUHIM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/5MinuteChocolateMousseKimsCookingNow4x3-b21cef562e394e9baa089f48b0c8b979.jpg"}
{"title": "Easy Chocolate Mousse without Eggs", "description": "My husband and I honeymooned in Paris two years ago. We were on our way to see the Eiffel Tower when it began to rain. Quickly, we hurried into the first cafe we came across. We ordered chocolate mousse for dessert. To say that it was divine would be an understatement. I knew I wanted to recreate that dessert for my husband when we got home. Serve in wine glasses for a nice touch.", "preparation_time_minutes": 10, "cooking_time_minutes": 5, "steps": ["Place chocolate chips in a large bowl.", "Heat 1/2 cup cream in a small saucepan over medium-high heat until it begins to rise and foam, watching carefully so it doesn't spill over, 3 to 5 minutes. Pour over chocolate chips and cover for 1 minute.", "Remove cover and slowly stir with a spatula until smooth. Stir in hot coffee and vanilla extract until all chocolate has melted.", "Whip remaining 1 cup cream in a chilled glass or metal bowl with an electric mixer until soft peaks form. Gently fold cream into chocolate mixture until combined.", "Spoon into glasses and refrigerate until firm, at least 3 hours."], "ingredients": [{"name": "semisweet chocolate chips", "quantity": "1/2 (12 ounce) bag, or more to taste"}, {"name": "heavy whipping cream, divided", "quantity": "1 1/2 cups"}, {"name": "hot, strong coffee", "quantity": "1/4 cup"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}], "created": "2022/01/11", "ratings": 5.0, "image_url": "https://www.allrecipes.com/thmb/WVnHLzPAK_cXIt8vk1LzVdXNy_Q=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/7793181-42168750d4a54a27a132877643145f90.jpg"}
{"title": "Mama's Banana Pudding", "description": "Dolly Parton and her sister Rachel Parton George grew up with their mama, grandmas, and aunts making this classic dessert from scratch. This version allows you to make it from scratch, just like their family always did.", "preparation_time_minutes": 20, "cooking_time_minutes": 20, "steps": ["Stir together 1 cup sugar, the flour, and salt in a large bowl. Whisk in milk, egg yolks, and whole eggs until well combined and smooth.", "Melt butter in a large saucepan over medium heat. Pour milk mixture into saucepan with butter; reduce heat to medium-low and whisk constantly until the mixture has thickened, coats the back of a spoon nicely, and begins to bubble, about 20 minutes. Remove from heat and stir in 2 teaspoons vanilla. Cover and let custard cool to room temperature, about 1 hour. (It will continue to thicken as it cools.)", "Peel and slice bananas. Line the bottom and sides of 2 (9x13-inch) broiler-safe casserole dishes with vanilla wafers. Layer banana slices over wafers. Pour cooled custard over bananas and wafers, smoothing top with a knife or spatula.", "For meringue, in a large clean bowl, using an electric mixer or a stand mixer fitted with the whisk attachment, beat egg whites, cream of tartar, and the remaining 1 tablespoon sugar and 1 teaspoon vanilla at high speed until stiff peaks form, about 5 minutes. Spoon meringue over top of custard, covering it completely.", "Set oven rack about 4 inches from broiler; turn broiler to high. Quickly broil meringues until browned, about 1 to 2 minutes. (This happens very quickly, so keep a close eye on it.)", "Remove dishes from oven, allow meringue to cool slightly, about 15 minutes, and serve. (Chill, covered, up to 4 days.)"], "ingredients": [{"name": "sugar", "quantity": "1 cup plus 1 tablespoon"}, {"name": "flour", "quantity": "1/2 cup"}, {"name": "salt", "quantity": "1/8 teaspoon"}, {"name": "whole milk", "quantity": "6 cups"}, {"name": "egg yolks", "quantity": "6"}, {"name": "eggs", "quantity": "3"}, {"name": "butter", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "3 teaspoons"}, {"name": "ripe bananas", "quantity": "9"}, {"name": "vanilla wafers", "quantity": "2 (12 ounce) boxes"}, {"name": "egg whites", "quantity": "6"}, {"name": "cream of tartar", "quantity": "1/4 teaspoon"}], "created": "2024/09/17", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/JxiTWfGZwJmdjzY2MZHkU7rTkIM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/8707679-mamas-banana-pudding-4x3-2b1439f987664c7d83377974fb8761fe.jpg"}
{"title": "Bread Pudding", "description": "This traditional bread pudding is decadent, delicious, and easy to make with basic ingredients. Perfect for breakfast or dessert, it pairs wonderfully with milk or a scoop of vanilla ice cream.", "preparation_time_minutes": 15, "cooking_time_minutes": 45, "steps": ["Preheat the oven to 350 degrees F (175 degrees C).", "Place bread pieces into an 8-inch square baking pan. Drizzle melted butter over bread and sprinkle raisins over top.", "Whisk milk, sugar, eggs, cinnamon, and vanilla together in a medium mixing bowl until well combined.", "Pour mixture over bread, and lightly push down with a fork until all bread is covered and soaking up the liquid.", "Bake in the preheated oven until golden brown and the top springs back when lightly pressed, about 45 minutes."], "ingredients": [{"name": "day-old bread, torn into small pieces", "quantity": "6 slices"}, {"name": "unsalted butter, melted", "quantity": "2 tablespoons"}, {"name": "raisins (Optional)", "quantity": "1/2 cup"}, {"name": "milk", "quantity": "2 cups"}, {"name": "white sugar", "quantity": "3/4 cup"}, {"name": "large eggs, beaten", "quantity": "4"}, {"name": "ground cinnamon", "quantity": "1 teaspoon"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2024/10/24", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/VuJca2oNmppIQxIUgB6a4a4wLoU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/AR-gw-7177-Bread-Pudding-II-ddmfs-beauty-4x3-8d462904287a48f483b532ada757fed1.jpg"}
{"title": "The Best Banana Pudding", "description": "This no-cook banana pudding recipe is easy to make and delicious layered with vanilla wafers and slices of banana. It's the best banana pudding you will ever find (or so I've been told by many)!", "preparation_time_minutes": 25, "cooking_time_minutes": 60, "steps": ["Place milk and pudding mix in a large bowl; beat with a whisk for 2 minutes. Blend in condensed milk until smooth.", "Stir in vanilla, then fold in whipped topping.", "Layer wafers, banana slices, and pudding mixture in a glass serving bowl.", "For best results, chill pudding in the refrigerator for at least an hour before serving. Top with extra crushed wafers before serving."], "ingredients": [{"name": "cold milk", "quantity": "2 cups"}, {"name": "instant vanilla pudding mix", "quantity": "1 (5 ounce) package"}, {"name": "sweetened condensed milk", "quantity": "1 (14 ounce) can"}, {"name": "vanilla extract", "quantity": "1 tablespoon"}, {"name": "frozen whipped topping, thawed", "quantity": "1 (12 ounce) container"}, {"name": "vanilla wafers", "quantity": "1 (16 ounce) package"}, {"name": "small bananas, sliced", "quantity": "14 or to taste"}], "created": "2024/06/17", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/qA_Mffpg6IVG-FsNynFRVwEqe5Q=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/22749-the-best-banana-pudding-mfs-365-4x3-c932d443ac8243009231dbe6eea8be95.jpg"}
{"title": "Creamy Rice Pudding", "description": "This sweet rice pudding is thick, creamy, and utterly decadent. Made with basic ingredients you likely already have on hand, this rice pudding recipe is the perfect comforting treat.", "preparation_time_minutes": 10, "cooking_time_minutes": 40, "steps": ["Pour water into a saucepan and bring to a boil over medium heat; stir in rice. Reduce heat to low, cover, and simmer until rice is tender and liquid has been absorbed, about 20 minutes.", "Combine cooked rice, 1 1/2 cups milk, sugar, and salt in a clean saucepan. Cook over medium heat, stirring often, until thick and creamy, about 15 minutes.", "Stir in remaining 1/2 cup milk, beaten egg, and raisins; cook 2 minutes more, stirring constantly. Remove from heat and stir in butter and vanilla until combined.", "Serve warm."], "ingredients": [{"name": "cold water", "quantity": "1 1/2 cups"}, {"name": "uncooked white rice", "quantity": "3/4 cup"}, {"name": "milk, divided", "quantity": "2 cups"}, {"name": "white sugar", "quantity": "1/3 cup"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "large egg, beaten", "quantity": "1"}, {"name": "golden raisins", "quantity": "2/3 cup"}, {"name": "butter", "quantity": "1 tablespoon"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}], "created": "2024/09/19", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/vpcgd8P2czJVKevO6dpAgBh44ts=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/AR-24059-creamy-rice-pudding-DDMFS-4x3-a47c1f5ad9d449c582d62e6e42da28ac.jpg"}
{"title": "Best Old-Fashioned Creamy Rice Pudding", "description": "This rice pudding with cooked rice, milk, sugar, and an egg gets added flavor from butter and vanilla in this quick stovetop dessert.", "preparation_time_minutes": 5, "cooking_time_minutes": 20, "steps": ["Place cooked rice in a medium saucepan. Add 1 1/2 cups milk and salt; cook and stir until thick and creamy, 15 to 20 minutes.", "Add remaining 1/2 cup milk, golden raisins, beaten egg, and white sugar; continue cooking, stirring continuously, until well blended, 2 to 3 minutes more.", "Remove saucepan from heat; stir in butter and vanilla extract.", "Serve and enjoy!"], "ingredients": [{"name": "cooked rice", "quantity": "1 1/2 cups"}, {"name": "milk, divided", "quantity": "2 cups"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "golden raisins (Optional)", "quantity": "2/3 cup"}, {"name": "egg, beaten", "quantity": "1"}, {"name": "white sugar", "quantity": "1/3 cup"}, {"name": "butter", "quantity": "1 tablespoon"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}], "created": "2024/09/24", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/O4CHHUw-JVY2KBr2k_QVcu0Tjqk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/AR-228914-old-fashioned-rice-pudding-DDMFS-4x3-90f8e5dcb32f4d11b0434d212a1861e5.jpg"}
{"title": "Homemade Banana Pudding", "description": "This homemade banana pudding recipe from scratch was handed down from my grandmother. My whole family loves it and we all grew up on it. Enjoy this classic dessert!", "preparation_time_minutes": 10, "cooking_time_minutes": 20, "steps": ["Combine sugar, flour, and salt together in a medium saucepan. Add eggs and stir well. Stir in milk, and cook over low heat, stirring constantly.", "When the mixture has thickened enough to coat the back of a metal spoon, remove from heat and continue to stir, cooling slightly. Stir in butter and vanilla until smooth.", "Layer pudding with bananas and vanilla wafers in a serving dish.", "Chill at least 1 hour in the refrigerator before serving."], "ingredients": [{"name": "white sugar", "quantity": "2/3 cup"}, {"name": "all-purpose flour", "quantity": "1/3 cup"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "large eggs, beaten", "quantity": "3"}, {"name": "milk", "quantity": "2 cups"}, {"name": "butter, softened", "quantity": "2 tablespoons"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "bananas, peeled and sliced", "quantity": "2"}, {"name": "vanilla wafer cookies", "quantity": "1/2 (12 ounce) package"}], "created": "2024/06/25", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/UTcT_hz_7AyDE4IjhAGLGS6rw4g=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/AR-18990-banana-pudding-DDMFS-beauty-4x3-00e7949b5a894e24be939852ed318d02.jpg"}
{"title": "Chocolate Cornstarch Pudding", "description": "My mom's best chocolate pudding recipe, made with cornstarch and cocoa. A simple and delicious dessert that can be served warm or chilled.", "preparation_time_minutes": 10, "cooking_time_minutes": 20, "steps": ["Stir together sugar, cocoa, cornstarch, and salt in a saucepan. Place over medium heat, and stir in milk.", "Bring to a boil, and cook, stirring constantly, until the mixture thickens enough to coat the back of a metal spoon.", "Remove from heat, and stir in butter and vanilla.", "Let cool briefly, and serve warm, or chill in the refrigerator until serving."], "ingredients": [{"name": "white sugar", "quantity": "1/2 cup"}, {"name": "unsweetened cocoa powder", "quantity": "3 tablespoons"}, {"name": "cornstarch", "quantity": "1/4 cup"}, {"name": "salt", "quantity": "1/8 teaspoon"}, {"name": "milk", "quantity": "2 3/4 cups"}, {"name": "butter, room temperature", "quantity": "2 tablespoons"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}], "created": "2023/02/26", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/cDEs7e8eNIZwoCSVSX9xsZMvrio=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/44699-chocolate-cornstarch-pudding-screenshot-beauty-4x3-df4511405ec44b2da74a6d2cb76aa83e.jpg"}
{"title": "Dirt Pudding", "description": "This dirt pudding tastes so good! It's very easy to make, and there are so many different ways to present it.", "preparation_time_minutes": 15, "cooking_time_minutes": 60, "steps": ["Whisk milk and pudding mix in a large bowl until softly set, about 2 minutes. The pudding will thicken as it stands.", "Beat confectioners' sugar, cream cheese, and butter in a separate bowl until smooth and creamy.", "Stir cream cheese mixture into pudding until thoroughly combined; gently fold in frozen whipped topping.", "Place 1/2 of the cookie crumbs into the bottom of a 9x12-inch dish; spread evenly.", "Cover cookie crumbs with pudding mixture and top with remaining crumbs, covering completely.", "Chill for at least 30 minutes before serving."], "ingredients": [{"name": "milk", "quantity": "3 cups"}, {"name": "instant French vanilla pudding mix", "quantity": "2 (3.5 ounce) packages"}, {"name": "confectioners' sugar", "quantity": "1 cup"}, {"name": "cream cheese, softened", "quantity": "1 (8 ounce) package"}, {"name": "butter, softened", "quantity": "1/4 cup"}, {"name": "frozen whipped topping, thawed", "quantity": "1 (12 ounce) container"}, {"name": "chocolate cream-filled sandwich cookies, crushed", "quantity": "1 (14 ounce) package, divided"}], "created": "2024/08/21", "ratings": 4.9, "image_url": "https://www.allrecipes.com/thmb/oTlq83cI4drPKy1C033kJvrMzVM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/AR-223415-dirt-pudding-ddmfs-4x3-beauty-e39bd8f5062f467da1867da11e018027.jpg"}
{"title": "Baked Rice Pudding", "description": "This baked rice pudding recipe is lovely served warm. It has the appeal of homemade comfort food.", "preparation_time_minutes": 5, "cooking_time_minutes": 90, "steps": ["Place rice in a 3-quart saucepan and add water; bring to a boil. Reduce heat and simmer for 25 to 30 minutes.", "Preheat the oven to 325 degrees F (165 degrees C).", "Mix eggs, milk, sugar, vanilla extract, and salt together in a large bowl until combined.", "Stir in cooked rice and raisins. Transfer into a 10x6x2 inch baking dish.", "Bake uncovered in the preheated oven for 30 minutes; stir pudding and sprinkle with nutmeg. Continue to bake until a knife inserted into the center comes out clean, about 30 minutes more."], "ingredients": [{"name": "uncooked white rice", "quantity": "1 cup"}, {"name": "water", "quantity": "2 cups"}, {"name": "eggs, beaten", "quantity": "3"}, {"name": "milk", "quantity": "2 cups"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "salt", "quantity": "1/2 teaspoon"}, {"name": "raisins", "quantity": "1/3 cup"}, {"name": "ground nutmeg", "quantity": "1 pinch"}], "created": "2024/08/20", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/7i1O799yymWb_EwNSe8AI6jEVCE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/AR-9405-baked-rice-pudding-DDMFS-4x3-eeeb036d73ec4048925c8289928a8632.jpg"}
{"title": "Homemade Vanilla Pudding", "description": "This homemade pudding with vanilla is a rich and delectable dessert. There is no substitute for the butter!", "preparation_time_minutes": 10, "cooking_time_minutes": 20, "steps": ["Heat milk in a medium saucepan over medium heat until bubbles form at the edges.", "Mix sugar, cornstarch, and salt together in a small bowl.", "Add sugar, cornstarch, and salt mixture to hot milk, a little at a time, stirring until thick enough to coat the back of the spoon.", "Remove saucepan from heat, and stir in vanilla and butter.", "Spoon pudding evenly into 5 serving dishes. For best results, chill pudding in the refrigerator before serving."], "ingredients": [{"name": "milk", "quantity": "2 cups"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "cornstarch", "quantity": "3 tablespoons"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "butter", "quantity": "1 tablespoon"}], "created": "2023/12/01", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/2gqegUVFjHHlPHwc6ITXQc_FBgA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/20586-homemade-vanilla-pudding-DDMFS-4x3-b69285facb244125bed3db6ad4cf2d9f.jpg"}
{"title": "Tembleque Puerto Rican Coconut Pudding", "description": "Tembleque, which means 'wiggly,' is a creamy coconut pudding, perfect for serving as a sweet, chilled dessert with a hint of cinnamon.", "preparation_time_minutes": 10, "cooking_time_minutes": 5, "steps": ["Stir together coconut milk, sugar, and salt in a saucepan.", "Spoon 3 to 4 tablespoons of the coconut milk mixture into a small bowl and stir in cornstarch until dissolved; pour back into the saucepan.", "Bring the mixture to a boil while stirring constantly; cook until smooth and thick, about 5 minutes.", "Pour into molds, cover each with plastic wrap, and refrigerate until cold and firm, 3 hours to 2 days.", "Run a thin knife around the edges of each mold; invert onto serving plates. Garnish tops with cinnamon."], "ingredients": [{"name": "coconut milk", "quantity": "2 (14 ounce) cans"}, {"name": "sugar", "quantity": "3/4 cup"}, {"name": "kosher salt", "quantity": "1/4 teaspoon"}, {"name": "cornstarch", "quantity": "1/2 cup"}, {"name": "ground cinnamon", "quantity": "1 pinch"}], "created": "2022/07/21", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/XgVN30pVxBuJM8qxPSIcxQcf-N4=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/5412888-tembleque-puerto-rican-coconut-pudding-Cindylee-Bloomer-4x3-1-dcdbed803c984abe99c4db33846c3811.jpg"}
{"title": "Chia Coconut Pudding with Coconut Milk", "description": "This chia seed pudding with coconut milk is a healthy and refreshing dessert alternative, rich in omega-3s and perfect with a touch of cinnamon and fresh fruit.", "preparation_time_minutes": 10, "cooking_time_minutes": 20, "steps": ["Whisk together sweetened and unsweetened coconut milks, agave nectar, vanilla extract, cinnamon, and salt in a bowl.", "Stir in chia seeds and allow the mixture to soak until thickened, at least 20 minutes, or cover with plastic wrap and refrigerate overnight.", "Stir the pudding before serving and top with diced fresh strawberries."], "ingredients": [{"name": "sweetened coconut milk", "quantity": "2 cups"}, {"name": "unsweetened coconut milk", "quantity": "6 tablespoons"}, {"name": "agave nectar", "quantity": "1 tablespoon, or more to taste"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "ground cinnamon", "quantity": "1/4 teaspoon"}, {"name": "salt", "quantity": "1 pinch"}, {"name": "chia seeds", "quantity": "1/2 cup"}, {"name": "diced fresh strawberries", "quantity": "1/2 cup (Optional)"}], "created": "2023/12/01", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/P4xy2NPHw2mBfDO9wM-4fWEXHVE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/5352615-chia-coconut-pudding-with-coconut-milk-Buckwheat-Queen-4x3-1-21f63206865841b480e600aa29262c3f.jpg"}
{"title": "Classic Tapioca Pudding", "description": "A classic tapioca pudding recipe that serves as a comforting treat, perfect either warm or chilled.", "preparation_time_minutes": 10, "cooking_time_minutes": 15, "steps": ["Mix milk, tapioca, sugar, and salt in a medium saucepan; bring to a boil over medium heat, stirring constantly.", "Reduce heat to low and cook while stirring for an additional 5 minutes.", "Gradually whisk 1 cup of the hot milk mixture into the beaten eggs, adding 2 tablespoons at a time to temper the eggs.", "Stir the egg mixture back into the tapioca mixture until well combined and bring to a gentle simmer over medium-low heat; cook and stir for 2 more minutes until thick enough to coat the back of a spoon.", "Remove from heat and stir in vanilla extract.", "Serve hot or pour into serving dishes and refrigerate for several hours until cold."], "ingredients": [{"name": "whole milk", "quantity": "3 cups"}, {"name": "quick-cooking tapioca", "quantity": "1/2 cup"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "eggs", "quantity": "2, beaten"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}], "created": "2022/07/19", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/t5Z99m5eg8B9AFQrXd7GkrgTKrA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/5403911-classic-tapioca-pudding-Cmryser-1x1-2-22fb05b725cc4171a768574c37f23b24.jpg"}
{"title": "Gramma's Apple Bread Pudding", "description": "An apple bread pudding with warm vanilla sauce, offering a cozy and nostalgic taste of home.", "preparation_time_minutes": 15, "cooking_time_minutes": 45, "steps": ["Preheat the oven to 350 degrees F (175 degrees C). Grease a 7x11-inch baking dish.", "Combine bread cubes, apples, and raisins in a large bowl.", "In a small saucepan over medium heat, cook and stir milk, brown sugar, and butter until the butter is melted. Pour over the bread mixture and mix until evenly coated. Transfer to the prepared baking dish.", "Whisk eggs, cinnamon, and vanilla extract together in a small bowl. Pour over the bread mixture in the baking dish.", "Bake in the preheated oven until the center is set and apples are tender, 40 to 50 minutes.", "To prepare the vanilla sauce, mix milk, butter, white sugar, and brown sugar in a saucepan. Bring to a boil, remove from heat, and stir in vanilla extract.", "Serve the pudding with the warm vanilla sauce."], "ingredients": [{"name": "soft bread cubes", "quantity": "4 cups"}, {"name": "apples, peeled and sliced", "quantity": "2 cups"}, {"name": "raisins", "quantity": "1/4 cup"}, {"name": "milk", "quantity": "1 3/4 cups"}, {"name": "brown sugar", "quantity": "1 cup"}, {"name": "butter", "quantity": "1/4 cup"}, {"name": "eggs, beaten", "quantity": "2 large"}, {"name": "ground cinnamon", "quantity": "1 teaspoon"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "milk (for sauce)", "quantity": "1/2 cup"}, {"name": "butter (for sauce)", "quantity": "1/2 cup"}, {"name": "white sugar", "quantity": "1/4 cup"}, {"name": "brown sugar (for sauce)", "quantity": "1/4 cup"}, {"name": "vanilla extract (for sauce)", "quantity": "1 teaspoon"}], "created": "2024/06/21", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/VVKSeJAsg1e83IlPT8uv45IBF5o=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/4552728-a78a9bd0b03c4c458e71fad6ebb591e6.jpg"}
{"title": "Chocolate Avocado Pudding", "description": "A rich, vegan chocolate pudding made with avocados for a creamy and healthy twist.", "preparation_time_minutes": 10, "cooking_time_minutes": 60, "steps": ["Blend avocados, cocoa powder, brown sugar, coconut milk, vanilla extract, and ground cinnamon in a blender until smooth.", "Transfer the pudding to a container with a lid and refrigerate until chilled, about 30 minutes."], "ingredients": [{"name": "large avocados, peeled, pitted, and cubed", "quantity": "2"}, {"name": "unsweetened cocoa powder", "quantity": "1/2 cup"}, {"name": "brown sugar", "quantity": "1/2 cup"}, {"name": "coconut milk", "quantity": "1/3 cup"}, {"name": "vanilla extract", "quantity": "2 teaspoons"}, {"name": "ground cinnamon", "quantity": "1 pinch"}], "created": "2024/06/12", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/vEmOJ26aUVRfGhgthCIdo0GTeqg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/234324chocolate-avocado-puddingChristina4x3-39db31ab61814ff7bd5d05e1858645a3.jpg"}
{"title": "Southern-Style Baked Banana Pudding", "description": "A classic Southern baked banana pudding, perfect for those who love the flavors of banana cream pie without the hassle of a crust.", "preparation_time_minutes": 30, "cooking_time_minutes": 15, "steps": ["Separate eggs, placing the whites in a stand mixer bowl and yolks into a saucepan.", "Add sugar, salt, and flour to the yolks. Add 1/4 of the milk and whisk until blended, then add remaining milk and whisk until smooth.", "Cook over medium heat while whisking until custard thickens.", "Remove from heat and stir in banana liqueur, vanilla, and cold butter until butter dissolves. Set aside.", "Preheat oven to 400 degrees F (200 degrees C).", "Toss banana slices with lemon juice.", "Layer 1/4 of the custard in a baking dish. Add a layer of vanilla wafers, 1/2 of the bananas, and 1/2 of the remaining custard. Repeat with another layer of wafers, remaining bananas, and custard. Smooth top.", "Prepare meringue: Add cream of tartar to egg whites and beat until foamy. Gradually add sugar and beat until stiff peaks form.", "Spread meringue over pudding and bake for 7-10 minutes until browned. Serve warm or chilled."], "ingredients": [{"name": "large eggs", "quantity": "4"}, {"name": "white sugar", "quantity": "1/2 cup + 2 tablespoons"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "all-purpose flour", "quantity": "1/3 cup + 1 tablespoon"}, {"name": "milk", "quantity": "2 cups"}, {"name": "banana liqueur", "quantity": "1 tablespoon (optional)"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "cold butter", "quantity": "1 tablespoon"}, {"name": "very ripe bananas, sliced", "quantity": "3"}, {"name": "freshly squeezed lemon juice", "quantity": "1 1/2 teaspoons"}, {"name": "miniature vanilla wafers", "quantity": "12-ounce package"}, {"name": "cream of tartar", "quantity": "1/8 teaspoon"}], "created": "2024/02/06", "ratings": 4.7, "image_url": "https://www.allrecipes.com/thmb/FVM8i8_tHbWhgeo6stf_wYYB2UM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/6623681-68d3e5d370814d5cb81c6801f21c63dd.jpg"}
{"title": "Slow Cooker Rice Pudding", "description": "Super easy crockpot rice pudding made in a slow cooker for a creamy, comforting treat.", "preparation_time_minutes": 10, "cooking_time_minutes": 165, "steps": ["Stir 4 cups milk, sugar, and rice together in a slow cooker until sugar dissolves.", "Add margarine, cover, and cook on High for 2 1/2 hours.", "Whisk egg, 2 tablespoons milk, vanilla, almond extract, and salt together in a bowl.", "Pour a small amount of hot rice mixture into egg mixture, whisking quickly to avoid cooking the egg.", "Pour the egg mixture back into the slow cooker and whisk until combined.", "Continue to cook on High until creamy, about 15 more minutes.", "Transfer pudding to a glass baking dish. Cover with plastic wrap, leaving two corners uncovered to vent, and refrigerate until chilled completely, at least 1 hour."], "ingredients": [{"name": "milk", "quantity": "4 cups"}, {"name": "white sugar", "quantity": "1/2 cup"}, {"name": "long-grain white rice", "quantity": "1/2 cup"}, {"name": "margarine", "quantity": "1 tablespoon"}, {"name": "egg", "quantity": "1 large"}, {"name": "milk", "quantity": "2 tablespoons"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "almond extract", "quantity": "1/2 teaspoon"}, {"name": "salt", "quantity": "1/8 teaspoon"}], "created": "2022/11/15", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/r_8xowyt_tIXmf4jPcupjTWny98=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/8089104-e4e6676c76e947db9e78e283d118b931.jpg"}
{"title": "Budin (Puerto Rican Bread Pudding)", "description": "Budin is a traditional Puerto Rican bread pudding, a comforting dessert made with day-old bread and a rich caramelized top.", "preparation_time_minutes": 30, "cooking_time_minutes": 90, "steps": ["Bring 1 cup water to a boil in a small saucepan over high heat. Add cinnamon sticks, cloves, and anise seed. Cover and set aside to steep for 15 minutes.", "Meanwhile, combine 1/2 cup sugar and 2 tablespoons water in a saucepan over medium-high heat. Stir occasionally to dissolve sugar completely, but stop stirring once the mixture comes to a boil. Stay near the stove to monitor the color, swirling the pan gently to redistribute the sugar as it darkens. Cook until sugar turns light golden brown, then pour into a 9x5-inch loaf pan. Set aside to allow caramel to harden.", "Preheat the oven to 350 degrees F (175 degrees C).", "Remove crust from day-old bread, tear bread into cubes, and place into a large mixing bowl. Strain spice tea through a fine mesh sieve to remove spices. Add to bread along with evaporated milk. Stir to evenly moisten and set aside for 10 minutes.", "While the bread mixture sits, whisk eggs in a large mixing bowl along with remaining 1 1/2 cups sugar, vanilla, salt, and melted butter. Stir in moistened bread mixture until evenly mixed. Pour into the loaf pan over the caramel.", "Line a roasting pan with a damp kitchen towel. Place the loaf pan on the towel, inside the roasting pan, and place the roasting pan on the oven rack. Fill the roasting pan with boiling water to reach halfway up the sides of the loaf pan.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour and 15 minutes.", "Cool in the pan for about an hour, then refrigerate until cold, 2 hours more.", "When ready, invert the budin onto a serving plate. The caramel will have turned to syrup and will cover the budin like a sauce."], "ingredients": [{"name": "water", "quantity": "1 cup"}, {"name": "cinnamon sticks", "quantity": "2 (3 inch)"}, {"name": "whole cloves", "quantity": "15"}, {"name": "anise seed", "quantity": "1 teaspoon"}, {"name": "white sugar", "quantity": "2 cups, divided"}, {"name": "water", "quantity": "2 tablespoons"}, {"name": "day-old bread", "quantity": "1 (1 pound) loaf"}, {"name": "evaporated milk", "quantity": "4 cups"}, {"name": "eggs", "quantity": "4 large"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "salt", "quantity": "3/4 teaspoon"}, {"name": "butter, melted", "quantity": "1/4 cup"}], "created": "2022/11/22", "ratings": 4.9, "image_url": "https://www.allrecipes.com/thmb/18F2Jh2L-UbNeRs5oCo32XqzHV8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/165102-budin-puerto-rican-bread-pudding-ddmfs-4x3-1-fe209a1e06594b4687c9bc36eddc297b.jpg"}
{"title": "Dairy-Free Chocolate Pudding", "description": "This dairy-free chocolate pudding is a simple, smooth, and creamy vegan dessert perfect for anyone avoiding dairy. It's quick and easy to prepare.", "preparation_time_minutes": 5, "cooking_time_minutes": 10, "steps": ["Mix cornstarch and water together in a small bowl until a paste forms.", "Combine soy milk, sugar, cocoa, and vanilla in a large saucepan; stir in cornstarch paste until well combined. Cook over medium heat, stirring constantly, until boiling. Continue to cook and stir until mixture thickens, 3 to 5 minutes.", "Remove from the heat and let cool for 5 minutes; pudding will continue to thicken as it cools. Cover and refrigerate until completely cool, 1 to 2 hours."], "ingredients": [{"name": "cornstarch", "quantity": "3 tablespoons"}, {"name": "water", "quantity": "2 tablespoons"}, {"name": "soy milk", "quantity": "1 1/2 cups"}, {"name": "white sugar", "quantity": "1/4 cup"}, {"name": "unsweetened cocoa powder", "quantity": "1/4 cup"}, {"name": "vanilla extract", "quantity": "1/4 teaspoon"}], "created": "2024/04/23", "ratings": 4.4, "image_url": "https://www.allrecipes.com/thmb/lBJYM1qKk5k5xv17hFQqOuwC-1M=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/20366-Dairy-Free-Chocolate-Pudding-ddmfs-4x3-2589e95acce247da903cd6e10c13473f.jpg"}
{"title": "Custard Bread Pudding", "description": "A creamy and rich custard bread pudding with more custard than bread, this recipe has been a family favorite for years. It's perfect for those who prefer a custard-heavy dessert.", "preparation_time_minutes": 10, "cooking_time_minutes": 90, "steps": ["Preheat the oven to 300 degrees F (150 degrees C).", "Arrange bread slices in a 9x13-inch baking dish. Sprinkle with raisins and cinnamon.", "Blend half-and-half, sugar, eggs, vanilla extract, and salt in a blender until smooth.", "Pour the egg mixture over the bread in the baking dish.", "Place the baking dish in a large roasting pan, and fill the pan with boiling water halfway up the sides of the baking dish.", "Bake in the preheated oven until set, about 1 1/2 hours. Serve warm or cold."], "ingredients": [{"name": "bread", "quantity": "4 slices"}, {"name": "raisins", "quantity": "1/4 cup"}, {"name": "ground cinnamon", "quantity": "1/8 teaspoon"}, {"name": "half-and-half", "quantity": "1 quart"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "eggs", "quantity": "4 large"}, {"name": "vanilla extract", "quantity": "1 teaspoon"}, {"name": "salt", "quantity": "1/4 teaspoon"}], "created": "2022/12/16", "ratings": 4.9, "image_url": "https://www.allrecipes.com/thmb/2TrOWCLZ1Pnjnydy5Otya7212IM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/1102579-f8ce7009071847109f7ee6aec9f74851.jpg"}
{"title": "Uncooked Banana Pudding", "description": "This quick and easy uncooked banana pudding combines sour cream, vanilla pudding mix, bananas, milk, and whipped topping for a delicious dessert ready in just 10 minutes.", "preparation_time_minutes": 10, "cooking_time_minutes": 60, "steps": ["Stir milk, sour cream, whipped topping, and pudding mix together in a bowl until well combined.", "Place a layer of vanilla wafer cookies in the bottom of a trifle bowl.", "Cover with a layer of pudding mixture, then a layer of sliced bananas.", "Repeat the layers until all ingredients are used."], "ingredients": [{"name": "whole milk", "quantity": "2 cups"}, {"name": "sour cream", "quantity": "8 ounces"}, {"name": "frozen whipped topping", "quantity": "1 (8 ounce) container, thawed"}, {"name": "instant vanilla pudding mix", "quantity": "1 (5 ounce) package"}, {"name": "vanilla wafer cookies", "quantity": "1 (16 ounce) package"}, {"name": "bananas", "quantity": "4 medium, peeled and sliced"}], "created": "2022/12/27", "ratings": 4.8, "image_url": "https://www.allrecipes.com/thmb/4kkS3u-KD4bpNx7-nON6Yuq_woQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/806045-042c623485084d2abf4deafaf7e37b5d.jpg"}
{"title": "Brown Sugar and Cinnamon Rice Pudding", "description": "This easy-to-make rice pudding with brown sugar and cinnamon is perfect for breakfast or dessert. It's also gluten-free and ready in 25 minutes.", "preparation_time_minutes": 5, "cooking_time_minutes": 15, "steps": ["Bring water to a boil in a saucepan. Add rice, butter, and salt; cook and stir until butter melts, then cover the saucepan and remove from the heat. Set aside until water is absorbed, about 5 minutes.", "Stir milk, brown sugar, cornstarch, and vanilla into rice; bring to a simmer over medium heat while stirring. Cook until rice has the consistency of loose oatmeal, about 5 minutes.", "Ladle pudding into bowls and dust with cinnamon."], "ingredients": [{"name": "water", "quantity": "2 cups"}, {"name": "instant white rice", "quantity": "2 cups"}, {"name": "butter", "quantity": "1/2 teaspoon (optional)"}, {"name": "salt", "quantity": "1/8 teaspoon (optional)"}, {"name": "milk", "quantity": "1 cup"}, {"name": "brown sugar", "quantity": "2 tablespoons, or to taste"}, {"name": "cornstarch", "quantity": "1 teaspoon"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "ground cinnamon", "quantity": "1/2 teaspoon, or more to taste"}], "created": "2023/04/13", "ratings": 4.2, "image_url": "https://www.allrecipes.com/thmb/linBB8LYD5f9KK24Csm7qgoLZCQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/1061316-brown-sugar-and-cinnamon-rice-pudding-Tammy-Lynn-4x3-1-e2990dacdd7746a3a58087c9d019cfa4.jpg"}
{"title": "Rice Cooker Rice Pudding", "description": "This easy rice pudding recipe made in a rice cooker is creamy and delicious. Serve with extra cinnamon sprinkled on top for added flavor.", "preparation_time_minutes": 5, "cooking_time_minutes": 20, "steps": ["Stir 5 1/2 cups milk, rice, sugar, and cinnamon together in a rice cooker. Cover and cook for one cycle until tender and creamy, about 20 minutes.", "Stir in remaining 2 1/2 cups milk.", "Transfer to a bowl and let cool to room temperature, about 30 minutes. Cover and refrigerate for 1 to 2 hours before serving."], "ingredients": [{"name": "skim milk", "quantity": "8 cups, divided"}, {"name": "short-grain white rice", "quantity": "2 cups"}, {"name": "white sugar", "quantity": "1 cup"}, {"name": "ground cinnamon", "quantity": "1/2 teaspoon"}], "created": "2023/04/21", "ratings": 3.2, "image_url": "https://www.allrecipes.com/thmb/v0TVdW-31Jkw0kxkkf1im5NDYHM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/969229-rice-cooker-rice-pudding-Sugarplum-4x3-1-378e2396e8344dd18d63e5684f0cf613.jpg"}
{"title": "Almond Milk Instant Pudding", "description": "This easy instant pudding recipe made with almond milk has the perfect taste and consistency. It takes slightly more mixing than normal to achieve the ideal texture.", "preparation_time_minutes": 5, "cooking_time_minutes": 5, "steps": ["Pour 1 cup almond milk into a small saucepan. Add cornstarch and heat over medium heat. Cook, stirring constantly, until bubbly, about 3 to 5 minutes. Remove from heat and keep stirring for 30 seconds.", "Pour remaining almond milk into a bowl and add pudding mix. Mix with an electric mixer on low speed until very thick, about 1 minute.", "Add cornstarch mixture to pudding mixture and mix at low speed for 1 minute more.", "Transfer pudding to 4 individual serving bowls. Cover and refrigerate if desired."], "ingredients": [{"name": "almond milk", "quantity": "2 cups, divided"}, {"name": "instant vanilla pudding mix", "quantity": "1 (3.5 ounce) package"}, {"name": "cornstarch", "quantity": "2 teaspoons"}], "created": "2022/09/21", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/L0kPEHc3ofqkYtELIcv9kFIFQvc=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/7826894-91ecdb506e6b40e2aa8d8952182e4ace.jpg"}
{"title": "Healthier Creamy Rice Pudding", "description": "A healthy and delicious version of rice pudding made with brown rice for extra nutrition and fiber. This comforting dessert is creamy, lightly sweetened, and perfect for a healthier treat.", "preparation_time_minutes": 10, "cooking_time_minutes": 70, "steps": ["Combine water and rice in a saucepan over high heat and bring to a boil. Reduce heat to medium-low, cover, and simmer until tender, about 45 minutes.", "In a clean saucepan, combine cooked rice, 1 1/2 cups milk, sugar, and salt. Cook over medium heat until thick and creamy, about 15 to 20 minutes.", "Stir in remaining 1/2 cup milk, beaten egg, and raisins. Cook for an additional 2 minutes, stirring constantly.", "Remove from heat and stir in butter and vanilla extract. Serve warm."], "ingredients": [{"name": "water", "quantity": "1 1/2 cups"}, {"name": "uncooked brown rice", "quantity": "3/4 cup"}, {"name": "low-fat milk", "quantity": "2 cups, divided"}, {"name": "white sugar", "quantity": "1/3 cup"}, {"name": "salt", "quantity": "1/4 teaspoon"}, {"name": "egg", "quantity": "1 large, beaten"}, {"name": "raisins", "quantity": "2/3 cup"}, {"name": "butter", "quantity": "1 tablespoon"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}], "created": "2024/08/26", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/O0RhFiNcO576dZuavaD230Jz1A8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/AR-219442-healthier-creamy-rice-pudding-DDMFS-4x3-8c67b45459f14034b8849ebc531f0787.jpg"}
{"title": " Bread Pudding in the Slow Cooker", "description": "This slow cooker bread pudding recipe is perfect for breakfast, brunch, or dessert. It's easy to prepare and comes out deliciously rich and comforting.", "preparation_time_minutes": 10, "cooking_time_minutes": 180, "steps": ["Place bread and raisins into a slow cooker.", "Whisk milk, eggs, melted butter, sugar, vanilla, and nutmeg together in a bowl; pour over bread and raisins. Toss to evenly coat.", "Cover and cook on Low until a knife inserted near the center comes out clean, about 3 hours."], "ingredients": [{"name": "cubed bread", "quantity": "8 cups"}, {"name": "raisins", "quantity": "1 cup (optional)"}, {"name": "milk", "quantity": "2 cups"}, {"name": "eggs", "quantity": "4"}, {"name": "butter, melted", "quantity": "1/4 cup"}, {"name": "white sugar", "quantity": "1/4 cup"}, {"name": "vanilla extract", "quantity": "1/2 teaspoon"}, {"name": "ground nutmeg", "quantity": "1/4 teaspoon"}], "created": "2023/06/08", "ratings": 4.3, "image_url": "https://www.allrecipes.com/thmb/UpCtKCiSDDrIMZ26GoWRuADGLp0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/2436135-bread-pudding-in-the-slow-cooker-Allrecipes-Magazine-4x3-1-a067736a49984e2c82745a8ac6690e18.jpg"}
{"title": "Kheer (Rice Pudding)", "description": "A flavorful and easy-to-make Indian rice pudding made with coconut milk, basmati rice, raisins, and nuts. It's the best rice pudding you've ever had!", "preparation_time_minutes": 5, "cooking_time_minutes": 30, "steps": ["Bring coconut milk, milk, and sugar to a boil in a large saucepan over medium heat.", "Add rice, reduce the heat to low, and simmer until the mixture thickens and rice is tender, about 20 minutes.", "Stir in raisins, cardamom, and rose water; cook for a few more minutes.", "Ladle into serving bowls and garnish with almonds and pistachios."], "ingredients": [{"name": "coconut milk", "quantity": "2 cups"}, {"name": "milk", "quantity": "2 cups"}, {"name": "white sugar", "quantity": "3 tablespoons"}, {"name": "basmati rice", "quantity": "1/2 cup"}, {"name": "raisins", "quantity": "1/4 cup"}, {"name": "ground cardamom", "quantity": "1/2 teaspoon"}, {"name": "rose water", "quantity": "1/2 teaspoon (Optional)"}, {"name": "sliced almonds, toasted", "quantity": "1/4 cup"}, {"name": "chopped pistachio nuts", "quantity": "1/4 cup"}], "created": "2023/01/02", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/5otaA64vSN3WMrmEXegjDevBQW8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/2237989-74a75a7e04f441fb8180e02811041929.jpg"}
{"title": "Bread Pudding with Whiskey Sauce", "description": "This bread pudding with whiskey sauce is a deliciously rich dessert, perfect for Sunday brunch or any occasion. The whiskey sauce adds a special touch to this comforting treat.", "preparation_time_minutes": 20, "cooking_time_minutes": 60, "steps": ["Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a 9x13-inch baking dish.", "Mix milk, eggs, 3 tablespoons melted butter, and vanilla in a large bowl until well combined. Gradually add 1/4 cup sugar and mix thoroughly until sugar dissolves.", "Place bread cubes into the bottom of the prepared baking dish. Pour milk-egg mixture over the bread, fully saturating it. Sprinkle with pecans.", "Bake in the preheated oven until golden, about 1 hour.", "In the final minutes of baking, combine 1/2 cup sugar, 1/2 cup butter, cream, and whiskey in a saucepan over low heat. Stir constantly until the sauce is gently boiling.", "Remove bread pudding from the oven and pour the whiskey sauce over the top. Serve warm."], "ingredients": [{"name": "milk", "quantity": "2 1/2 cups"}, {"name": "eggs", "quantity": "2, beaten"}, {"name": "butter", "quantity": "3 tablespoons, melted"}, {"name": "vanilla extract", "quantity": "2 tablespoons"}, {"name": "white sugar", "quantity": "3/4 cup, divided"}, {"name": "French bread", "quantity": "1 (1 pound) loaf, cut into 1-inch cubes"}, {"name": "chopped pecans", "quantity": "1 cup"}, {"name": "butter", "quantity": "1/2 cup"}, {"name": "heavy cream", "quantity": "1/2 cup"}, {"name": "whiskey", "quantity": "1/4 cup"}], "created": "2023/05/19", "ratings": 4.6, "image_url": "https://www.allrecipes.com/thmb/SNAKp7gdmeteOqr2kgh3VrMub1M=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/4329960-eeb0a941061242dda39294fa5a7443a0.jpg"}
{"title": "Hasty Chocolate Pudding", "description": "This easy microwave chocolate pudding comes together in minutes, perfect for a quick chocolate fix. You can even stir in chopped bananas for an extra boost of nutrition.", "preparation_time_minutes": 5, "cooking_time_minutes": 5, "steps": ["Whisk together sugar, cocoa, and cornstarch in a microwave-safe bowl.", "Whisk in milk a little at a time, until no dry lumps remain.", "Cook in the microwave on high for 3 minutes. Stir well. Continue cooking and stirring at 1-minute intervals until shiny and thick, 2 to 4 minutes.", "Mix in vanilla.", "Press a piece of plastic wrap directly onto the surface of the pudding to prevent skin from forming.", "Place in the refrigerator to chill. Serve cold."], "ingredients": [{"name": "white sugar", "quantity": "1/2 cup"}, {"name": "unsweetened cocoa powder", "quantity": "1/3 cup"}, {"name": "cornstarch", "quantity": "3 tablespoons"}, {"name": "milk", "quantity": "2 cups"}, {"name": "vanilla extract", "quantity": "2 teaspoons"}], "created": "2023/01/19", "ratings": 4.5, "image_url": "https://www.allrecipes.com/thmb/bkcwTHyce22kHhj3V1NjNO2lThc=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/39891-hasty-chocolate-pudding-Demimi-4x3-1-c79ec6a4f13c4735b435d6870dbe52dd.jpg"}